{"qid": "test-digital-freedoms-piidfaihbg-con03a", "query": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We require the same when a company wants to operate within our territory: suppose a big Chinese company came to our home country and suddenly started criticizing our domestic policies – these are the policies of the sovereign state whose territory it is, and outsiders have no place to tell it how to run itself. [1]  [1] Nicholas Deleon, TechChrunch, ‘China has every right to be upset with Google right now’, March 23, 2010. URL:  Last consulted: December 22, 2011", "gold_docid": "test-digital-freedoms-piidfaihbg-con03b", "rank_T": 659, "rank_baseline": 4, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-piidfaihbg-con03a", "score": 0.6320642232894897, "is_gold": false, "snippet": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We requi"}, {"rank": 2, "docid": "training-free-speech-debate-ifcidffe-pro03b", "score": 0.47966861724853516, "is_gold": false, "snippet": "Corporations are bound to obey the laws of the societies in which they are based, but they are not so constrained in their foreign dealings, in which they are bound instead by foreign laws that are often much more lax. The nature of the international landscape"}, {"rank": 3, "docid": "training-economy-egplhbbsa-con03b", "score": 0.4744712710380554, "is_gold": false, "snippet": "Foreign companies simply adapt to the political and economic conditions that exist in different countries. You cannot blame them for high level of corruption, which is the inner problem of the state. Involvement of business representatives in anti-corruption a"}, {"rank": 4, "docid": "validation-international-gsidfphb-pro04b", "score": 0.4727783799171448, "is_gold": false, "snippet": "There is no reason for foreign companies to be worried about NSA surveillance. The companies involved such as Google have denied involvement “we have not joined any program that would give the U.S. government—or any other government—direct access to our server"}, {"rank": 5, "docid": "training-digital-freedoms-fehwiwcb-con04b", "score": 0.45235148072242737, "is_gold": false, "snippet": "Engagement will still occur. The software exists to aid in uprisings, which is the endpoint of the regime, or at least a signal of its imminent change. It is a play that Western governments should back on a human as well as political level. The subsidies and i"}, {"rank": 6, "docid": "test-law-sdiflhrdffe-pro03b", "score": 0.4347984492778778, "is_gold": false, "snippet": "This policy will not be a public statement of anything other than Western attempts to interfere in the internal affairs of others. It is also a powerfully hypocritical message; many democracies have libel laws that prevent libel and misrepresentation and autho"}, {"rank": 7, "docid": "test-culture-mmctghwbsa-pro04b", "score": 0.4287061095237732, "is_gold": false, "snippet": "Policies which ban will interfere with business practices, restrict free expression, and be are difficult to standardize. If ads do not sell, they will be rejected and when ads are effective they are likely to continue in pursuit of gaining consumers. Business"}, {"rank": 8, "docid": "training-digital-freedoms-fehbwdsot-con03b", "score": 0.42868635058403015, "is_gold": false, "snippet": "Western companies must be governed by codes of ethics. These should not merely stop at the border of their home state. If they are to be ethical actors they must uphold the freedoms they claim to value. If this means not being able to profit massively in marke"}, {"rank": 9, "docid": "training-digital-freedoms-phwbtoabup-con02b", "score": 0.426819384098053, "is_gold": false, "snippet": "The anonymity of this information is far from guaranteed and firms’ data collection can indeed serve as a serious threat to people’s privacy and identity on the internet. The technology in use is extremely difficult to police, and the data, once collected, can"}, {"rank": 10, "docid": "training-international-seighweo-con03b", "score": 0.41939088702201843, "is_gold": false, "snippet": "It must be remembered that the offshore manufacturing and service sectors are relatively young. Workers have not yet had the opportunity to develop coherent collective bargaining strategies. It takes time for those involved in an industry to learn how to act a"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-piidfaihbg-con03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We requi"}, {"rank": 2, "docid": "training-digital-freedoms-fehbwdsot-con03a", "score": 0.766703724861145, "is_gold": false, "snippet": "It results in Western companies getting kicked out of the countries, damaging significant Western businesses  Western businesses have been seeking entry into external markets, some of which could well be classified as oppressive. These firms have invested sign"}, {"rank": 3, "docid": "training-free-speech-debate-ifcidffe-pro03a", "score": 0.7522086501121521, "is_gold": false, "snippet": "The right of Western businesses to sell their services abroad can be curtailed when their actions stand counter to the interests of their home governments  Corporations are private entities that have the right to sell their services and to deal with agents for"}, {"rank": 4, "docid": "test-digital-freedoms-piidfaihbg-con03b", "score": 0.743046760559082, "is_gold": true, "snippet": "Google’s business is inseparable from basic human rights  The World Summit on the Information Society (WSIS), a UN conference, affirmed that access to information is a basic human right, a corollary to the freedom of opinion and expression as articulated in Ar"}, {"rank": 5, "docid": "validation-politics-pgvhwlacc-con01a", "score": 0.7371532320976257, "is_gold": false, "snippet": "Corporations are fundamentally different than individuals and have the right to influence politics differently.  The rules under which an individual citizen operate are different from those of corporations and should remain that way. Corporations and individua"}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-con03b", "score": 0.7348177433013916, "is_gold": false, "snippet": "Western companies must be governed by codes of ethics. These should not merely stop at the border of their home state. If they are to be ethical actors they must uphold the freedoms they claim to value. If this means not being able to profit massively in marke"}, {"rank": 7, "docid": "training-free-speech-debate-ifcidffe-pro03b", "score": 0.730466365814209, "is_gold": false, "snippet": "Corporations are bound to obey the laws of the societies in which they are based, but they are not so constrained in their foreign dealings, in which they are bound instead by foreign laws that are often much more lax. The nature of the international landscape"}, {"rank": 8, "docid": "training-economy-egplhbbsa-con03b", "score": 0.7292654514312744, "is_gold": false, "snippet": "Foreign companies simply adapt to the political and economic conditions that exist in different countries. You cannot blame them for high level of corruption, which is the inner problem of the state. Involvement of business representatives in anti-corruption a"}, {"rank": 9, "docid": "test-digital-freedoms-piidfaihbg-pro02a", "score": 0.7291617393493652, "is_gold": false, "snippet": "Not censoring helps Google’s business proposition and corporate identity  Google’s corporate motto is ‘don’t be evil’. This is partly an issue of corporate identity, and partly a clever business proposition. In both cases, complying with Chinese censorship rul"}, {"rank": 10, "docid": "validation-international-gsidfphb-pro04b", "score": 0.7267928123474121, "is_gold": false, "snippet": "There is no reason for foreign companies to be worried about NSA surveillance. The companies involved such as Google have denied involvement “we have not joined any program that would give the U.S. government—or any other government—direct access to our server"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-sport-otshwbe2uuyt-pro01a", "query": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the constitution that occurred after the Orange revolution have been rolled back to give more power to the presidency. [1] Most visibly opponents of the regime such as Yulia Timoshenko have been jailed in politically motivated trials. At the same time there have been attacks on the freedom of the media and Ukraine has fallen down rankings of press freedom in 2010-11 with its score from freedom house falling from 56 to 59 with its ranking falling to 130th. [2]  Ukraine, like its neighbours Russia and Belarus, has become a ‘virtual mafia state’ where the SBU (Ukraine’s successor to the KGB) is all powerful and the elite are unaccountable. [3] It is becoming more and more corrupt as is shown by its fall down the Corruption Perceptions Index from 118th in 2007 to 152nd in 2011. [4] Ukraine is clearly going in the wrong direction and European leaders need to stand up and show that the will not allow this to continue.  [1] Bureau of Democracy, Human Rights, and Labor, ‘2010 Country Reports on Human Rights Practices Report’, U.S. Department of State, 8 April 2011.  [2] Karlekar, Karin Deutsch and Dunham, Jennifer, ‘Press Freedom in 2011: Breakthroughs and Pushback in the Middle East’, Freedom House, 2012, pp.7, 16.  [3] Luzio, Taras, ‘Ukraine, Like Russia, Is Becoming a ‘Virtual Mafia State’’, Atlantic Council, 1 March 2012.  [4] Transparency International, Corruption Perceptions Index 2011 , Transparency International, Corruption Perceptions Index 2007 .", "gold_docid": "test-sport-otshwbe2uuyt-pro01b", "rank_T": 171, "rank_baseline": -1, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-sport-otshwbe2uuyt-pro01a", "score": 0.7734586596488953, "is_gold": false, "snippet": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the co"}, {"rank": 2, "docid": "test-politics-oepghbrnsl-pro01b", "score": 0.4975377321243286, "is_gold": false, "snippet": "All periods of transition have been chaotic by definition and reforms are by their nature disruptive. At the same time, it is only through these reforms that a future of freedom and prosperity is possible. While a long transition process can certainly cloud mi"}, {"rank": 3, "docid": "training-politics-gvhbtnd-pro01b", "score": 0.4881064295768738, "is_gold": false, "snippet": "Each country should be free to decide which freedoms are important to it and fit with its own culture rather than having to fit into a western straitjacket in order to be considered ‘democratic’. It is true that press freedoms are a difficult issue but it is n"}, {"rank": 4, "docid": "test-free-speech-debate-magghbcrg-con01b", "score": 0.48646247386932373, "is_gold": false, "snippet": "Opposition is letting state-sanctioned media off the hook fantastically lightly. Just staying within the Arab world, the number of broadcasters that sully the name of journalism by acting as apologists for butchers and torturers is astonishing. One example of "}, {"rank": 5, "docid": "training-politics-oamepwhbwi-pro03b", "score": 0.48536843061447144, "is_gold": false, "snippet": "Far from creating a liberated and free democracy western intervention has set Libya on the path to becoming a failed state. The country is today ranked among the most insecure countries in the world [1]. Two years after the war, The country has not managed to "}, {"rank": 6, "docid": "training-free-speech-debate-ifcidffe-con01b", "score": 0.4827645421028137, "is_gold": false, "snippet": "Real politick is not the only consideration democracies should entertain when they engage in international relations. Indeed, the Western powers have sought since World War II to develop a system of international justice that recognizes the primacy of peoples’"}, {"rank": 7, "docid": "training-law-hrilhwsyh-pro03b", "score": 0.48040711879730225, "is_gold": false, "snippet": "There is little evidence that Yanukovych still has much support anywhere in Ukraine. However an ICC trial could simply inflame the other side; those who have overthrown Yanukovych are likely to want a trial to take place as soon as possible (which may be a lon"}, {"rank": 8, "docid": "training-law-cplghrhwrgo-pro03b", "score": 0.4743581712245941, "is_gold": false, "snippet": "Undeniably, any government needs confidence and trust from the population in order to implement reforms in an efficient way. You need the citizens to be on the same side with the elected officials rather than trying to impede them from doing their job. Despite"}, {"rank": 9, "docid": "training-international-egilpwhbrh-pro02b", "score": 0.46938514709472656, "is_gold": false, "snippet": "Acting due to a change of government is not the prerogative of another state. Putin is within his rights not to recognise that government and to grant asylum to former president Yanukovych but not to take action within the Ukraine to change the situation.  The"}, {"rank": 10, "docid": "test-economy-bepighbdb-pro01b", "score": 0.4656547009944916, "is_gold": false, "snippet": "This makes the assumption that dictators are rational, wise and seek to encourage development, rather than operate as kleptocrats. This is why dictatorship usually does not benefit development; the very concentration of power means when they make poor decision"}], "topK_baseline": [{"rank": 1, "docid": "test-sport-otshwbe2uuyt-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the co"}, {"rank": 2, "docid": "test-sport-otshwbe2uuyt-con05a", "score": 0.7670028209686279, "is_gold": false, "snippet": "Europe needs to prevent Russian influence in Ukraine  If Europe shuns Ukraine then Yanukovych has an obvious alternative he can turn to; Russia. Putin, the newly re-elected President of Russia, is holding out the option of a customs union with Ukraine which Ya"}, {"rank": 3, "docid": "training-economy-ecegiehbe-con03b", "score": 0.7663929462432861, "is_gold": false, "snippet": "The EU, in practice, is not a particularly consistent or effective promoter of democracy. It has been unsuccessful in countries such as Ukraine and Georgia in the European neighbourhood (18): this suggests the EU can only lead countries into democracy when the"}, {"rank": 4, "docid": "test-sport-otshwbe2uuyt-pro02a", "score": 0.7621301412582397, "is_gold": false, "snippet": "Boycotting Euro 2012 will highlight Ukraine’s backsliding on human rights  European leaders must take a stand on human rights in their own back yard if they are to be taken seriously on the issue anywhere in the world. There are numerous human rights abuses in"}, {"rank": 5, "docid": "training-international-egilpwhbrh-pro02b", "score": 0.7508441805839539, "is_gold": false, "snippet": "Acting due to a change of government is not the prerogative of another state. Putin is within his rights not to recognise that government and to grant asylum to former president Yanukovych but not to take action within the Ukraine to change the situation.  The"}, {"rank": 6, "docid": "training-law-hrilhwsyh-pro03b", "score": 0.7472614049911499, "is_gold": false, "snippet": "There is little evidence that Yanukovych still has much support anywhere in Ukraine. However an ICC trial could simply inflame the other side; those who have overthrown Yanukovych are likely to want a trial to take place as soon as possible (which may be a lon"}, {"rank": 7, "docid": "test-politics-oepghbrnsl-pro01b", "score": 0.7469629049301147, "is_gold": false, "snippet": "All periods of transition have been chaotic by definition and reforms are by their nature disruptive. At the same time, it is only through these reforms that a future of freedom and prosperity is possible. While a long transition process can certainly cloud mi"}, {"rank": 8, "docid": "test-politics-oepghbrnsl-pro04b", "score": 0.7451327443122864, "is_gold": false, "snippet": "History is not destiny and a highly-selective view of Russia's past should not lead us to prefer authoritarian rule today. The Tsars and their communist successors killed millions of people through brutal rule and failed policies - made possible by the same la"}, {"rank": 9, "docid": "test-politics-oepghbrnsl-pro03a", "score": 0.7420944571495056, "is_gold": false, "snippet": "A strong leader is working in the state’s best interest  Putin’s authoritarian style is not a threat to democracy but rather a requirement for a successful and quicker transition. Having Putin control the media is probably healthier than having it be controlle"}, {"rank": 10, "docid": "training-law-hrilhwsyh-pro04a", "score": 0.7409142255783081, "is_gold": false, "snippet": "The Ukrainian justice system is broken  Justice for Yanukovych should be international simply because it would be a much better guarantor of a fair trial. The Ukrainian justice system is unfortunately corrupt, and at the behest of prosecutors; it has an amazin"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-economy-epehwmrbals-con02a", "query": "There is nothing wrong with individualised standards. It is the question on implementing them better and not raising standards  The chances that these international labour standards are even relevant to these developing nations are low. For example, India need not ratify the two core conventions on protecting trade union rights because these are rights that pertain to workers in formal employment. A majority of India’s workforce is not in formal employment, and hence not covered by any legal provisions. Similarly in many developing economies a large portion of the workforce is engaged in subsistence farming, something that labour standards are never going to apply to as those involved will do whatever they need to in order to get by. Therefore, there needs to be a different standard applied to the situation specific problems. What needs to be recognised is how no to low labour standards in developing countries can be a significant improvement over the only alternative that was previously available; subsistence farming. One size fits all does not work in such a diverse global economy and donors should recognise the benefits of helping development to bring people out of subsistence farming.", "gold_docid": "test-economy-epehwmrbals-con02b", "rank_T": 137, "rank_baseline": 9, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-economy-epehwmrbals-con02a", "score": 0.7472134828567505, "is_gold": false, "snippet": "There is nothing wrong with individualised standards. It is the question on implementing them better and not raising standards  The chances that these international labour standards are even relevant to these developing nations are low. For example, India need"}, {"rank": 2, "docid": "test-economy-epehwmrbals-pro03b", "score": 0.5969372987747192, "is_gold": false, "snippet": "This is a common logical fallacy. With limited resources, there is a limited bandwidth within which one can stretch the standard above the capable standard. It is not favourable to increase this gap too much for then it is not realistic. Many countries have ra"}, {"rank": 3, "docid": "test-economy-epehwmrbals-con04b", "score": 0.5798236131668091, "is_gold": false, "snippet": "It is irrelevant that some western countries do not always meet the highest labour standards; does it matter that Germany does not have a national minimum wage when there are minimum wages for each sector? These are countries where one labour standard can be s"}, {"rank": 4, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.5746392011642456, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 5, "docid": "test-economy-epehwmrbals-pro05b", "score": 0.4958389401435852, "is_gold": false, "snippet": "This is similar to the debate of imposing uniform carbon emission caps on all nations. This would be unfair as the developing world would be at a disadvantage as it takes away one of the ways in which poorer countries compete effectively in the global market; "}, {"rank": 6, "docid": "test-economy-epehwmrbals-pro01b", "score": 0.49056386947631836, "is_gold": false, "snippet": "Not all standards benefit human rights and some could even undermine individual’s most basic human rights such as that to sustenance and shelter. Standards combating child labour, for example, could be misguided. In many developing countries, child labour is a"}, {"rank": 7, "docid": "test-economy-epegiahsc-con01b", "score": 0.4870748519897461, "is_gold": false, "snippet": "Protectionism cannot create a healthy national industry. Only by competing openly against each other on the global market, companies become truly efficient and effective. And small, local companies and industries can often have the advantage in such a confront"}, {"rank": 8, "docid": "training-international-gsciidfi-pro03b", "score": 0.48390835523605347, "is_gold": false, "snippet": "Were proposition’s case true then it would raise the question of why no consumers groups have been involved in the negotiations or representative of cloth and other manufacturers in the developing world – or for that matter the originators of design techniques"}, {"rank": 9, "docid": "training-economy-bepeechbem-con01b", "score": 0.47987672686576843, "is_gold": false, "snippet": "Businesses are already regulated in who they can hire and on what terms– for that reason there are child labour, minimum wage and anti-discrimination laws. These kind of regulations come both from national governments and the European Union. Governments have a"}, {"rank": 10, "docid": "training-international-seighweo-con03b", "score": 0.4746703505516052, "is_gold": false, "snippet": "It must be remembered that the offshore manufacturing and service sectors are relatively young. Workers have not yet had the opportunity to develop coherent collective bargaining strategies. It takes time for those involved in an industry to learn how to act a"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-epehwmrbals-con02a", "score": 1.0000001192092896, "is_gold": false, "snippet": "There is nothing wrong with individualised standards. It is the question on implementing them better and not raising standards  The chances that these international labour standards are even relevant to these developing nations are low. For example, India need"}, {"rank": 2, "docid": "test-economy-epehwmrbals-pro01b", "score": 0.8487749695777893, "is_gold": false, "snippet": "Not all standards benefit human rights and some could even undermine individual’s most basic human rights such as that to sustenance and shelter. Standards combating child labour, for example, could be misguided. In many developing countries, child labour is a"}, {"rank": 3, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.8312178254127502, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 4, "docid": "test-economy-epehwmrbals-pro05a", "score": 0.8302937150001526, "is_gold": false, "snippet": "When developing countries employ poor labour standards, other countries follow the example in order to be competitive  As long as developing nations constantly keep employing poor labour standards, it will keep putting a strain on the global economy. This is b"}, {"rank": 5, "docid": "test-economy-epehwmrbals-con04b", "score": 0.8251003623008728, "is_gold": false, "snippet": "It is irrelevant that some western countries do not always meet the highest labour standards; does it matter that Germany does not have a national minimum wage when there are minimum wages for each sector? These are countries where one labour standard can be s"}, {"rank": 6, "docid": "test-economy-epehwmrbals-pro03b", "score": 0.8248569369316101, "is_gold": false, "snippet": "This is a common logical fallacy. With limited resources, there is a limited bandwidth within which one can stretch the standard above the capable standard. It is not favourable to increase this gap too much for then it is not realistic. Many countries have ra"}, {"rank": 7, "docid": "test-economy-epehwmrbals-con01a", "score": 0.8244077563285828, "is_gold": false, "snippet": "Universal standards of labour and business are not suited to the race for development  Developing countries are in a race to develop their economies. The prioritisation of countries that are not currently developed is different to the priorities of developed c"}, {"rank": 8, "docid": "test-economy-epehwmrbals-pro02a", "score": 0.8225357532501221, "is_gold": false, "snippet": "International labour and business standards go hand in hand with development standards and will de facto increase implementation levels  What are international labour and business standards? They are globally acceptable methods of doing business and employing "}, {"rank": 9, "docid": "test-economy-epehwmrbals-con02b", "score": 0.8160758018493652, "is_gold": true, "snippet": "Individualised standards can be dangerous. International standards could be set at a minimum level on which every country could add measures tailored to its needs as is the case with the Declaration on Fundamental Principles and Rights at Work. Countries tend "}, {"rank": 10, "docid": "test-economy-epehwmrbals-con04a", "score": 0.8158395290374756, "is_gold": false, "snippet": "There is uneven implementation of labour standards even in western countries  Western countries often do embrace high levels of labour standards or do not follow their labour regulations. Germany for example has no minimum wage [1] while the USA has no legal o"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-bmaggiahbl-con03a", "query": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state in East Africa [1] where everyone is accountable and equal before the law.  How can this be without an aggressive free press? Annually, all government officials are cross examined by locals publicly in a forum called national dialogue “Umushyikirano”, to ensure that they meet the needs of citizens and assess their performance[2]. This has given Rwandans courage to express their desires and feel much valued in the process of policy making and engagement. It puts ministers and even the Prime Minister on the spot on individual issues. Restricted press and speech is therefore rendered irrelevant by such programs as people can question authorities and demand justification directly rather than relying on the press.  In Africa, most countries lack transparent government systems and institutions, a factor responsible for continued corruption, poor governance and crime which in turn destroy progress in societies [3], but this is not the case with regard to Rwanda.  [1] Zegabi East Africa news, ‘Transparency International Ranks Rwanda the Least Corrupt Country in East Africa’, 5 December 2013, zegabi.com  [2] Hunt, Swanee ‘Rebuilding Rwanda: Access and Accountability’, inclusivesecurity.org, 30 December 2013  [3] Jones Lang Lasale, ‘Sub-Saharan Africa: A region with opportunities amid transparency challenges’, joneslanglasale.eu", "gold_docid": "test-international-bmaggiahbl-con03b", "rank_T": 106, "rank_baseline": 9, "overlap@K": 0.2, "topK_T": [{"rank": 1, "docid": "test-international-bmaggiahbl-con03a", "score": 0.5927333831787109, "is_gold": false, "snippet": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state"}, {"rank": 2, "docid": "test-international-bmaggiahbl-con01b", "score": 0.5765854120254517, "is_gold": false, "snippet": "Restricted press and speech also limits political debate and engagement which are crucially needed in adopting fruitful policies[1]. The best policies are those that are rigorously debated and analysed. The current leadership may have acted to check corruption"}, {"rank": 3, "docid": "test-politics-lghwdecm-pro02b", "score": 0.5266850590705872, "is_gold": false, "snippet": "An elected mayor would give the appearance of accountability, but at the risk of stifling democratic debate. At present policies are debated by council committees, and then by the full council, which represents a wide spectrum of views and interests; the publi"}, {"rank": 4, "docid": "training-international-algsfmhbc-pro01b", "score": 0.5178307890892029, "is_gold": false, "snippet": "There is no consensus on the assumption that CSOs may function as alternative channels of accountability. This, in fact, would require CSOs to be democratically accountable themselves. Yet, this is not the case. There is no form of direct accountability betwee"}, {"rank": 5, "docid": "training-free-speech-debate-fchblmdakw-pro03b", "score": 0.4968106150627136, "is_gold": false, "snippet": "Yes the military has to be accountable but this does not mean that it is directly accountable to the people. Instead the military is accountable to the civilian leadership of the country who is then in turn accountable to the people. The people designate their"}, {"rank": 6, "docid": "test-law-ralhrilglv-con03b", "score": 0.490511417388916, "is_gold": false, "snippet": "Kenya does not need or want government by those who hand out illegal title deeds [1] and threaten the freedom of the press [2] as Kenyatta’s government does.  In addition to that, the allegations that the president used a banned occult gang, the Mungiki, in or"}, {"rank": 7, "docid": "test-international-sepiahbaaw-pro01b", "score": 0.4802277386188507, "is_gold": false, "snippet": "Resources don’t have to mean poor governance. In 2013, attempts were made to counter corruption, the G8 and EU have both began work on initiatives to increase the transparency of foreign firms extracting resources in Africa [1] . The Extractive Industries Tran"}, {"rank": 8, "docid": "training-international-appgovrsus-pro03b", "score": 0.47302836179733276, "is_gold": false, "snippet": "Everyone is for transparency when it is taxpayers’ money that is being spent however transparency does not make it a worthwhile investment. Ban Ki-moon, the United Nations Secretary General says that “Last year, corruption prevented 30 per cent of all developm"}, {"rank": 9, "docid": "test-free-speech-debate-fchbjaj-pro02a", "score": 0.4729355275630951, "is_gold": false, "snippet": "Governments have always struggled with the idea of press investigation and freedom of information, claiming Assange is not a journalist is simply a stunt.  We know that most governments struggle with the idea of not having control over information and are susp"}, {"rank": 10, "docid": "test-international-bmaggiahbl-pro03b", "score": 0.4664970636367798, "is_gold": false, "snippet": "Many donors have been deeply reluctant to stop or reduce aid, whatever the arguments over eastern Congo[1]. Donors like to see their money have an impact, something that Rwanda’s transformation has provided. There might be concern about freedom of speech and t"}], "topK_baseline": [{"rank": 1, "docid": "test-international-bmaggiahbl-con03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state"}, {"rank": 2, "docid": "test-international-bmaggiahbl-con01b", "score": 0.8178171515464783, "is_gold": false, "snippet": "Restricted press and speech also limits political debate and engagement which are crucially needed in adopting fruitful policies[1]. The best policies are those that are rigorously debated and analysed. The current leadership may have acted to check corruption"}, {"rank": 3, "docid": "test-international-bmaggiahbl-pro01b", "score": 0.7644727230072021, "is_gold": false, "snippet": "Rwanda does not limit freedoms of press and speech as such but discourages the use of sensitive articles or speeches that would provoke insecurity in a country still trying to heal from the wounds of genocide. This cannot be therefore considered abusing people"}, {"rank": 4, "docid": "test-international-bmaggiahbl-con02b", "score": 0.7601484656333923, "is_gold": false, "snippet": "While the government of Rwanda has chosen the economy this does not mean the people agree – simply that the government controls the narrative so giving the impression, or persuading them that they agree.  Restricting free speech and press has increased critics"}, {"rank": 5, "docid": "test-international-bmaggiahbl-pro01a", "score": 0.7546400427818298, "is_gold": false, "snippet": "Authoritarian leadership  President Kagame though considered a visionary leader has made Rwanda a country based on one man’s ideas. He has silenced critics, opposition and any counter arguments that may not support his opinions through tough rules imposed agai"}, {"rank": 6, "docid": "training-politics-gvhbtnd-pro01b", "score": 0.7509779334068298, "is_gold": false, "snippet": "Each country should be free to decide which freedoms are important to it and fit with its own culture rather than having to fit into a western straitjacket in order to be considered ‘democratic’. It is true that press freedoms are a difficult issue but it is n"}, {"rank": 7, "docid": "test-international-bmaggiahbl-con02a", "score": 0.7472900152206421, "is_gold": false, "snippet": "Setting Rwanda's priorities  Rwanda is an emerging democracy healing from the wounds of the horrific past. To achieve the set vision, there should be a priority which in this case is economic development[1].  A large number of Rwandans believe that the governm"}, {"rank": 8, "docid": "test-international-bmaggiahbl-pro02a", "score": 0.741849422454834, "is_gold": false, "snippet": "Blind obedience to authority  One of the major factors that exacerbated genocide ideology was the “AKAZU” controlled media which made most of the Hutu population wrongfully obey authority and government propaganda of divisionism[1].  This was achieved by procl"}, {"rank": 9, "docid": "test-international-bmaggiahbl-con03b", "score": 0.7416564226150513, "is_gold": true, "snippet": "It is a wrong assertion that Rwandans are valued in the process of policy making when their genuine opinions are limited to a certain level. The national dialogue is a three day event and cannot cover the concerns of more than 11 million Rwandans. Moreover whe"}, {"rank": 10, "docid": "test-international-bmaggiahbl-con01a", "score": 0.7371307611465454, "is_gold": false, "snippet": "Focused leadership  Progress in Africa has been hindered by factors like corruption, conflicts and poor infrastructure, all of which are linked to the incompetent or greedy leaders.  Rwanda is a different case, ranked among the best countries with a strong and"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-digital-freedoms-eifpgdff-con02a", "query": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coordinated responses. One type of crime that has particularly become a problem on the internet is child sexual abuse material: the internet allows for an easy and anonymous distribution method which can even be secured by modern encryption methods. [1]  Governments can help fight this by requiring ISPs and mobile companies to track people’s internet histories, hand over data when requested, and allow police to get information from them without a search warrant, something which has been proposed by the Canadian government. [2] In Australia, the government even proposed mandatory filtering of all internet traffic by ISPs to automatically filter out all child sexual abuse material. [3]  Admittedly, these measures seem drastic – but in cases like these, or similar cases like terrorism, the harm prevented is more important.  [1] ‘Child Pornography on the Rise, Justice Department Reports’. 2010.  [2] ‘Current laws not focused enough to combat child porn online’. 2012.  [3] Mcmenamin, Bernadette, ‘Filters needed to battle child porn’. 2008.", "gold_docid": "test-digital-freedoms-eifpgdff-con02b", "rank_T": 85, "rank_baseline": 2, "overlap@K": 0.2, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con02a", "score": 0.6033270359039307, "is_gold": false, "snippet": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coor"}, {"rank": 2, "docid": "training-law-cplghrhwrgo-con02b", "score": 0.48822104930877686, "is_gold": false, "snippet": "It is obvious that warrantless tracking of citizens is not the only way to fight crime. There are other ways which do not negatively impact the citizens to such an extent.  When talking exclusively about protection, the government could have better trained pol"}, {"rank": 3, "docid": "training-science-ciidffehwa-pro05b", "score": 0.4839724898338318, "is_gold": false, "snippet": "Putting the power to censor the internet, no matter how stringent or specific the guidelines, into the hands of a private organization is misguided. It is the state not individual ISPs who are needed to assess how dangerous a site is, whether it is actually pr"}, {"rank": 4, "docid": "training-law-lgpcphwawtai-con02b", "score": 0.47207409143447876, "is_gold": false, "snippet": "This argument is made irrelevant by the fact that the UK and other jurisdictions have rules of evidence which prevent the release of sensitive information from intelligence services [1] . There is no reason why playing a few minutes of recorded conversation in"}, {"rank": 5, "docid": "training-science-ciidffehwa-con04b", "score": 0.4699769914150238, "is_gold": false, "snippet": "Forcing extremists underground can only serve the cause of justice. With them out of the spotlight they are less likely to drag in new recruits among casual, open-minded internet-goers. Underground they are less visible, less legitimate-seeming, and less likel"}, {"rank": 6, "docid": "training-digital-freedoms-piidfphwbaa-pro03b", "score": 0.46378156542778015, "is_gold": false, "snippet": "Moves illegal activity in harder to monitor areas. Those partaking in planning illegal activity will not continue to do so if hiding their identities is not possible. Instead, they will return to using more private means of communication, such as meeting in pe"}, {"rank": 7, "docid": "validation-international-gsidfphb-con01b", "score": 0.4636249542236328, "is_gold": false, "snippet": "No one disputes that some surveillance is necessary, the question is how much. Is the use of bulk catch all surveillance useful? In the case cited it seems not – this was the monitoring of specific individuals who were already known to US intelligence services"}, {"rank": 8, "docid": "training-law-umlcphwrmrvc-con04b", "score": 0.4603772461414337, "is_gold": false, "snippet": "Bans and restrictions on the old media would equally affect the ‘new’ media of the internet age. Bloggers could just as easily be taken to court for their reporting as conventional journalists so the news would still be restricted. While individuals may still "}, {"rank": 9, "docid": "test-international-gsciidffe-con04b", "score": 0.45265141129493713, "is_gold": false, "snippet": "The NATO manual does specifically state “network intrusions, the deletion or destruction of data… computer network exploitation, and data theft do not amount to a non-international armed conflict.” [1] Instead it has to be persistent, and be carried out by org"}, {"rank": 10, "docid": "training-digital-freedoms-aihbied-con03b", "score": 0.4511626064777374, "is_gold": false, "snippet": "With any tool there are going to be people who misuse it, yet cases of misuse do not outweigh times when the internet has proven to be an important force for democracy. Internet and SMS have helped to organize almost every uprising in the Middle East and the O"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con02a", "score": 1.0, "is_gold": false, "snippet": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coor"}, {"rank": 2, "docid": "test-digital-freedoms-eifpgdff-con02b", "score": 0.7847515940666199, "is_gold": true, "snippet": "Battling hideous crimes shouldn’t lead us to draconian and ineffective policies  Everyone is against child sexual abuse material. But in their drive to battle it, governments might go too far. For example, granting the police the right to search without (full)"}, {"rank": 3, "docid": "test-digital-freedoms-eifpgdff-con01a", "score": 0.7679726481437683, "is_gold": false, "snippet": "Internet regulation is necessary to ensure a safe internet  Citizens, corporations, and public organizations face several security threats when online: critical infrastructure systems can be hacked, like the energy transport system, [1] citizens can fall victi"}, {"rank": 4, "docid": "training-digital-freedoms-aihbied-con03b", "score": 0.765579879283905, "is_gold": false, "snippet": "With any tool there are going to be people who misuse it, yet cases of misuse do not outweigh times when the internet has proven to be an important force for democracy. Internet and SMS have helped to organize almost every uprising in the Middle East and the O"}, {"rank": 5, "docid": "training-free-speech-debate-gfsdifscp-pro03b", "score": 0.7593895792961121, "is_gold": false, "snippet": "It is not true that people cannot manage consequences from their action online. It might only seem so but that is because the issues around personal data have emerged relatively recently, so we are still learning to deal with them. Individuals are learning how"}, {"rank": 6, "docid": "test-science-ciidfaihwc-con02b", "score": 0.7591904997825623, "is_gold": false, "snippet": "The Internet may be a global resource, but if information on it is have a detrimental effect upon a particular country, it certainly is that government’s responsibility and right to tackle it. If it affects their society and the citizens within it, it affects "}, {"rank": 7, "docid": "training-digital-freedoms-gtdfais-con03a", "score": 0.7581948637962341, "is_gold": false, "snippet": "The prevention of atrocities during war and unrest.  In the past, horrific crimes could be committed in war zones without anyone ever knowing about it, or with news of it reaching the international community with a significant time lag, when it was too late to"}, {"rank": 8, "docid": "training-digital-freedoms-fehwufafra-con04b", "score": 0.7563943862915039, "is_gold": false, "snippet": "This implies that without efforts by democracies to ‘undermine’ non democratic regimes the internet would be nice and peaceful and everyone could get on with what they like doing on the internet. Nothing could be further from the truth. There is already a sign"}, {"rank": 9, "docid": "validation-science-ihbrapisbpl-con01a", "score": 0.7532660961151123, "is_gold": false, "snippet": "Internet anonymity allows internet users to engage in illegal activities  The internet is being used for illegal activities. Examples of these are trading and trafficking in child pornography, drug trading and planning and coordinating terrorist activities. [1"}, {"rank": 10, "docid": "training-digital-freedoms-gtdfais-pro03a", "score": 0.752027690410614, "is_gold": false, "snippet": "The internet as a threat to public safety.  The internet can be used as a tool to create an imminent threat to the public. If public officials had information that a massive protest is being organized, which could spiral into violence and endanger the safety o"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-economy-eptpghdtre-con01a", "query": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cuts were responsible for the creation of 6.6 million jobs, primarily in the private sector – real jobs producing real goods and providing real services not tax-payer funded sinecures to mask the reality of the economic situation. [i]  [i] The White House, “Fact Sheet: Job Creation Continues – More than 6.6 Million Jobs Created Since August 2003”, 6 October 2006,", "gold_docid": "test-economy-eptpghdtre-con01b", "rank_T": 66, "rank_baseline": 5, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-economy-eptpghdtre-con01a", "score": 0.6609330177307129, "is_gold": false, "snippet": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cu"}, {"rank": 2, "docid": "test-economy-eptpghdtre-pro02b", "score": 0.618982195854187, "is_gold": false, "snippet": "The reason for the apparent superiority of Democrat administrations is that they use government as a job creation service; using taxpayers’ money to create jobs in a bloated federal administration [i] .  Ultimately, these are not real jobs as they are not actu"}, {"rank": 3, "docid": "test-economy-eptpghdtre-pro02a", "score": 0.563826858997345, "is_gold": false, "snippet": "Historically Democrats have presided over more economic stability whereas the GOP is the party of boom and Bust  During the past 60 years Democrats have been considerably more likely to preside over a balanced budget than their Republican rivals. Since the OPE"}, {"rank": 4, "docid": "test-economy-thsptr-pro05b", "score": 0.5590932369232178, "is_gold": false, "snippet": "Progressive taxation does not improve economic growth. This is because, when the rich are heavily taxed, they have less likely to invest in new enterprises. Higher taxes serve as a disincentive to investment, both domestic and foreign. As to economic growth in"}, {"rank": 5, "docid": "training-economy-epehwpaja-pro03b", "score": 0.5400329828262329, "is_gold": false, "snippet": "The American Jobs Act may be projected to create a lot of jobs. However, this comes following tax cuts and a fiscal stimulus package in 2009. In the past these measures to help the economy failed, with unemployment remaining stagnant at around 25 million despi"}, {"rank": 6, "docid": "training-philosophy-ppphwrbtcw-pro01b", "score": 0.5352808833122253, "is_gold": false, "snippet": "Under current economic circumstances, the deficit is bad, and a downgrade of the credit rating has bad effects. However, stimulation of the economy during a recession is needed more.  If the economy is stimulated through lower taxes, it might cause it to recov"}, {"rank": 7, "docid": "training-philosophy-ppphwrbtcw-con02b", "score": 0.5306050181388855, "is_gold": false, "snippet": "Firstly, the harm to small business from such tax cuts could easily be mitigated by providing some measure of exception for small business owners. The U.S. already provides subsidies for small businesses that show signs of innovation and as such it seems logic"}, {"rank": 8, "docid": "training-economy-tpvovrsugcsc-pro02b", "score": 0.5181233286857605, "is_gold": false, "snippet": "Raising taxes for individuals with income over $250,000 will have a hugely detrimental outcome. This is because a huge number of small businesses are legally taxed as individuals. Raising taxes may be manageable for wealthy individuals, but small firms will be"}, {"rank": 9, "docid": "test-economy-eptpghdtre-con03a", "score": 0.515855610370636, "is_gold": false, "snippet": "“After three years, it is clear that President Obama’s budget-busting policies have not created jobs and have only added to our debt,”  The Obama administration has been profligate with taxpayers’ money, has failed to deal with the economic crisis and has incr"}, {"rank": 10, "docid": "test-economy-eptpghdtre-pro01b", "score": 0.4935101866722107, "is_gold": false, "snippet": "The logic behind tax cuts is two-fold. The first is that it isn’t the government’s money, it belongs to the people who worked hard to earn it. The second is that cash in people’s pockets acts as a stimulus to the economy which it doesn’t sitting in the governm"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-eptpghdtre-con01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cu"}, {"rank": 2, "docid": "test-economy-eptpghdtre-pro02b", "score": 0.7449523210525513, "is_gold": false, "snippet": "The reason for the apparent superiority of Democrat administrations is that they use government as a job creation service; using taxpayers’ money to create jobs in a bloated federal administration [i] .  Ultimately, these are not real jobs as they are not actu"}, {"rank": 3, "docid": "test-economy-thsptr-pro05b", "score": 0.7348541021347046, "is_gold": false, "snippet": "Progressive taxation does not improve economic growth. This is because, when the rich are heavily taxed, they have less likely to invest in new enterprises. Higher taxes serve as a disincentive to investment, both domestic and foreign. As to economic growth in"}, {"rank": 4, "docid": "training-economy-epfthwpebd-pro03a", "score": 0.7342638969421387, "is_gold": false, "snippet": "Many of the reasons for operating a debt have now been eliminated  At the end of the Clinton presidency the government was running at a healthy surplus following the longest sustained period of growth in US history. Bush Chose to spend that on tax cuts and two"}, {"rank": 5, "docid": "test-economy-eptpghdtre-con01b", "score": 0.7327703833580017, "is_gold": true, "snippet": "George Bush announced that cutting government was one of his greatest priorities, his actions could not have been further from this ambition. As with most Republican presidents, government spending grew considerably on his watch. Indeed no president since FDR "}, {"rank": 6, "docid": "training-economy-tpvovrsugcsc-con02a", "score": 0.7276659607887268, "is_gold": false, "snippet": "Tax cuts and spending cuts are necessary for growth.  With a national unemployment rate of 8.1% as of September 2012 [1], the United States economy has not recovered from the global financial crisis of 2008 and the recession that followed it. Governor Mitt Rom"}, {"rank": 7, "docid": "training-economy-epehwpaja-pro03a", "score": 0.7257779240608215, "is_gold": false, "snippet": "The American Jobs Act Helps Small Business and Creates Jobs  The American Jobs Act helps small businesses and is also set to significantly increase the number of jobs available to people. Small enterprise is particularly important in the creation of jobs becau"}, {"rank": 8, "docid": "training-economy-epehwpaja-con03b", "score": 0.7232807874679565, "is_gold": false, "snippet": "Whilst successful individuals may be confronted with an increased tax bill, the American Jobs Act also significantly reduces taxes on businesses. This is especially important with respect to innovative risk as it is businesses, not individuals, which bear the "}, {"rank": 9, "docid": "training-economy-egppgghwgo-pro02b", "score": 0.7213156223297119, "is_gold": false, "snippet": "President Bush took a series of extremely difficult decisions that were necessary for national security. Admittedly they were expensive but they made the world a safer place. His decisions on taxation ensured that all Americans benefitted from economic growth."}, {"rank": 10, "docid": "training-economy-epehwpaja-con03a", "score": 0.7194451093673706, "is_gold": false, "snippet": "The American Jobs Act Will Not Help Successful Businesses  While the American Jobs Act gives help to small businesses it does nothing to help proven companies that already have a record of success as is shown by their size. Indeed these companies may even be h"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-digital-freedoms-eifpgdff-con03a", "query": "Internet regulation is necessary to ensure a working economy on the internet  As seen above, the internet has enabled many types of criminal behavior. But it has also enabled normal citizens to share files. Music, movie and game producers have difficulty operating in a market where their products get pirated immediately after release and spread for free instantaneously on a massive scale. The internet enables violation of their right of ownership, gained through providing the hard work of creating a work of art, on a massive scale. Since it’s impractical to sue and fine each and every downloader, a more effective and less invasive policy would be government requiring Internet Service Providers to implement a graduated response policy, which has ISPs automatically monitor all internet traffic and fine their users when they engage in copyright violation. Something along these lines has already been tried in France, called HADOPI, which has succeeded in decreasing the downloading of unauthorized content. [1]  Apart from this, governments also need to think about how to translate everyday offline activities onto the internet. For example, when you file your tax report offline, you would sign it with your handwritten signature. The online variant would be a digital signature. [2] Developing and deploying a digital signature would enable citizens and corporations to do business, file their tax reports and pay their taxes online.  [1] Crumley, ‘Why France’s Socialists Won’t Kill Sarkozy’s Internet Piracy Law’, 2012  [2] Wikipedia, ‘Digital Signatures’, 2012.", "gold_docid": "test-digital-freedoms-eifpgdff-con03b", "rank_T": 54, "rank_baseline": 2, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con03a", "score": 0.5576086044311523, "is_gold": false, "snippet": "Internet regulation is necessary to ensure a working economy on the internet  As seen above, the internet has enabled many types of criminal behavior. But it has also enabled normal citizens to share files. Music, movie and game producers have difficulty opera"}, {"rank": 2, "docid": "test-science-ascidfakhba-pro04b", "score": 0.5276229977607727, "is_gold": false, "snippet": "It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, no"}, {"rank": 3, "docid": "test-culture-ascidfakhba-pro04b", "score": 0.5276229977607727, "is_gold": false, "snippet": "It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, no"}, {"rank": 4, "docid": "training-international-gsciidfi-pro01b", "score": 0.5046435594558716, "is_gold": false, "snippet": "We should be wary of any figures set on losses to the economy as a result of piracy, mostly because the coinsumer who is downloading pirated materials will simply use his dollars elsewhere. [i] There have also been studies that show that these same people who "}, {"rank": 5, "docid": "training-digital-freedoms-iphwclcp-con01b", "score": 0.4738759696483612, "is_gold": false, "snippet": "Copyright would still exist, and the artist is able to profit from it, even if the length of copyright is reduced. People deserve recompense, but the stifling force of current laws make for negative outcomes. It would be better to strike a more appropriate bal"}, {"rank": 6, "docid": "validation-science-cihbdmwpm-con03b", "score": 0.4665636718273163, "is_gold": false, "snippet": "It is a mistake to think that when you’re downloading, there isn’t someone else making a huge profit. Torrent sites and other “pirate” sites gain huge amounts of income from the advertisements on their site. This means that they profit from material which is n"}, {"rank": 7, "docid": "test-digital-freedoms-eifpgdff-pro03b", "score": 0.46481332182884216, "is_gold": false, "snippet": "With the government as final decision-maker, at least the citizens and consumers have some say  Regulatory capture does sometimes happen and when it does, it’s bad. But the risk of regulatory capture isn’t a sufficient argument to keep the government away from"}, {"rank": 8, "docid": "validation-science-cihbdmwpm-pro03b", "score": 0.45604372024536133, "is_gold": false, "snippet": "It’s true that musicians have to eat, too, but it’s not true that downloading cuts their income. Most of the money spent on music goes to record companies, not to artists, from each retail CD sold the artist only gets between 3 and 10%. [1] Those record compan"}, {"rank": 9, "docid": "training-economy-beegshbtsb-con01a", "score": 0.4532836079597473, "is_gold": false, "snippet": "Policing such a policy creates its own set of problems for the society and costs for the economy  Complying with any regulation has a cost attached, and so does policing that regulation in order to make it effective. How would anyone know who was working where"}, {"rank": 10, "docid": "test-digital-freedoms-eifdfaihs-pro03b", "score": 0.4495532810688019, "is_gold": false, "snippet": "The idea that there is a virtue in providing things for free takes a somewhat cavalier attitude toward jobs. It is a predicate of this, and many other, arguments that the Internet should be either free or very cheap, but this does little for protecting genuine"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con03a", "score": 1.0, "is_gold": false, "snippet": "Internet regulation is necessary to ensure a working economy on the internet  As seen above, the internet has enabled many types of criminal behavior. But it has also enabled normal citizens to share files. Music, movie and game producers have difficulty opera"}, {"rank": 2, "docid": "test-digital-freedoms-eifpgdff-con03b", "score": 0.8013979196548462, "is_gold": true, "snippet": "Government shouldn’t interfere with the internet economy  It almost never ends well when governments interfere with the internet economy. The graduated response policy against the unauthorized downloading of copyrighted content is one example: it violates the "}, {"rank": 3, "docid": "test-digital-freedoms-eifpgdff-con01a", "score": 0.7566778659820557, "is_gold": false, "snippet": "Internet regulation is necessary to ensure a safe internet  Citizens, corporations, and public organizations face several security threats when online: critical infrastructure systems can be hacked, like the energy transport system, [1] citizens can fall victi"}, {"rank": 4, "docid": "validation-science-ihbrapisbpl-con01a", "score": 0.7524117231369019, "is_gold": false, "snippet": "Internet anonymity allows internet users to engage in illegal activities  The internet is being used for illegal activities. Examples of these are trading and trafficking in child pornography, drug trading and planning and coordinating terrorist activities. [1"}, {"rank": 5, "docid": "test-digital-freedoms-eifpgdff-pro03a", "score": 0.7506979703903198, "is_gold": false, "snippet": "Internet regulation is an attempt by big interest groups to regulate the internet in their favour  Large companies have an active interest in shaping the structure of the internet. One example of this is the Stop Online Piracy-Act (SOPA), [1] wherein U.S.-base"}, {"rank": 6, "docid": "test-science-ascidfakhba-pro04b", "score": 0.7500613331794739, "is_gold": false, "snippet": "It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, no"}, {"rank": 7, "docid": "test-culture-ascidfakhba-pro04b", "score": 0.7500613331794739, "is_gold": false, "snippet": "It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, no"}, {"rank": 8, "docid": "test-digital-freedoms-piidfiphwu-pro01a", "score": 0.7482365965843201, "is_gold": false, "snippet": "The unauthorised downloading of copyrighted material should be addressed and prevented by the state  Copyrighted material is intellectual property: someone worked hard for it to produce it. Downloading this content without paying the proper rights holder for i"}, {"rank": 9, "docid": "test-digital-freedoms-eifpgdff-con02a", "score": 0.7409897446632385, "is_gold": false, "snippet": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coor"}, {"rank": 10, "docid": "test-science-ciidfaihwc-pro04a", "score": 0.7400640249252319, "is_gold": false, "snippet": "As an extensive form of media, the Internet should be subject to regulation just as other forms of media are.  Under the status quo, states already regulate other forms of media that could be used malevolently. Newspapers and books are subject to censorship [1"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-digital-freedoms-piidfiphwu-pro03a", "query": "A graduated response is the fairest way to enforce copyright legislation  First, the sanction after three warnings can be tailored to fit general notions of justice, the punishment need not be severe and could fit the crime: maybe a consumer would be cut off of the internet for only two weeks, or only cut off from accessing download sites but still be allowed to access government and banking sites, or receive a small fine.  Secondly, the consumer has ample time to change his or her behaviour: a consumer can insist on infringing copyright at least two times before the sanction takes place. The consumer can easily avoid being cut off (even temporarily), meaning the punishment likely doesn’t even have to take place. [1]  [1] Barry Sookman, ‘Graduated response and copyright: an idea that is right for the times’, January 10th, 2010. URL:", "gold_docid": "test-digital-freedoms-piidfiphwu-pro03b", "rank_T": 47, "rank_baseline": 5, "overlap@K": 0.1, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-piidfiphwu-pro03a", "score": 0.6061678528785706, "is_gold": false, "snippet": "A graduated response is the fairest way to enforce copyright legislation  First, the sanction after three warnings can be tailored to fit general notions of justice, the punishment need not be severe and could fit the crime: maybe a consumer would be cut off o"}, {"rank": 2, "docid": "training-free-speech-debate-radhbrr-con02b", "score": 0.4789239764213562, "is_gold": false, "snippet": "Opposition seem to be arguing, ‘This is difficult, let’s do nothing’ – the rallying call of apathy down the ages. There may well be grounds for a wider right of reply – indeed as most news outlets increasingly favour their online presence many of their practic"}, {"rank": 3, "docid": "test-digital-freedoms-eifdfaihs-con02b", "score": 0.45511841773986816, "is_gold": false, "snippet": "Censorship has routinely been presented in terms of ‘protecting public morals’ or ‘defending national security’ or some similar euphemism, with legislation aimed at pornography but catching everything else in its track as simply the most obvious example [i] . "}, {"rank": 4, "docid": "test-law-lghwpcctcc-pro03b", "score": 0.4512549340724945, "is_gold": false, "snippet": "Putting this kind of pressure on the judiciary and lawyers does not have the same kinds of benefits that it might in the House of Commons. Politicians often focus on, and are expected to uphold, the general interest of the public, which is why having public ac"}, {"rank": 5, "docid": "test-law-phwmfri-pro02b", "score": 0.4321666657924652, "is_gold": false, "snippet": "This motion will have no impact on that problem. Fines must be set at a low percentage of income so that the people earning the least do not find themselves going without essentials (a fine for speeding that caused you not to be able to heat your house in wint"}, {"rank": 6, "docid": "test-law-phwmfri-con01b", "score": 0.43008533120155334, "is_gold": false, "snippet": "Whilst it is true that a crime ought to be proportionate to the severity of the crime committed, there is no reason why that must be the only factor. This motion does not remove the proportionality about which you are concerned, but merely adds an additional f"}, {"rank": 7, "docid": "test-philosophy-pphbclsbs-pro02b", "score": 0.4234217703342438, "is_gold": false, "snippet": "If there is even a slight injustice, then there is a problem worth addressing. It is a fact that recent anti-terrorism legislation, in nearly all western countries, has been used for a variety of uses from international banking [1] to petty thievery. This is o"}, {"rank": 8, "docid": "training-economy-beghwprsci-pro02b", "score": 0.4216737747192383, "is_gold": false, "snippet": "If retailers need to unload an item, it is totally within their rights to do that, as long as they don't use that item to trick consumers into buying more expensive items. Selling off goods at a low price, when not planned, would also not harm producers becaus"}, {"rank": 9, "docid": "test-science-ascidfakhba-pro03b", "score": 0.4206744432449341, "is_gold": false, "snippet": "Choosing to release one’s work into the viral market may be a shrewd business and artistic move, or it might not. All of this depends on the individual artist and the individual work. Nine Inch Nails both has the money that they can afford to take the risk and"}, {"rank": 10, "docid": "test-culture-ascidfakhba-pro03b", "score": 0.4206744432449341, "is_gold": false, "snippet": "Choosing to release one’s work into the viral market may be a shrewd business and artistic move, or it might not. All of this depends on the individual artist and the individual work. Nine Inch Nails both has the money that they can afford to take the risk and"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-piidfiphwu-pro03a", "score": 1.0, "is_gold": false, "snippet": "A graduated response is the fairest way to enforce copyright legislation  First, the sanction after three warnings can be tailored to fit general notions of justice, the punishment need not be severe and could fit the crime: maybe a consumer would be cut off o"}, {"rank": 2, "docid": "test-digital-freedoms-piidfiphwu-pro02a", "score": 0.83329838514328, "is_gold": false, "snippet": "A graduated response will be an effective deterrent  Research has shown that consumers are likely to stop downloading from unauthorized sources when warned by their ISP. For example: Seven out of ten (72%) UK music consumers would stop illegally downloading if"}, {"rank": 3, "docid": "test-digital-freedoms-piidfiphwu-con03a", "score": 0.8080025911331177, "is_gold": false, "snippet": "The graduated response is a violation of the basic right to due process  Detection of copyright infringement isn’t usually done by a detective sitting behind a computer. It relies on software like automated crawlers and fingerprinting, often created by commerc"}, {"rank": 4, "docid": "test-digital-freedoms-piidfiphwu-con03b", "score": 0.7919398546218872, "is_gold": false, "snippet": "Graduated response can be done prudently  Many companies have ‘Terms of Agreement’, violation of which automatically leads to cancellation of service. Suppose you don’t pay your library subscription for a year: no one would complain of ‘lack of due process’ if"}, {"rank": 5, "docid": "test-digital-freedoms-piidfiphwu-pro03b", "score": 0.790514349937439, "is_gold": true, "snippet": "Graduated response is a draconian punishment  Citizens these days rely on their internet connection for their everyday lives: banking transactions, filing tax forms, and other forms of essential communication are all done online. Cutting access to these basic "}, {"rank": 6, "docid": "test-digital-freedoms-piidfiphwu-pro02b", "score": 0.744347870349884, "is_gold": false, "snippet": "Consumers will find ways to evade detection  Evading detection for most of the surveillance methods are relatively easy: consumers could start relying on proxy servers to hide their IP-addresses or start encrypting everything they share online to avoid being d"}, {"rank": 7, "docid": "training-digital-freedoms-iphwclcp-con01b", "score": 0.7416645884513855, "is_gold": false, "snippet": "Copyright would still exist, and the artist is able to profit from it, even if the length of copyright is reduced. People deserve recompense, but the stifling force of current laws make for negative outcomes. It would be better to strike a more appropriate bal"}, {"rank": 8, "docid": "training-digital-freedoms-iphwclcp-pro01a", "score": 0.7328194379806519, "is_gold": false, "snippet": "Overlong copyright protection stifles the creativity and saps the time of artists  In some instances, when artists achieve success they face the enervating impulse that their achievement brings. They become satisfied and complacent with what they have, robbing"}, {"rank": 9, "docid": "test-digital-freedoms-piidfiphwu-con02a", "score": 0.7325757741928101, "is_gold": false, "snippet": "ISP will not cooperate with a graduated response policy  The graduated response model requires cooperation from all Internet Service Providers. If just one ISP refuses, users will flock towards that ISP to be able to keep on downloading. Therefore there will a"}, {"rank": 10, "docid": "test-science-ascidfakhba-pro04b", "score": 0.7309427857398987, "is_gold": false, "snippet": "It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, no"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-hrilpgwhwr-con03a", "query": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investigation to the Prosecutor and the Prosecutor also has the power to commence an investigation ex proprio motu. There is no UN Security Council veto over the discretion of the Prosecutor. Moreover, the phantom of political prosecution has already materialised in the preliminary investigation mounted by the Office of the Prosecutor of the ICTY into the NATO bombing of Kosovo and the Federal Republic of Yugoslavia in the course of 'Operation Allied Force'. The Prosecutor chose to investigate a campaign that had been undertaken with clinical precision, that had received the ex post facto support of the Security Council, and that had been directed against a military infrastructure effecting a brutal policy of ethnic cleansing. This grim precedent suggests that a Prosecutor will not hesitate to investigate any other good faith and successful military actions across the globe.", "gold_docid": "test-law-hrilpgwhwr-con03b", "rank_T": 48, "rank_baseline": 6, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-law-hrilpgwhwr-con03a", "score": 0.6949073076248169, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 2, "docid": "validation-law-hrilhbiccfg-con04a", "score": 0.5921977162361145, "is_gold": false, "snippet": "The ICC is not democratic in nature and is likely to be used as a political tool by powerful nations.  Parts of the Rome Statue, such as the clauses relating to the Security Council, make it seem like a tool that will be used by the politically powerful. The S"}, {"rank": 3, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.5731992721557617, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}, {"rank": 4, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.5508411526679993, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 5, "docid": "test-law-hrilpgwhwr-pro01b", "score": 0.5196619033813477, "is_gold": false, "snippet": "The ICC's ability to prosecute war criminals is both overstated and simplistic. It has no force of its own, and must rely on its member states to hand over criminals wanted for prosecution. This leads to cases like that of Serbia, where wanted war criminals li"}, {"rank": 6, "docid": "test-philosophy-pphbclsbs-pro05b", "score": 0.5167057514190674, "is_gold": false, "snippet": "The issue would indeed by easy to solve if what the proposition spoke of was the whole story. Unfortunately, the legal measures put in place will always be open to abuse and so, as all power corrupts – and as absolute power corrupts absolutely – the more and m"}, {"rank": 7, "docid": "validation-law-hrilhbiccfg-con04b", "score": 0.5153855681419373, "is_gold": false, "snippet": "The ICC is an independent court with enough checks that only pursues the most heinous criminals.  The ICC was designed to pursue the \"future Pol Pots, Saddam Husseins, and Milosevics who terrorize civilians on a massive scale.\" The fear of politically motivate"}, {"rank": 8, "docid": "training-international-alilhbassw-con03b", "score": 0.5045101046562195, "is_gold": false, "snippet": "Independent nations are capable of trying war crimes themselves.  The ICC is an unnecessary intrusion on national sovereignty. It should be up to each state to determine its own legal system as to how criminal matters should be prosecuted.  The principle of co"}, {"rank": 9, "docid": "validation-law-hrilppwhb-pro01b", "score": 0.5043233036994934, "is_gold": false, "snippet": "In any conflict, the apportionment of blame for individual crimes committed against civilians to a standard of proof that would be acceptable in a court is extremely difficult, even such a high profile crime as attacks using chemical weapons have been disputed"}, {"rank": 10, "docid": "test-law-cpilhbishioe-con03b", "score": 0.5033295750617981, "is_gold": false, "snippet": "Those arguments are similar ones to those used against the ICC. An ICC police force, comprised of officers from individual state and supervised by an independent authority appointed by a similar mechanism to the judges, would use the existing frameworks in pla"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrilpgwhwr-con03a", "score": 1.0, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 2, "docid": "test-law-hrilpgwhwr-pro01a", "score": 0.8690752983093262, "is_gold": false, "snippet": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it"}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.8365303874015808, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 4, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.8335162997245789, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}, {"rank": 5, "docid": "validation-law-hrilhbiccfg-con04a", "score": 0.8333190679550171, "is_gold": false, "snippet": "The ICC is not democratic in nature and is likely to be used as a political tool by powerful nations.  Parts of the Rome Statue, such as the clauses relating to the Security Council, make it seem like a tool that will be used by the politically powerful. The S"}, {"rank": 6, "docid": "test-law-hrilpgwhwr-con03b", "score": 0.8227378726005554, "is_gold": true, "snippet": "The ICC does not have too much authority, merely the necessary authority to be useful as an institution. It is the very pre-eminence of the US that demands it adhere to the international rule of law, the ICC's existence will not alter that nor lead to charges "}, {"rank": 7, "docid": "test-law-hrilpgwhwr-pro01b", "score": 0.8066481351852417, "is_gold": false, "snippet": "The ICC's ability to prosecute war criminals is both overstated and simplistic. It has no force of its own, and must rely on its member states to hand over criminals wanted for prosecution. This leads to cases like that of Serbia, where wanted war criminals li"}, {"rank": 8, "docid": "validation-law-hrilhbiccfg-con04b", "score": 0.8049873113632202, "is_gold": false, "snippet": "The ICC is an independent court with enough checks that only pursues the most heinous criminals.  The ICC was designed to pursue the \"future Pol Pots, Saddam Husseins, and Milosevics who terrorize civilians on a massive scale.\" The fear of politically motivate"}, {"rank": 9, "docid": "test-law-hrilpgwhwr-pro03b", "score": 0.8033555150032043, "is_gold": false, "snippet": "The US holds a unique position in the fabric of the protection of international peace and security. Whilst it might be appropriate for other States to consent to the jurisdiction of the ICC, these States do not bear the responsibilities and attendant risks beh"}, {"rank": 10, "docid": "training-international-alilhbibaa-pro03a", "score": 0.8016511797904968, "is_gold": false, "snippet": "ICC is controlled by the Security Council  The ICC can only investigate situations that are referred to it by either the host country, or the Security Council [1] . A power also exists for the prosecutor to seek investigation, though this has as yet only been "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-ehbfe-pro03a", "query": "A federal Europe will be a stronger international actor  A federal Europe will be better equipped to promote the interests of its citizens in the world, carrying more influence in the UN, WTO, IMF and other intergovernmental and treaty organisations than its individual states do now. Furthermore, Europe has a lot to contribute to the world in terms of its liberal traditions and political culture, providing both a partner and a necessary balance to the USA in global affairs.  Once unified, Europe will become an (even more) important negotiating and trading partner – one of the biggest economies in the world. It will have a population of 450 million – more than the United States and Russia combined. It will be the world’s biggest trader and generate one quarter of global wealth. It presently gives more aid to poor countries than any other donor. Its currency, the euro, comes second only to the US dollar in international financial markets. France, Germany, Poland - these countries can hardly ever negotiate something with giants such as the US or China. Europe as one country stands a better chance of putting its message across effectively.", "gold_docid": "test-international-ehbfe-pro03b", "rank_T": 48, "rank_baseline": 7, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-international-ehbfe-pro03a", "score": 0.5936967730522156, "is_gold": false, "snippet": "A federal Europe will be a stronger international actor  A federal Europe will be better equipped to promote the interests of its citizens in the world, carrying more influence in the UN, WTO, IMF and other intergovernmental and treaty organisations than its i"}, {"rank": 2, "docid": "test-politics-oepdlhfcefp-con02b", "score": 0.54742431640625, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 3, "docid": "test-international-epdlhfcefp-con02b", "score": 0.54742431640625, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 4, "docid": "test-politics-cpegiepgh-con02b", "score": 0.5326902866363525, "is_gold": false, "snippet": "These restraints exist to ensure that all countries contribute to the European Community. Surprisingly, Britain's sovereignty will actually increase by joining the Euro. As explained by Anthony Browne in The Euro: Should Britain join?, \"When it comes to intere"}, {"rank": 5, "docid": "training-international-eghwgepsusc-con05b", "score": 0.5203874707221985, "is_gold": false, "snippet": "The European States are obviously going to benefit from having large numbers of their members on the UN Security Council, and the United Nations itself is not harmed by it this overrepresentation comes at the expense of other regions. No other regions are so c"}, {"rank": 6, "docid": "training-economy-fiaghwewsco-con03b", "score": 0.5147934556007385, "is_gold": false, "snippet": "Member countries can not unilaterally increase their quotas8. So even if a country, like the BRICs became rich enough to afford buying a bigger share, it would be in the interest of Western nations to block such a move to retain the power under the status quo."}, {"rank": 7, "docid": "test-international-ghbunhf-con05b", "score": 0.5135697722434998, "is_gold": false, "snippet": "It is arguable that the era of globalisation makes the United Nations less important, not more. Trade disputes are settled bilaterally or through the WTO; economic crises through the offices of the World Bank and IMF; security problems, as often as not, throug"}, {"rank": 8, "docid": "training-international-eghwgepsusc-con03b", "score": 0.5124956369400024, "is_gold": false, "snippet": "Until now, the member states of the European Union have never been able to coordinate their foreign policies effectively. This has led to divided positions amongst member states, for example towards Russia, China and other global players, allowing them to play"}, {"rank": 9, "docid": "test-international-ehbfe-pro04b", "score": 0.5108420252799988, "is_gold": false, "snippet": "Europe is not like America and Australia, which were founded by immigrants with considerable homogeneity of language and culture. Canada’s relations with Quebec show that where such differences exist they can be politically destabilising, while federal states "}, {"rank": 10, "docid": "training-international-eghwgepsusc-pro03b", "score": 0.510070264339447, "is_gold": false, "snippet": "The European Union might be an economic powerhouse and might want to coordinate foreign relations in regards to external economic policy, but at heart it is intended to be an economic union, not a political union. Most of its founding treaties and the daily wo"}], "topK_baseline": [{"rank": 1, "docid": "test-international-ehbfe-pro03a", "score": 1.0, "is_gold": false, "snippet": "A federal Europe will be a stronger international actor  A federal Europe will be better equipped to promote the interests of its citizens in the world, carrying more influence in the UN, WTO, IMF and other intergovernmental and treaty organisations than its i"}, {"rank": 2, "docid": "test-international-ehbfe-con02b", "score": 0.7932347059249878, "is_gold": false, "snippet": "On the contrary a federal Europe will bring the countries a lot closer together. Matters of harmful policies will be a lot less than they are right now in the EU simply because separate states do exist now. However when there is just one state with all the nat"}, {"rank": 3, "docid": "test-international-ehbfe-pro05a", "score": 0.7754374742507935, "is_gold": false, "snippet": "A federal Europe will ensure that large, multinational businesses remain accountable for their actions  In a globalised economy, there is a need to tame multinational corporations, which would be otherwise capable of playing national governments off against ea"}, {"rank": 4, "docid": "test-politics-cpegiepgh-con02b", "score": 0.7719827890396118, "is_gold": false, "snippet": "These restraints exist to ensure that all countries contribute to the European Community. Surprisingly, Britain's sovereignty will actually increase by joining the Euro. As explained by Anthony Browne in The Euro: Should Britain join?, \"When it comes to intere"}, {"rank": 5, "docid": "test-international-ehbfe-pro02a", "score": 0.7701928019523621, "is_gold": false, "snippet": "A federal Europe will protect the cultural diversity of its member states  A federal Europe will be more advantageous for individual citizens, since they will be living in a powerful state, yet with respect of their cultural and local situation  Subsidiarity c"}, {"rank": 6, "docid": "test-international-ehbfe-pro04b", "score": 0.768460750579834, "is_gold": false, "snippet": "Europe is not like America and Australia, which were founded by immigrants with considerable homogeneity of language and culture. Canada’s relations with Quebec show that where such differences exist they can be politically destabilising, while federal states "}, {"rank": 7, "docid": "test-international-ehbfe-pro03b", "score": 0.7652050852775574, "is_gold": true, "snippet": "Actually if the EU became a unified state, there would be s loss of UN Seats - a major democratic, liberal voting block in international institutions such as the UN would be lost, in return for one vote (for an incredibly powerful state). Due to the UK and Fra"}, {"rank": 8, "docid": "test-international-ehbfe-con02a", "score": 0.7649561762809753, "is_gold": false, "snippet": "Existing contributive inequalities within the Union would be amplified by a formal federal system  There is a possibility that once a federation, Europe will adopt certain policies that might be harmful for a minority of the member states. In consequence, any "}, {"rank": 9, "docid": "training-international-eghwgepsusc-con05a", "score": 0.7630833387374878, "is_gold": false, "snippet": "More is more.  While the in number of EU members in the Security Council is obviously beneficial to the EU and its members the influence of the European Union is also beneficial to the UN system as a whole. European powers that are enthusiastic internationalis"}, {"rank": 10, "docid": "validation-politics-ghbfsabun-pro01a", "score": 0.7563992738723755, "is_gold": false, "snippet": "Federal states are economically stronger  Federal states are able to remove trade barriers between members which would otherwise exist if there were independent states (such as difficulties in moving goods due to borders). This increases internal trade and eco"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-gvhwhnerse-pro02a", "query": "Avoids the costs and uncertainty of elections  It is hard to see what the benefit of an election that can change nothing is, but there are certainly all the costs associated with a normal election. Elections can be costly in financial terms, the United States elections cost several billion dollars but even much smaller and less extravagant elections need financing. Zimbabwe’s elections in 2013 forced the government to ask its neighbours for $85 million to carry out the polls, for a nation that is essentially bankrupt this is a lot of money. [1]  Another cost is uncertainty. In fully democratic elections the uncertainty is with what the policies will be when the government changes. With sham elections the uncertainty is whether the elections will be a focus for violence. Sometimes this is during campaigning itself as with Zimbabwe in 2008 where up to 200 people were killed. [2] Otherwise violence occurs when there is a perception that an election has been stolen so the Green Movement in Iran took to the streets and was met with a violent crackdown in 2009. [3]  [1] VOA News, ‘Zimbabwe Seeks Help to Cover Election Costs’, Voice of America, 10 July 2013,   [2] ‘Zimbabwe: No Justice for Rampant Killings, Torture’, Human Rights Watch, 8 March 2011,   [3] AFP, ‘Iran opposition says 72 killed in vote protests’, Google, 3 September 2009,", "gold_docid": "test-politics-gvhwhnerse-pro02b", "rank_T": 44, "rank_baseline": 6, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-politics-gvhwhnerse-pro02a", "score": 0.627567708492279, "is_gold": false, "snippet": "Avoids the costs and uncertainty of elections  It is hard to see what the benefit of an election that can change nothing is, but there are certainly all the costs associated with a normal election. Elections can be costly in financial terms, the United States "}, {"rank": 2, "docid": "training-politics-lvhwhauppsd-pro03b", "score": 0.5311768054962158, "is_gold": false, "snippet": "A lengthy primary campaign gives candidates time to test each other on a whole range of issues. Voters, in turn, make their decisions based on a balance of candidates’ strengths and weaknesses. Voters can do this because they have had the time to get to know t"}, {"rank": 3, "docid": "training-law-ilppghsuta-con03b", "score": 0.511017918586731, "is_gold": false, "snippet": "Financial compensation was only part of the South African Commission's work. Although it has been slow to arrive it is continuing to be distributed. More will be done over time, and the impact of reconciliation on polls is also a long-term process.  The econom"}, {"rank": 4, "docid": "test-politics-ypppgvhwmv-con02b", "score": 0.4928790330886841, "is_gold": false, "snippet": "Because mandatory voting means that no large campaign funds are needed to goad voters to the polls, the role of money in politics will decrease. Compulsory voting will reduce spending such as campaign spending on voter turnout. It can also lead to a reduction "}, {"rank": 5, "docid": "training-economy-epiaghwpto-pro01b", "score": 0.480735182762146, "is_gold": false, "snippet": "The biggest problem African countries face is instability whether from rebellions, coups, international conflicts, or terrorist organisation. The inevitable result is violence. What the population needs is safety to enable social benefits like healthcare and e"}, {"rank": 6, "docid": "training-politics-ogmepthbeuao-pro03a", "score": 0.46775609254837036, "is_gold": false, "snippet": "The outcome of the Palestinian elections should not be rewarded with aid.  A terrorist organisation such as Hamas may be democratically elected, but that does not mean we have to fund its government. Respecting the decision of the Palestinian people is not the"}, {"rank": 7, "docid": "validation-digital-freedoms-gthwaueai-pro04b", "score": 0.46520760655403137, "is_gold": false, "snippet": "The elderly far more frequently find electronic voting to be a hindrance rather than a help. Those who are partially sighted are unable to see the position on the text blocks on the screen; small controls such as buttons or touch screens create problems; and s"}, {"rank": 8, "docid": "test-economy-bepighbdb-pro02b", "score": 0.4630544185638428, "is_gold": false, "snippet": "In addition to the moral concerns, it is not proven that dictatorships are sustainable in the long term. There will always be groups seeking a democratic government, which could lead to revolution.  There is a particular issue with handovers of power in dictat"}, {"rank": 9, "docid": "training-health-adhgphwfrs-con02b", "score": 0.45443424582481384, "is_gold": false, "snippet": "Rather than the state pouring money into campaigns, they should spend it on other more important things, such as improving the health system, infrastructure or other, more important things.  The UK Department of Health doubled its media spending from less than"}, {"rank": 10, "docid": "test-politics-gvhwhnerse-pro03b", "score": 0.45404306054115295, "is_gold": false, "snippet": "There is little evidence that countries without elections are more willing to take difficult decisions, or able to take wise decisions, than those that face some form of election. Many petro states have failed to diversify their economies despite having the mo"}], "topK_baseline": [{"rank": 1, "docid": "test-politics-gvhwhnerse-pro02a", "score": 1.0, "is_gold": false, "snippet": "Avoids the costs and uncertainty of elections  It is hard to see what the benefit of an election that can change nothing is, but there are certainly all the costs associated with a normal election. Elections can be costly in financial terms, the United States "}, {"rank": 2, "docid": "test-economy-bepighbdb-pro02a", "score": 0.7767279744148254, "is_gold": false, "snippet": "Dictatorships assure low cost political stability  Due to the lack of rotation in office, a dictatorship allows for a more stable government with more ability to plan for the long term, which is crucial for attracting foreign investment.  Given that a democrac"}, {"rank": 3, "docid": "test-politics-gvhwhnerse-pro03b", "score": 0.7733649611473083, "is_gold": false, "snippet": "There is little evidence that countries without elections are more willing to take difficult decisions, or able to take wise decisions, than those that face some form of election. Many petro states have failed to diversify their economies despite having the mo"}, {"rank": 4, "docid": "test-politics-ypppgvhwmv-con02a", "score": 0.7478083372116089, "is_gold": false, "snippet": "Policing and financing the system is unmanageable  If a large proportion of the population decided not to vote it would be impossible to make every non-voter pay the fine. For example, if just 10% of the UK voters failed to do so the government would have to c"}, {"rank": 5, "docid": "test-politics-gvhwhnerse-pro01a", "score": 0.7340253591537476, "is_gold": false, "snippet": "Having no elections is honest  Holding sham elections is fundamentally dishonest as it is asking the people to choose a government and then ignoring their choice. Not holding elections is at least honestly telling the people that they get no say in who is in p"}, {"rank": 6, "docid": "test-politics-gvhwhnerse-pro02b", "score": 0.7293656468391418, "is_gold": true, "snippet": "While elections can create a focal point for protest and violence this may actually make things more predictable not less. Countries without elections are not without opposition groups and protests, all this means is that the spark for the protests is going to"}, {"rank": 7, "docid": "validation-digital-freedoms-gthwaueai-pro04a", "score": 0.7261224985122681, "is_gold": false, "snippet": "Electronic voting will create a more cost effective franchise  Electronic voting would also save a great deal of money which is currently spent on employing counters and renting venues to be used as polling stations. For example the UK general election in 2005"}, {"rank": 8, "docid": "training-international-aghbuidrch-pro01b", "score": 0.7238838076591492, "is_gold": false, "snippet": "Elections do not show the UN is moving Congo towards becoming a functioning democracy. In 2011 President Kabila has changed the election system to strengthen his own chances of re-election. The elections were hardly free and fair; the AU election monitors have"}, {"rank": 9, "docid": "training-law-ilppghsuta-con03b", "score": 0.7237621545791626, "is_gold": false, "snippet": "Financial compensation was only part of the South African Commission's work. Although it has been slow to arrive it is continuing to be distributed. More will be done over time, and the impact of reconciliation on polls is also a long-term process.  The econom"}, {"rank": 10, "docid": "training-politics-dtwhbnhsa-pro03b", "score": 0.7232468724250793, "is_gold": false, "snippet": "Some elections may be better than no elections but where the west has control there really should have been exemplary elections. The 2009 Presidential elections in particular have been accused of having been riddled with fraud. The election observers from the "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-gsciidffe-pro04a", "query": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this right then it is legitimate for other countries to step in to act as an enabler of those rights. By circumventing censorship so the freedom of expression is returned to those that have had their voice stripped from them. Doing this costs the state that is acting almost nothing; thus Britain’s Foreign Office is devoting a mere £1.5million to promoting expression online, [1] and yet the benefits for those who it helps can be considerable by helping them to publicise and organise themselves by providing a platform. The small cost should be compared to the benefit of keeping activists one step ahead of the authorities by, for example providing software that helps make sure online communication is anonymous, which can save lives.  [1] “William Hague promises £1.5m to promote freedom of expression online”, BBC News, 30 April 2012,", "gold_docid": "test-international-gsciidffe-pro04b", "rank_T": 35, "rank_baseline": 3, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-international-gsciidffe-pro04a", "score": 0.5330740213394165, "is_gold": false, "snippet": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this"}, {"rank": 2, "docid": "test-international-gsciidffe-con03b", "score": 0.5070469379425049, "is_gold": false, "snippet": "If a regime is so intolerant as to threaten its citizens for using lines of communication that have been opened by another country then that country is clearly in need of greater openness towards freedom of expression and information. This is something that un"}, {"rank": 3, "docid": "test-international-gsciidffe-con02b", "score": 0.5062287449836731, "is_gold": false, "snippet": "Governments do not have a monopoly on the knowledge of what is best for their people and even the people may themselves make a mistake when deciding on whether to be an open society. Thus even if it appears that many people support censorship it may be legitim"}, {"rank": 4, "docid": "training-digital-freedoms-fehwufafra-con03a", "score": 0.5010796785354614, "is_gold": false, "snippet": "Evading censorship is already possible and censorship does not prevent the use of the internet.  Proposition itself concedes that authoritarian states in the vast majority of cases are unlikely to cut off access to the internet for their population entirely. F"}, {"rank": 5, "docid": "training-digital-freedoms-fehbwdsot-con01b", "score": 0.4802224040031433, "is_gold": false, "snippet": "Appeasement does not work to increase internet freedom. This has been shown time and time again with China. China has slowly been becoming more and more accepted into the international system; it gained Security Council membership in 1971, joined the WTO in 20"}, {"rank": 6, "docid": "test-science-ciidfaihwc-con03a", "score": 0.475511372089386, "is_gold": false, "snippet": "People often react poorly to being censored by their governments.  In countries that do currently practice censorship of Internet information, their citizens often interpret this as suspicious and dictatorial behaviour. For example, in China growing discontent"}, {"rank": 7, "docid": "training-free-speech-debate-ifcidffe-con03b", "score": 0.4669020175933838, "is_gold": false, "snippet": "Banning the sale of surveillance technology does not mean democracies are declaring all undemocratic regimes illegitimate. Rather, they are simply not allowing their technology to aid in the repression of people, which is the only use to which that technology "}, {"rank": 8, "docid": "training-digital-freedoms-fehwufafra-pro02b", "score": 0.46364015340805054, "is_gold": false, "snippet": "Providing such mechanisms does not help activists and can even harm them. These activists will have few guarantees that the technology will work. Previous technologies meant to give anonymity have often not worked or else the governments will come up with ways"}, {"rank": 9, "docid": "test-science-ciidfaihwc-con01a", "score": 0.45231083035469055, "is_gold": false, "snippet": "Censorship is fundamentally incompatible with the notion of free speech.  Censoring particular material essentially blinds the public to a complete world view by asserting the patronising view that ordinary citizens simply cannot read extreme material without "}, {"rank": 10, "docid": "test-free-speech-debate-nshbcsbawc-pro04a", "score": 0.4478551149368286, "is_gold": false, "snippet": "Freedom of expression, like any right is fairly meaningless if it’s only respected when it’s convenient.  Recognising rights when there is no inconvenience to anybody involved is verging on the irrelevant. This is, perhaps, especially true, with freedom of exp"}], "topK_baseline": [{"rank": 1, "docid": "test-international-gsciidffe-pro04a", "score": 1.0, "is_gold": false, "snippet": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this"}, {"rank": 2, "docid": "test-international-gsciidffe-con03b", "score": 0.7995927929878235, "is_gold": false, "snippet": "If a regime is so intolerant as to threaten its citizens for using lines of communication that have been opened by another country then that country is clearly in need of greater openness towards freedom of expression and information. This is something that un"}, {"rank": 3, "docid": "test-international-gsciidffe-pro04b", "score": 0.7939110398292542, "is_gold": true, "snippet": "As foreign states are not the legitimate representative of the people it is not legitimate for them to set themselves up as the arbiter for those whom it believes are being deprived of rights. These states that are meddling in the affairs of others cannot know"}, {"rank": 4, "docid": "test-international-gsciidffe-con03a", "score": 0.7934615612030029, "is_gold": false, "snippet": "This policy is not necessary and may be counterproductive  Unless a state wishes to pull the plug on the internet entirely state censorship on the internet is never complete. Dissidents and those who are interested in getting around censorship will manage with"}, {"rank": 5, "docid": "training-digital-freedoms-fehwufafra-pro03b", "score": 0.7901504039764404, "is_gold": false, "snippet": "Funding such technologies is unlikely to result in large benefits or will result in escalating costs. China has billions invested in its online censorship activities. Any attempt to fund ways to counter this censorship would likely become involved in an online"}, {"rank": 6, "docid": "test-international-gsciidffe-con02a", "score": 0.7872042059898376, "is_gold": false, "snippet": "Governments enable censorship to protect their citizens  What censorship is it legitimate to undermine? Censorship is often created in order to protect the people not to strip them of freedoms. This is most obvious when we consider that filters to prevent hate"}, {"rank": 7, "docid": "training-digital-freedoms-fehwufafra-con03a", "score": 0.7869392037391663, "is_gold": false, "snippet": "Evading censorship is already possible and censorship does not prevent the use of the internet.  Proposition itself concedes that authoritarian states in the vast majority of cases are unlikely to cut off access to the internet for their population entirely. F"}, {"rank": 8, "docid": "training-digital-freedoms-fehbwdsot-pro03b", "score": 0.7844862341880798, "is_gold": false, "snippet": "As with all messages this will not make a “clear and emphatic statement about free speech” rather it will be a message that is muddied by hypocrisy. Autocratic ‘repressive’ regimes are not the only states to enable some form of censorship on the internet. Brit"}, {"rank": 9, "docid": "test-international-gsciidffe-pro03b", "score": 0.783941388130188, "is_gold": false, "snippet": "The public are rarely interested in foreign policy and want to keep well clear of foreign entanglements; they may like the idea of promoting democracy but if it means anything more than simple public support then they shy away as shown by only around 20-30% co"}, {"rank": 10, "docid": "training-digital-freedoms-aihbied-con01a", "score": 0.7820180654525757, "is_gold": false, "snippet": "The internet can be successfully censored so that it only promotes pro-regime propaganda.  The internet is said to promote democracy based on the claim that it leads to the free flow of information. Unfortunately, this is false in many parts of the world. 40 c"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-cppshbcjsfm-con03a", "query": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system is really working? Tagging prisoners? Free counselling for the prisoner for the rest of their life? These measures would require huge administration costs and then the question follows would it even be feasible to enforce such a system?  The root of criminality exists before exposure to the prison system; otherwise criminals would have no reason to be there in the first place. What may be more sensible is to analyse the root causes of what makes criminals offend in the first instance and introduce reform to counteract it, for example the economic crisis. [1]  Some have cited the education system as failing to instil a sense of morality in people. Others suggest that a lack of welfare leads individuals to lose faith in society and therefore be unwilling to follow the law. Assuming that the right time to change people’s outlook on society is after they have offended is naïve – criminal urges are better ‘nipped in the bud’.  It could be argued that criminal mentalities are inherent within certain individuals, either due to their inborn psyche or their upbringing. If one accepts this, then basic rehabilitation into society is going to do little to stop re-offending, whereas incarceration will keep them in a position where they cannot offend. Allowing them easy passage back into the world, with minimal supervision, could provide a gateway for them to commit more serious crimes.  [1] Dodd, Vikram, ‘Police face years of public disorder, former Met chief warns’, guardian.co.uk, 6 December 2011.", "gold_docid": "test-law-cppshbcjsfm-con03b", "rank_T": 34, "rank_baseline": 3, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-law-cppshbcjsfm-con03a", "score": 0.6698966026306152, "is_gold": false, "snippet": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system i"}, {"rank": 2, "docid": "training-law-apslpsyhwbbc-pro03b", "score": 0.6044671535491943, "is_gold": false, "snippet": "Rehabilitation programmes are not a panacea – nor are they instantly or reliably effective. The risk of an individual committing crime can only be reduced by long-term engagement with reform schemes. In 2009 violations of parole- the rules, conditions and sche"}, {"rank": 3, "docid": "training-law-apslpsyhwbbc-con03b", "score": 0.5944228768348694, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 4, "docid": "validation-health-aapdpglovr-pro02b", "score": 0.5839409232139587, "is_gold": false, "snippet": "Whether rehabilitation reduces crime more than prison has been the subject of considerable debate for more than a century. [1] Not all treatments work and the twelve step model used by most rehab clinics does not work and almost all the success in treatment fo"}, {"rank": 5, "docid": "training-law-apslpsyhwbbc-pro01b", "score": 0.580242931842804, "is_gold": false, "snippet": "What pretends to be an argument in support of the resolution is in fact an argument in favour of reforming the prison system. It is true that in an alarming number of prisons the rehabilitative objective of incarceration has been forgotten. In many other priso"}, {"rank": 6, "docid": "training-law-lgpcpao-con01b", "score": 0.5759371519088745, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 7, "docid": "training-law-lgpcpao-con02b", "score": 0.5586974620819092, "is_gold": false, "snippet": "There is political capital to be gained from adopting a hard line stance on law and order issues, but there is also political capital to be gained from showing that a particular policy has had a positive effect on reoffending. The Pew Foundation report cited a"}, {"rank": 8, "docid": "training-law-cpphwlpvo-pro03b", "score": 0.5493770837783813, "is_gold": false, "snippet": "As noted above, the consequences of non-violent crimes can be just as damaging as those of violent crimes. More over, non-violent criminals can also present an immediate danger to society.  The cost of constructing a prison is outweighed by the benefit of prev"}, {"rank": 9, "docid": "training-law-apslpsyhwbbc-con02b", "score": 0.5482919216156006, "is_gold": false, "snippet": "There is political capital to be gained from adopting a hard line stance on law and order issues, but there is also political capital to be gained from showing that a particular policy has had a positive effect on reoffending. The Pew Foundation report cited a"}, {"rank": 10, "docid": "training-society-gmhbztpgtf-pro02b", "score": 0.5459129810333252, "is_gold": false, "snippet": "Only idealists believe that prisons have rehabilitative role; we have to look at the reality. Juveniles sent to prison are less employable afterwards, and thus more likely to resort to crime. They meet established criminals in prison who both encourage the lif"}], "topK_baseline": [{"rank": 1, "docid": "test-law-cppshbcjsfm-con03a", "score": 0.9999997615814209, "is_gold": false, "snippet": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system i"}, {"rank": 2, "docid": "test-law-cppshbcjsfm-con02a", "score": 0.8368120789527893, "is_gold": false, "snippet": "Rehabilitation Doesn’t Actually Work  While some rehabilitative programmes work with some offenders (those who would probably change by themselves anyway), most do not. Many programs cannot overcome, or even appreciably reduce, the powerful tendency for offend"}, {"rank": 3, "docid": "test-law-cppshbcjsfm-con03b", "score": 0.7960717082023621, "is_gold": true, "snippet": "The expense of re-offenders re-entering the system is also an expense that our prison system cannot afford. A system such as counselling for released prisoners would prove to be inexpensive when weighed against the benefits of decreased crime, and all the cost"}, {"rank": 4, "docid": "training-law-apslpsyhwbbc-pro01b", "score": 0.7886629104614258, "is_gold": false, "snippet": "What pretends to be an argument in support of the resolution is in fact an argument in favour of reforming the prison system. It is true that in an alarming number of prisons the rehabilitative objective of incarceration has been forgotten. In many other priso"}, {"rank": 5, "docid": "training-law-lgpcpao-con01b", "score": 0.7880797386169434, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 6, "docid": "validation-health-aapdpglovr-pro02b", "score": 0.7873876094818115, "is_gold": false, "snippet": "Whether rehabilitation reduces crime more than prison has been the subject of considerable debate for more than a century. [1] Not all treatments work and the twelve step model used by most rehab clinics does not work and almost all the success in treatment fo"}, {"rank": 7, "docid": "training-law-apslpsyhwbbc-con03b", "score": 0.7865382432937622, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 8, "docid": "validation-law-cpphwmpfcp-pro01b", "score": 0.7776928544044495, "is_gold": false, "snippet": "This is all based on the vengeance-fuelled concept of “retributive justice”. This is not a model of thinking that has much merit. Imprisonment in the criminal justice works by deterring individuals from crime (prison always will be a deterrent), and incapacita"}, {"rank": 9, "docid": "test-law-cppshbcjsfm-con02b", "score": 0.7708631753921509, "is_gold": false, "snippet": "If we had the opportunity to stop some offenders re-offending why do we not seize this opportunity? Rehabilitative programs provide such an opportunity. Such programs include cognitive-behavioural programs (say, trying to get a violent offender to think and re"}, {"rank": 10, "docid": "test-law-cppshbcjsfm-con01a", "score": 0.7703459858894348, "is_gold": false, "snippet": "Rehabilitation Does Not Serve The Needs of Society  The primary goal of our criminal justice system is to remove offenders from general society and protect law abiding citizens. Many criminals are repeat offenders and rehabilitation can be a long and expensive"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-ypppgvhwmv-pro03a", "query": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting will potentially encourage voters to research the candidates' political positions more thoroughly. This may force candidates to be more open and transparent about their positions on many complex and controversial issues. Citizens will be willing to inform themselves even about unpopular policies and burning issues that need to be tackled. Better-informed voters will, therefore, oppose a plan that is unrealistic or would present an unnecessary budget-drain. This means that such a system could produce better political decisions that are not contradicting each other, quite upon the contrary.  1 Peter Tucker, The median Australian voter and the values that influence their vote choice presented by the author at the 3rd European Consortium for Political Research Conference in Budapest, September 10, 2005.", "gold_docid": "test-politics-ypppgvhwmv-pro03b", "rank_T": 34, "rank_baseline": 5, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-politics-ypppgvhwmv-con01b", "score": 0.6892296075820923, "is_gold": false, "snippet": "As noted elsewhere, forced attendance would lead to increased political awareness, and an abstention option would offer a 'none of the above'/'I don't mind or care' choice instead of people spoiling the ballot.  Because the number of voters would increase, pol"}, {"rank": 2, "docid": "training-politics-pggllgvhwa-pro03b", "score": 0.6285169720649719, "is_gold": false, "snippet": "There is no reason to assume that there will be an increase in political engagement. Votes will simply not count in different ways. If there are more coalitions, people could feel their vote doesn’t count even more strongly, as they will see that the parties t"}, {"rank": 3, "docid": "validation-digital-freedoms-gthwaueai-con03b", "score": 0.6270344257354736, "is_gold": false, "snippet": "It is impossible to tackle potential problems in party politics without an input from the electorate. Young people may have the opinion that politics itself is inaccessible, but this will never change if they refuse or fail to vote. A democratic government can"}, {"rank": 4, "docid": "training-politics-pgglgvhciu-pro03b", "score": 0.6247764825820923, "is_gold": false, "snippet": "Most people are apathetic about politics because they find it dull or do not believe that it affects them. This may be regrettable but it is hard to see how increasing the number of votes they are asked to participate in will have a positive effect on this tre"}, {"rank": 5, "docid": "test-politics-ypppgvhwmv-pro03a", "score": 0.6038017868995667, "is_gold": false, "snippet": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting"}, {"rank": 6, "docid": "training-politics-pgglgvhciu-con03a", "score": 0.6030464172363281, "is_gold": false, "snippet": "People are currently bored with politics.  The last thing they want is more votes. This will only lead to greater overall apathy and even lower turnout in general elections. California is a classic example of frequent referendums failing to ignite any noticeab"}, {"rank": 7, "docid": "validation-digital-freedoms-gthwaueai-pro02b", "score": 0.5963860154151917, "is_gold": false, "snippet": "Our political situation is not as dire as this point makes it seem; it is easy to manipulate statistics between voting and reality televisions by discounting the fact that many people who vote in television shows vote multiple times – often as many as ten [1] "}, {"rank": 8, "docid": "training-international-epvhwav1ep-pro04b", "score": 0.5925822257995605, "is_gold": false, "snippet": "While lowering the European Parliament voting age may provide an incentive to link in civic or political studies there is no guarantee that this will actually happen. There is also no reason why it should not happen already; there should not need to be an elec"}, {"rank": 9, "docid": "training-politics-pgglgvhciu-con03b", "score": 0.5914343595504761, "is_gold": false, "snippet": "People are bored with politics because they think that it is irrelevant to them and that politicians are not interested in their opinions. Increasing the use of referendums is an excellent way of increasing engagement with the general public; it forces the pol"}, {"rank": 10, "docid": "test-politics-ypppgvhwmv-pro02b", "score": 0.5873121023178101, "is_gold": false, "snippet": "This idea is nonsense. Political parties do try and capture the ‘disadvantaged groups’ vote, specifically in order to convince them that voting is in their best interest. As opposed to compulsory voting, a voluntary system in fact encourages political parties "}], "topK_baseline": [{"rank": 1, "docid": "test-politics-ypppgvhwmv-pro03a", "score": 1.0, "is_gold": false, "snippet": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting"}, {"rank": 2, "docid": "test-politics-ypppgvhwmv-con03b", "score": 0.8634380102157593, "is_gold": false, "snippet": "The benefits obtained from compulsory voting cannot be gained from any of the strategies mentioned by the opposition. Compulsory voting can enhance a sense of community, as everyone is in it together. This can be especially helpful in bringing new people in to"}, {"rank": 3, "docid": "test-politics-ypppgvhwmv-con01a", "score": 0.8495507836341858, "is_gold": false, "snippet": "Persuasion is more effective than coercion  Forcing people into voting when they are disengaged from the politic process will exacerbate this problem; no one likes doing something simply because they have to. The election results from compulsory voting may not"}, {"rank": 4, "docid": "test-politics-ypppgvhwmv-con01b", "score": 0.8387579917907715, "is_gold": false, "snippet": "As noted elsewhere, forced attendance would lead to increased political awareness, and an abstention option would offer a 'none of the above'/'I don't mind or care' choice instead of people spoiling the ballot.  Because the number of voters would increase, pol"}, {"rank": 5, "docid": "test-politics-ypppgvhwmv-pro03b", "score": 0.8271800875663757, "is_gold": true, "snippet": "Forcing the population to vote will not stop people expressing their wish not to vote. Tucker notes that in Australia 5% of eligible voters did not caste a valid vote. Most countries that use compulsory voting give voters a legal opportunity to abstain. For ex"}, {"rank": 6, "docid": "test-politics-ypppgvhwmv-pro02b", "score": 0.8138004541397095, "is_gold": false, "snippet": "This idea is nonsense. Political parties do try and capture the ‘disadvantaged groups’ vote, specifically in order to convince them that voting is in their best interest. As opposed to compulsory voting, a voluntary system in fact encourages political parties "}, {"rank": 7, "docid": "test-politics-ypppgvhwmv-pro02a", "score": 0.802696704864502, "is_gold": false, "snippet": "Compulsory voting broadens representation of disadvantaged groups  Voter apathy is highest among the poorest and most excluded sectors of society. As the Institute for Public Policy Research highlight, “the higher the income a citizen enjoys, and the higher th"}, {"rank": 8, "docid": "test-politics-ypppgvhwmv-con03a", "score": 0.7884566187858582, "is_gold": false, "snippet": "There are alternatives that tackle the real causes of voter disengagement  Compulsory voting hides the problem which is causing people to be disengaged from politics; it allows politicians to ignore measures that can tackle the true causes of political disenga"}, {"rank": 9, "docid": "test-politics-ypppgvhwmv-con02b", "score": 0.7874851226806641, "is_gold": false, "snippet": "Because mandatory voting means that no large campaign funds are needed to goad voters to the polls, the role of money in politics will decrease. Compulsory voting will reduce spending such as campaign spending on voter turnout. It can also lead to a reduction "}, {"rank": 10, "docid": "training-politics-pgglgvhciu-pro03b", "score": 0.7862293720245361, "is_gold": false, "snippet": "Most people are apathetic about politics because they find it dull or do not believe that it affects them. This may be regrettable but it is hard to see how increasing the number of votes they are asked to participate in will have a positive effect on this tre"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-free-speech-debate-fsaphgiap-con03a", "query": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and that the succession is secure so that they know what the future holds. Secrecy and the consequent spread of rumour is the worst option as businesses can have no idea what the future holds so cant make investment decisions that will be influenced by the political environment.  Leaders do matter to the economy; they set the parameters of the business environment, the taxes, subsidies, how much bureaucracy. They also influence other areas like the price of energy, the availability of transport links etc. It has been estimated that “a one standard deviation change in leader quality leads to a growth change of 1.5 percentage points”. 1 The leader who follows may be of the same quality in which case there will be little difference but equally it could mean a large change.  1 Jones, Benjjamin F., and Olken, Benjamin A., 'Do Leaders Matter? National Leadership and Growth Since World War II', Quarterly Journal of Economics, February 2005,", "gold_docid": "test-free-speech-debate-fsaphgiap-con03b", "rank_T": 33, "rank_baseline": 5, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con03a", "score": 0.6560384631156921, "is_gold": false, "snippet": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and tha"}, {"rank": 2, "docid": "training-economy-feghwarasw-pro04b", "score": 0.46712183952331543, "is_gold": false, "snippet": "While it may be true that the state is often a bad manager of assets and businesses in this case the state is not usually involved in the management of the assets. This is being done through the wealth fund which is often in large part run by people whose back"}, {"rank": 3, "docid": "training-economy-epechbuwbbe-con03b", "score": 0.46512600779533386, "is_gold": false, "snippet": "While it is almost certain that there will be a brief short term shock caused by uncertainty no one knows for sure what will happen in the long term. A Britain that is out of Europe will be better able to run its economy to encourage growth so will likely do b"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.46507930755615234, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.46507930755615234, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 6, "docid": "test-economy-bepahbtsnrt-pro01b", "score": 0.45457923412323, "is_gold": false, "snippet": "The long term affects that instability have on industries such as tourism is overstated. Since the Tunisian revolution, there has been a continued effort by Salafists to attack tourist destinations. However, tourism has recovered from the low point of 2011. In"}, {"rank": 7, "docid": "training-economy-feghwarasw-pro03b", "score": 0.4475305676460266, "is_gold": false, "snippet": "Transparency is a good thing, but it would be unfair to single out sovereign wealth funds for special punishment over this issue. Hedge funds and private equity groups are even less transparent than SWFs, and their influence in the global economy is much great"}, {"rank": 8, "docid": "training-economy-epegppphw-pro01b", "score": 0.4395221173763275, "is_gold": false, "snippet": "It might be that under theoretical conditions, free markets match up supply and demand in the long run, but as the famous economist John Maynard Keynes said: “in the long run we are all dead”. Even if a stable equilibrium is theoretically possible, in practice"}, {"rank": 9, "docid": "training-politics-pggllgvhwa-con01b", "score": 0.4357874095439911, "is_gold": false, "snippet": "A lot of successful countries use PR, so clearly it doesn’t lead to instability. In particular coalitions don’t always mean weak government. For example, Germany uses PR and has coalitions, yet is one of the strongest economies in the world and a significant p"}, {"rank": 10, "docid": "test-economy-egecegphw-pro02b", "score": 0.4339582026004791, "is_gold": false, "snippet": "The business community is far from united in its supposed support of a third run-way. Surveys suggest that many influential businesses in fact do not support expansion. A letter expressing concern was signed by Justin King the Chief Executive of J Sainsbury an"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and tha"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.7763614654541016, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.7763614654541016, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con03b", "score": 0.7517052888870239, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con03b", "score": 0.7517052888870239, "is_gold": true, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 6, "docid": "test-free-speech-debate-fsaphgiap-pro03a", "score": 0.7354751825332642, "is_gold": false, "snippet": "Transparency allows citizens to choose for a healthy leader as to ensure proper functioning  The health and fitness of a leader is a vital issue when choosing a leader; the electorate deserves to know if they are likely to serve out their term. When health con"}, {"rank": 7, "docid": "training-international-appgglhbm-pro01b", "score": 0.7329059839248657, "is_gold": false, "snippet": "The prize by focusing on leaders ignores the areas where money is needed; not lining already rich people’s pockets but providing money and advice to actually set up these institutions. This means for example ensuring the police and civil servants are well enou"}, {"rank": 8, "docid": "test-politics-oepghbrnsl-pro01a", "score": 0.7311782836914062, "is_gold": false, "snippet": "Stability is more important than reform  Since the fall of communism, Russia has plunged into a deep economic recession. The introduction of market reforms and privatization has led to a swift increase in inequalities coupled with an increase in corruption. Th"}, {"rank": 9, "docid": "training-international-appgglhbm-con04b", "score": 0.7291379570960999, "is_gold": false, "snippet": "It is not contradictory to offer a reward for good governance after the leader has left office. Dictators holding onto power for long periods are one of Africa’s biggest problems. Rewarding those who step aside shows that an important part of good governance i"}, {"rank": 10, "docid": "test-free-speech-debate-fsaphgiap-con02a", "score": 0.7283310890197754, "is_gold": false, "snippet": "Rivals could misuse the opportunity  While the leader suffers from an illness, rivals can use the opportunity to ease the leader out of office. A period of illness is a period of vulnerability in which the government is less able to respond to external and int"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-cdfsaphgiap-con03a", "query": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and that the succession is secure so that they know what the future holds. Secrecy and the consequent spread of rumour is the worst option as businesses can have no idea what the future holds so cant make investment decisions that will be influenced by the political environment.  Leaders do matter to the economy; they set the parameters of the business environment, the taxes, subsidies, how much bureaucracy. They also influence other areas like the price of energy, the availability of transport links etc. It has been estimated that “a one standard deviation change in leader quality leads to a growth change of 1.5 percentage points”. 1 The leader who follows may be of the same quality in which case there will be little difference but equally it could mean a large change.  1 Jones, Benjjamin F., and Olken, Benjamin A., 'Do Leaders Matter? National Leadership and Growth Since World War II', Quarterly Journal of Economics, February 2005,", "gold_docid": "test-politics-cdfsaphgiap-con03b", "rank_T": 32, "rank_baseline": 4, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con03a", "score": 0.6560384631156921, "is_gold": false, "snippet": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and tha"}, {"rank": 2, "docid": "training-economy-feghwarasw-pro04b", "score": 0.46712183952331543, "is_gold": false, "snippet": "While it may be true that the state is often a bad manager of assets and businesses in this case the state is not usually involved in the management of the assets. This is being done through the wealth fund which is often in large part run by people whose back"}, {"rank": 3, "docid": "training-economy-epechbuwbbe-con03b", "score": 0.46512600779533386, "is_gold": false, "snippet": "While it is almost certain that there will be a brief short term shock caused by uncertainty no one knows for sure what will happen in the long term. A Britain that is out of Europe will be better able to run its economy to encourage growth so will likely do b"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.46507930755615234, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.46507930755615234, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 6, "docid": "test-economy-bepahbtsnrt-pro01b", "score": 0.45457923412323, "is_gold": false, "snippet": "The long term affects that instability have on industries such as tourism is overstated. Since the Tunisian revolution, there has been a continued effort by Salafists to attack tourist destinations. However, tourism has recovered from the low point of 2011. In"}, {"rank": 7, "docid": "training-economy-feghwarasw-pro03b", "score": 0.4475305676460266, "is_gold": false, "snippet": "Transparency is a good thing, but it would be unfair to single out sovereign wealth funds for special punishment over this issue. Hedge funds and private equity groups are even less transparent than SWFs, and their influence in the global economy is much great"}, {"rank": 8, "docid": "training-economy-epegppphw-pro01b", "score": 0.4395221173763275, "is_gold": false, "snippet": "It might be that under theoretical conditions, free markets match up supply and demand in the long run, but as the famous economist John Maynard Keynes said: “in the long run we are all dead”. Even if a stable equilibrium is theoretically possible, in practice"}, {"rank": 9, "docid": "training-politics-pggllgvhwa-con01b", "score": 0.4357874095439911, "is_gold": false, "snippet": "A lot of successful countries use PR, so clearly it doesn’t lead to instability. In particular coalitions don’t always mean weak government. For example, Germany uses PR and has coalitions, yet is one of the strongest economies in the world and a significant p"}, {"rank": 10, "docid": "test-economy-egecegphw-pro02b", "score": 0.4339582026004791, "is_gold": false, "snippet": "The business community is far from united in its supposed support of a third run-way. Surveys suggest that many influential businesses in fact do not support expansion. A letter expressing concern was signed by Justin King the Chief Executive of J Sainsbury an"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Markets like stability  Business and the markets prize political stability. Clearly when the leader of a country is ill this stability is damaged but the damage can be mitigated by being transparent. The markets will want to know how ill the leader is, and tha"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.7763614654541016, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.7763614654541016, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con03b", "score": 0.7517052888870239, "is_gold": true, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con03b", "score": 0.7517052888870239, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 6, "docid": "test-free-speech-debate-fsaphgiap-pro03a", "score": 0.7354751825332642, "is_gold": false, "snippet": "Transparency allows citizens to choose for a healthy leader as to ensure proper functioning  The health and fitness of a leader is a vital issue when choosing a leader; the electorate deserves to know if they are likely to serve out their term. When health con"}, {"rank": 7, "docid": "training-international-appgglhbm-pro01b", "score": 0.7329059839248657, "is_gold": false, "snippet": "The prize by focusing on leaders ignores the areas where money is needed; not lining already rich people’s pockets but providing money and advice to actually set up these institutions. This means for example ensuring the police and civil servants are well enou"}, {"rank": 8, "docid": "test-politics-oepghbrnsl-pro01a", "score": 0.7311782836914062, "is_gold": false, "snippet": "Stability is more important than reform  Since the fall of communism, Russia has plunged into a deep economic recession. The introduction of market reforms and privatization has led to a swift increase in inequalities coupled with an increase in corruption. Th"}, {"rank": 9, "docid": "training-international-appgglhbm-con04b", "score": 0.7291379570960999, "is_gold": false, "snippet": "It is not contradictory to offer a reward for good governance after the leader has left office. Dictators holding onto power for long periods are one of Africa’s biggest problems. Rewarding those who step aside shows that an important part of good governance i"}, {"rank": 10, "docid": "test-free-speech-debate-fsaphgiap-con02a", "score": 0.7283310890197754, "is_gold": false, "snippet": "Rivals could misuse the opportunity  While the leader suffers from an illness, rivals can use the opportunity to ease the leader out of office. A period of illness is a period of vulnerability in which the government is less able to respond to external and int"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-society-asfhwapg-con01a", "query": "Patenting drives up the cost of therapies and renders them unaffordable to the poor  The government and its laws should take care of all their people. Because the state is a construct built by all the people, who all pay taxes to support it, laws should also be based to benefit the greatest amount of people possible.In the case of the Myriad company, which holds, together with the University of Utah Research Foundation, rights over tests for ovarian cancer, it prevented cheaper tests being offered to the public. As a result, Myriad is the only company that can market a test for the mutations, and it charges as much as $3,000 . That is a price that for many is inaccessible. Patients’ state: “There is no other, cheaper test that you could go get in another laboratory, because they have the exclusive patent,” she explained, adding that Myriad also controls the efficacy of the test—second opinions are only available for certain surgeries 1.Because patenting harms the accessibility of diagnostics and testing, it should not be allowed.  1. Pratt P.A., Court Rules That DNA Is Information, Not Intellectual Property, published March 30th 2010,  , accessed 07/20/2011", "gold_docid": "test-society-asfhwapg-con01b", "rank_T": 25, "rank_baseline": 3, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-society-asfhwapg-con01a", "score": 0.6318331956863403, "is_gold": false, "snippet": "Patenting drives up the cost of therapies and renders them unaffordable to the poor  The government and its laws should take care of all their people. Because the state is a construct built by all the people, who all pay taxes to support it, laws should also b"}, {"rank": 2, "docid": "test-health-dhiacihwph-con02b", "score": 0.5752054452896118, "is_gold": false, "snippet": "Medically there is no difference between generic and patented drugs. They are both identical, with the exception of aesthetic differences in some US drugs to avoid copyright infringement. Generic drugs cost less because they do not have to invest in R&amp;D [1"}, {"rank": 3, "docid": "test-health-dhiacihwph-pro02b", "score": 0.561545729637146, "is_gold": false, "snippet": "The use of generic drugs can sometimes fail to bring about a reduced price. For the cost of drugs to decrease, there must be competition within the industry to drive prices down. The switch from patented to generic drugs in Ireland failed to bring about any si"}, {"rank": 4, "docid": "training-society-fygspsmy-con03b", "score": 0.5602127909660339, "is_gold": false, "snippet": "In health services where much care is provided for free there has always been a question of balancing resources. Some treatments are just too expensive, when this is the case the individuals are free to pay for private healthcare. Clearly then if there is less"}, {"rank": 5, "docid": "training-science-cidfiphwa-con01b", "score": 0.5555288791656494, "is_gold": false, "snippet": "While there is little cost to the government of recognizing intellectual property rights there is a big cost to those whose intellectual property is being protected. The cost of both processing and enforcement is passed on to the users who are the people who a"}, {"rank": 6, "docid": "training-philosophy-lsgsgfhbpsb-pro02b", "score": 0.550371527671814, "is_gold": false, "snippet": "A medical procedure is not a product that should be excluded from those who cannot afford it. Either it is beneficial enough to be subsidized by the state and therefore available to all, or it is the start of a slippery slope towards designer babies and theref"}, {"rank": 7, "docid": "test-society-asfhwapg-con02b", "score": 0.5495554208755493, "is_gold": false, "snippet": "Patenting in general is creating more possibilities for patients than if there was no patenting and less competition for development. Even if treatments and diagnostics for some diseases are expensive, they are at least there and are beginning to benefit the p"}, {"rank": 8, "docid": "test-health-dhghwapgd-pro04b", "score": 0.5412446856498718, "is_gold": false, "snippet": "The costs associated with the current patent regime are necessary to the maintenance of innovation. It may be costly, and technically inefficient to police property rights, but that does not make them less of a right. If firms feel they can benefit from fighti"}, {"rank": 9, "docid": "test-health-dhghwapgd-pro01b", "score": 0.5409666895866394, "is_gold": false, "snippet": "There is nothing unjust about the patent system. It protects everyone equally. The nature of democracy is such that people are allowed to express their opinions and to organize to further certain aims. Drug companies have a particular interest in protecting th"}, {"rank": 10, "docid": "training-free-speech-debate-bphwpborfs-con01b", "score": 0.5399907231330872, "is_gold": false, "snippet": "The suggestion that seven million dollars is an excessive expenditure on a resource for 836,000 is extortionate is simply nonsense. That’s a little over eight dollars a head, hardly likely to break the bank. To say that a government is not discouraging the use"}], "topK_baseline": [{"rank": 1, "docid": "test-society-asfhwapg-con01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Patenting drives up the cost of therapies and renders them unaffordable to the poor  The government and its laws should take care of all their people. Because the state is a construct built by all the people, who all pay taxes to support it, laws should also b"}, {"rank": 2, "docid": "test-society-asfhwapg-con02b", "score": 0.8218075037002563, "is_gold": false, "snippet": "Patenting in general is creating more possibilities for patients than if there was no patenting and less competition for development. Even if treatments and diagnostics for some diseases are expensive, they are at least there and are beginning to benefit the p"}, {"rank": 3, "docid": "test-society-asfhwapg-con01b", "score": 0.8004099726676941, "is_gold": true, "snippet": "Firstly, it is not self-evident, that people have a right to use and possess something, such as medicine that they did not create.So why should people have the right to use a product that someone else discovered through the power of their own cognitive abiliti"}, {"rank": 4, "docid": "test-health-dhiacihwph-pro04a", "score": 0.7922749519348145, "is_gold": false, "snippet": "Unfair to apply same patent laws universally  It is unrealistic to expect poorer countries, such as those in Africa, to pay the same price as the developed world’s markets. Current patent laws for many countries dictate that prices for buying patented drugs sh"}, {"rank": 5, "docid": "test-society-asfhwapg-con02a", "score": 0.789729654788971, "is_gold": false, "snippet": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those "}, {"rank": 6, "docid": "test-health-dhghwapgd-pro04b", "score": 0.7832591533660889, "is_gold": false, "snippet": "The costs associated with the current patent regime are necessary to the maintenance of innovation. It may be costly, and technically inefficient to police property rights, but that does not make them less of a right. If firms feel they can benefit from fighti"}, {"rank": 7, "docid": "training-digital-freedoms-pidfakhwcs-con01b", "score": 0.782374918460846, "is_gold": false, "snippet": "Publicly funded research is not the sole property of researchers, indeed Universities demand to keep the rights not the individual researchers so the individual inventor or researcher is not benefiting at all from any profits. [1] When the state chooses to fun"}, {"rank": 8, "docid": "test-society-asfhwapg-pro02b", "score": 0.7764183282852173, "is_gold": false, "snippet": "In the twenty years of a patent’s duration, any prospective research is carried out in fear of recriminations and law-suits from the patent-holder. Laboratories offering patented genetic tests for research studies have been asked to “cease and desist” unless t"}, {"rank": 9, "docid": "test-health-dhghwapgd-pro01a", "score": 0.7718155980110168, "is_gold": false, "snippet": "The current patent system is unjust and creates perverse incentives that benefit large pharmaceutical companies at the expense of ordinary citizens  The current drug patent regime is largely designed to benefit and shield the profits of large pharmaceutical co"}, {"rank": 10, "docid": "test-health-dhghwapgd-pro01b", "score": 0.7707139849662781, "is_gold": false, "snippet": "There is nothing unjust about the patent system. It protects everyone equally. The nature of democracy is such that people are allowed to express their opinions and to organize to further certain aims. Drug companies have a particular interest in protecting th"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-sdiflhrdffe-con01a", "query": "An amnesty policy will serve only to alienate regimes, shutting down the possibility of discourse or reform  It is a natural conclusion that a repressive regime, which operates largely by force and the control of its population, will react rather negatively to an action by the West that appears to be a calculated, public, and on-going subversion of their power in favour of criminal dissidents. The result of such action by Western democracies will not be any positive discourse between the targeted regime and the West, but will rather cause a breakdown in communication. They will be reticent to engage for the very reason that the states seeking to influence them are clearly not interested in dealing on an equal footing, but rather wish to undermine their way of life in favour of asserting their own superiority. The best way to actually get talks about reform started, and to empower those who wish for more democracy and press freedom, is to patiently engage with these regimes, to coax them peaceably toward reform without threatening their core aims. [1] Aggression toward them will generate aggression in return as is shown again and again by North Korea and the responses to its actions by the United States. While incremental change may feel glacial, the long game is the only way to get changes without letting blood flow through the streets. The only possible outcome of this policy would be a harsher crackdown on bloggers by these governments.  [1] Larison, D. “Engagement is Not Appeasement”. The American Conservative. 17 December 2012.", "gold_docid": "test-law-sdiflhrdffe-con01b", "rank_T": 26, "rank_baseline": 5, "overlap@K": 0.2, "topK_T": [{"rank": 1, "docid": "training-digital-freedoms-fehbwdsot-con01b", "score": 0.622362494468689, "is_gold": false, "snippet": "Appeasement does not work to increase internet freedom. This has been shown time and time again with China. China has slowly been becoming more and more accepted into the international system; it gained Security Council membership in 1971, joined the WTO in 20"}, {"rank": 2, "docid": "test-law-sdiflhrdffe-con01a", "score": 0.6135711669921875, "is_gold": false, "snippet": "An amnesty policy will serve only to alienate regimes, shutting down the possibility of discourse or reform  It is a natural conclusion that a repressive regime, which operates largely by force and the control of its population, will react rather negatively to"}, {"rank": 3, "docid": "training-digital-freedoms-fehwiwcb-con02b", "score": 0.5601123571395874, "is_gold": false, "snippet": "It is often not enough simply to encourage gradual change, many states when given such encouragement simply take what the west offers and ignores what the west asks. This indeed was the case with Mubarak's Egypt for three decades, it took billions in aid from "}, {"rank": 4, "docid": "test-international-gsciidffe-con03b", "score": 0.5512056946754456, "is_gold": false, "snippet": "If a regime is so intolerant as to threaten its citizens for using lines of communication that have been opened by another country then that country is clearly in need of greater openness towards freedom of expression and information. This is something that un"}, {"rank": 5, "docid": "training-digital-freedoms-fehwufafra-con04b", "score": 0.5500062704086304, "is_gold": false, "snippet": "This implies that without efforts by democracies to ‘undermine’ non democratic regimes the internet would be nice and peaceful and everyone could get on with what they like doing on the internet. Nothing could be further from the truth. There is already a sign"}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-pro01b", "score": 0.5359851121902466, "is_gold": false, "snippet": "Internet censorship is a problem, but it is hardly the biggest one facing people in these countries. Internet access is often limited to only the more affluent segments of most poor countries, and it is thus not the best mode of building grass roots movement f"}, {"rank": 7, "docid": "training-digital-freedoms-gtdfais-con02b", "score": 0.5262214541435242, "is_gold": false, "snippet": "Democratic change can come about in a variety of ways. Violent public protests are only one such way, and probably the least desirable one. And now, with access to social media nearly universally available, such protests can be organized faster, on a larger, m"}, {"rank": 8, "docid": "test-law-sdiflhrdffe-pro01b", "score": 0.522346556186676, "is_gold": false, "snippet": "Offering amnesty will not serve the cause of justice, it is responding to the symptom not the cause. It is unfortunate that individual bloggers suffer at the hands of governments, but seeking to give them amnesty will only serve to anger the regimes, leading t"}, {"rank": 9, "docid": "training-digital-freedoms-fehbwdsot-pro03b", "score": 0.5193357467651367, "is_gold": false, "snippet": "As with all messages this will not make a “clear and emphatic statement about free speech” rather it will be a message that is muddied by hypocrisy. Autocratic ‘repressive’ regimes are not the only states to enable some form of censorship on the internet. Brit"}, {"rank": 10, "docid": "training-digital-freedoms-aihbied-pro04b", "score": 0.5183995366096497, "is_gold": false, "snippet": "For many countries, communication with outside actors does not make any difference. Iran has some internet freedom and access to outside information, yet president Ahmadinejad casts the West as a great evil trying to destroy Iran's culture1 . The government re"}], "topK_baseline": [{"rank": 1, "docid": "test-law-sdiflhrdffe-con01a", "score": 1.0, "is_gold": false, "snippet": "An amnesty policy will serve only to alienate regimes, shutting down the possibility of discourse or reform  It is a natural conclusion that a repressive regime, which operates largely by force and the control of its population, will react rather negatively to"}, {"rank": 2, "docid": "training-digital-freedoms-fehbwdsot-con01a", "score": 0.8676698207855225, "is_gold": false, "snippet": "This policy alienates the oppressive regimes and stifles the change that discourse and positive interaction can bring  When a repressive government sees its power directly attacked by Western democracies, and sees them actively trying to subvert their power by"}, {"rank": 3, "docid": "training-digital-freedoms-fehwiwcb-con02a", "score": 0.8484211564064026, "is_gold": false, "snippet": "Clandestine aid to dissidents will serve to alienate and close off discourse on policy  Reform in oppressive regimes, or ones that have less than stellar democratic and human rights records that might precipitate an uprising, is often slow in coming, and exter"}, {"rank": 4, "docid": "test-law-sdiflhrdffe-pro03a", "score": 0.8309836983680725, "is_gold": false, "snippet": "This offer of amnesty serves as a powerful public statement in favour of free speech and rule of law  In offering amnesty Western governments make an exceptionally powerful public statement in the international arena, an area in which they already hold great s"}, {"rank": 5, "docid": "test-law-sdiflhrdffe-con01b", "score": 0.8266185522079468, "is_gold": true, "snippet": "All countries, even authoritarian ones, desire to be considered legitimate and valued in the international community. The weight of condemnation that a policy of amnesty creates is one that bears down heavily on repressive regimes and can galvanize them to ref"}, {"rank": 6, "docid": "test-law-sdiflhrdffe-con03a", "score": 0.8155682682991028, "is_gold": false, "snippet": "The offer of amnesty allows home governments to discredit bloggers and paint them as foreign agents of disruption  When Western states and democracies offer amnesty to bloggers under threat from their home governments, the blogger’s views and comments immediat"}, {"rank": 7, "docid": "test-law-sdiflhrdffe-pro01b", "score": 0.8092061281204224, "is_gold": false, "snippet": "Offering amnesty will not serve the cause of justice, it is responding to the symptom not the cause. It is unfortunate that individual bloggers suffer at the hands of governments, but seeking to give them amnesty will only serve to anger the regimes, leading t"}, {"rank": 8, "docid": "training-free-speech-debate-ifcidffe-con03a", "score": 0.8015653491020203, "is_gold": false, "snippet": "This ban will alienate non-democracies from discourse and stifle reform efforts  When a state is declared illegitimate in the eyes of a large part of the international community, its natural reaction is one of upset and anger. A ban on the sale of surveillance"}, {"rank": 9, "docid": "test-law-sdiflhrdffe-pro02b", "score": 0.7926434278488159, "is_gold": false, "snippet": "A democracy’s first duty must always be to the citizens that elect it, not to foreign dissidents. Their duty therefore is to be engaging with these regimes to the benefit of their own citizens; through encouraging trade relations for example. Offering amnesty "}, {"rank": 10, "docid": "training-digital-freedoms-fehbwdsot-pro03a", "score": 0.7912378907203674, "is_gold": false, "snippet": "This would make a powerful statement in favour of freedom of expression and against repression  Western governments pursuing this policy serve to make a clear and emphatic statement about free speech in an arena it has significant power to influence. By taking"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-science-ciidfaihwc-pro02a", "query": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to the point where it does not impede the ‘protection of other human rights’ [2] – other peoples’ right not to be abused. In this case, if an individual expresses abuse towards another – especially racism - they may be deemed to be outside of the boundaries or free speech and can be punished for it. This motion is simply an extension of this principle; the kinds of sites which would be banned are those which perpetuate hatred or attack other groups in society, an so already fall outside of the protection of free speech. The harms that stem from these kinds of sites outweigh any potential harm from limiting speech in a small number of cases.  [1] Hera.org, ‘Freedom of Expression’, Human Rights Education Association,  on 09/09/11  [2] Hera.org, ‘Freedom of Expression’, Human Rights Education Association,  on 09/09/11", "gold_docid": "test-science-ciidfaihwc-pro02b", "rank_T": 23, "rank_baseline": 2, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-science-ciidfaihwc-pro02a", "score": 0.7464925050735474, "is_gold": false, "snippet": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to t"}, {"rank": 2, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.7026112675666809, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 3, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.686505138874054, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 4, "docid": "test-science-ciidfaihwc-con01b", "score": 0.640722393989563, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 5, "docid": "training-digital-freedoms-fehwbawdh-con01b", "score": 0.6295726895332336, "is_gold": false, "snippet": "Freedom of speech certainly may be curtailed when there is a real harm manifested from it. Holocaust denial, in its refusal to acknowledge one of the most barbaric acts in human history and attempt to justify terrible crimes, is an incredibly dehumanizing forc"}, {"rank": 6, "docid": "validation-free-speech-debate-bphwpbsas-con04b", "score": 0.6112779378890991, "is_gold": false, "snippet": "The prevailing will of the majority can outweigh that of individuals with regard to free speech in some instances, namely when there is harm to people from the acts of individuals. Such is the case with things like hate speech, and certainly does so in the cas"}, {"rank": 7, "docid": "test-digital-freedoms-aihwbasmn-pro01b", "score": 0.6049541234970093, "is_gold": false, "snippet": "Of course we do not want freedom of speech to be misused to incite and organise rioting and violence but that does not mean that it is always illegitimate. Riots may sometimes be the natural outgrowth of bad policy and a government that has been unwilling to l"}, {"rank": 8, "docid": "training-law-aullgsmhwchs-pro01b", "score": 0.6037015318870544, "is_gold": false, "snippet": "The government’s primary duty is to protect the constitutional rights of its citizens. Censoring speech is a clear attack on the right to free expression. Governments can use the criminal code to ensure people are protected. Acts that physically harm people or"}, {"rank": 9, "docid": "test-free-speech-debate-ldhwprhs-con03a", "score": 0.5961273908615112, "is_gold": false, "snippet": "Silencing views that are considered offensive is self-defeating and would be detrimental to those attempting to advance gay rights.  If freedom of speech is to mean anything then it needs to be a principle that is universally applied. Unless speech represents "}, {"rank": 10, "docid": "training-free-speech-debate-nvhsibsv-pro01b", "score": 0.5868397951126099, "is_gold": false, "snippet": "‘Freedom of speech’ is not so much a ‘cultural value’ so much as it is a vehicle for communicating and exploring different cultural values."}], "topK_baseline": [{"rank": 1, "docid": "test-science-ciidfaihwc-pro02a", "score": 1.0, "is_gold": false, "snippet": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to t"}, {"rank": 2, "docid": "test-science-ciidfaihwc-pro02b", "score": 0.8356688022613525, "is_gold": true, "snippet": "Outright banning this kind of prejudice does not directly tackle it – it ignores it. A better way for the government to tackle derogatory and prejudicial speech is to engage with it in a public forum and reasonably point out the flaws and ignorance that it emb"}, {"rank": 3, "docid": "test-science-ciidfaihwc-con01b", "score": 0.8350057601928711, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 4, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.8315662145614624, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 5, "docid": "test-free-speech-debate-ldhwprhs-con02a", "score": 0.8297735452651978, "is_gold": false, "snippet": "There is no right not to be offended, enforcing what is acceptable to be thought or said places far too much power in the hands of the state.  It is impossible to ensure that nobody is ever offended and it is questionable as to whether it is even desirable [1]"}, {"rank": 6, "docid": "training-culture-amcghbmgvaw-con03b", "score": 0.829150915145874, "is_gold": false, "snippet": "However, while freedom of expression is definitely an important concept to consider, such freedoms can only go so far. When it comes to language that promotes violence then freedom of expression is no longer sufficient reason not to ban something as a physical"}, {"rank": 7, "docid": "test-digital-freedoms-eifpgdff-pro02b", "score": 0.8282753825187683, "is_gold": false, "snippet": "As in the offline world, free speech isn’t unlimited  Even in free societies, free speech isn’t always free. Free speech can be demeaning and hurtful to certain people or can even incite hatred and violence. [1] The first reason is why, under internet libel la"}, {"rank": 8, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.8279837965965271, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 9, "docid": "training-digital-freedoms-gtdfais-con01b", "score": 0.8222471475601196, "is_gold": false, "snippet": "Freedom of expression, assembly, and information are important rights, but restrictions can be placed on all of them if a greater good, like public safety, is at stake. For example, one cannot use her freedom of expression to incite violence towards others and"}, {"rank": 10, "docid": "test-science-ciidfaihwc-con01a", "score": 0.8175135850906372, "is_gold": false, "snippet": "Censorship is fundamentally incompatible with the notion of free speech.  Censoring particular material essentially blinds the public to a complete world view by asserting the patronising view that ordinary citizens simply cannot read extreme material without "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-dhwem-pro05a", "query": "PMCs provide a service that may be otherwise unavailable.  Many nation states have achieved sufficient unity to rely on their own armies but for those which cant, mercenary forces provide an invaluable and possibly only mode of protection and security. British Foreign Secretary Jack Straw believes that in an era of “small wars and weak states” mercenaries have a “legitimate role” (The Economist, 2002). Mercenaries may be the only way of providing short term security guarantees to allow a government to establish itself without relying on warlords or one side of an ethnic conflict. This could be the only way out of a pattern of coup and counter-coup. Recruiting local mercenaries also has the benefits of reducing transportation costs, instant readiness as well as any knowledge of the local politics, geography and customs which may be highly valuable to a security force. These local recruits may be less inclined to share this information with a government force.", "gold_docid": "test-politics-dhwem-pro05b", "rank_T": 23, "rank_baseline": 4, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-politics-dhwem-pro05a", "score": 0.764893114566803, "is_gold": false, "snippet": "PMCs provide a service that may be otherwise unavailable.  Many nation states have achieved sufficient unity to rely on their own armies but for those which cant, mercenary forces provide an invaluable and possibly only mode of protection and security. British"}, {"rank": 2, "docid": "training-international-apdwhbpa-con01b", "score": 0.5342310667037964, "is_gold": false, "snippet": "Firstly, the emergence of the African Union (AU) as a peacekeeping force on the continent negates the need for mercenaries. The AU’s has become increasingly involved in peacekeeping since 200316. They are more willing to involve themselves in African affairs t"}, {"rank": 3, "docid": "training-international-apdwhbpa-pro03b", "score": 0.5141980648040771, "is_gold": false, "snippet": "There are still enough wars and rebel movements to provide opportunity for employment. By 2013 there were 23 conflicts in Africa, with many other small militia groups actively fighting low-intensity wars. This stream of conflicts has ensured revenue for mercen"}, {"rank": 4, "docid": "test-politics-dhwem-con04b", "score": 0.5026046633720398, "is_gold": false, "snippet": "This does not necessarily mean that there is anything inherently wrong with using PMCs. While it might be true that the United States has sometimes misjudged which private forces to hire, this does not mean that we cannot use PMCs altogether. In fact, there ca"}, {"rank": 5, "docid": "training-international-ygiadwmhb-pro03b", "score": 0.48314082622528076, "is_gold": false, "snippet": "Armed forces do not require large amounts of funding to be well disciplined forces that are subordinate to civilian governance. This was shown by many communist nations; Vietnam’s army was immense, beat both the French and Americans and was firmly under party "}, {"rank": 6, "docid": "test-politics-dhwem-con01a", "score": 0.4739968478679657, "is_gold": false, "snippet": "PMCs have an interest in conflict.  ncreased reliance on mercenaries is destabilising in the long term. It allows invaders and local governments to feel that they can get away with not providing sufficiently trained or numerous security forces because there ar"}, {"rank": 7, "docid": "training-international-apdwhbpa-pro04b", "score": 0.4688883125782013, "is_gold": false, "snippet": "More than half of African countries are ruled by dictatorships. Authoritarian regimes remain numerous enough, and the opposition still prominent enough, for there to be adequate instability for mercenaries to gain employment. During the Libyan revolution, caus"}, {"rank": 8, "docid": "training-international-apdwhbpa-con03b", "score": 0.44866320490837097, "is_gold": false, "snippet": "NGOs are actively discouraged from hiring mercenaries. In 2003, UK Foreign Secretary Jack Straw strongly advised against the use of mercenaries by British companies on the Ivory Coast. In addition to government deterrence, many charities are more likely to dep"}, {"rank": 9, "docid": "training-international-aghwaucsa-pro01b", "score": 0.44781172275543213, "is_gold": false, "snippet": "On this point, there are two main reasons why the AU will actually do a poorer job as far as security in concerned.  First of all, there are no assurances that African countries have the necessary expertize or financial capacity of supporting a well trained an"}, {"rank": 10, "docid": "test-politics-dhwem-pro04b", "score": 0.446170449256897, "is_gold": false, "snippet": "The amount of attention and suspicion depends on what the PMCs are doing not that they are PMCs. Whilst mercenaries appear to be less disliked than American troops in Iraq, in parts of Africa their activities have increased tension. The reputation of a nationa"}], "topK_baseline": [{"rank": 1, "docid": "test-politics-dhwem-pro05a", "score": 0.9999998211860657, "is_gold": false, "snippet": "PMCs provide a service that may be otherwise unavailable.  Many nation states have achieved sufficient unity to rely on their own armies but for those which cant, mercenary forces provide an invaluable and possibly only mode of protection and security. British"}, {"rank": 2, "docid": "test-politics-dhwem-con01a", "score": 0.8472928404808044, "is_gold": false, "snippet": "PMCs have an interest in conflict.  ncreased reliance on mercenaries is destabilising in the long term. It allows invaders and local governments to feel that they can get away with not providing sufficiently trained or numerous security forces because there ar"}, {"rank": 3, "docid": "test-politics-dhwem-pro02a", "score": 0.8165850043296814, "is_gold": false, "snippet": "PMCs give value for money  Mercenaries are a cost efficient way of fighting. Although expensive to hire, the government does not have to cover the cost of training, housing, pensions or healthcare. Mercenaries, unlike regular troops, are only paid for the days"}, {"rank": 4, "docid": "test-politics-dhwem-pro05b", "score": 0.8156462907791138, "is_gold": true, "snippet": "The use of mercenaries is counterproductive for unstable states. By relying on hired mercenaries weak states encourage private competition rather than reinforcing their own nascent armies. The emergence of powerful local, as well as international, mercenary or"}, {"rank": 5, "docid": "test-politics-dhwem-pro04a", "score": 0.8114603161811829, "is_gold": false, "snippet": "PMCs attract less attention and suspicion and can carry out their role more effectively.  Mercenaries often arouse less hostility amongst civilians than soldiers fighting for national armies. In ethnic conflict they are perceived as less partisan. The fact tha"}, {"rank": 6, "docid": "test-politics-dhwem-con03b", "score": 0.8077219724655151, "is_gold": false, "snippet": "A good reputation is vital to any company, including PMCs, so human rights abuses or any other activity which is deemed questionable would be avoided. Mercenaries are not protected by legal immunity would have to face justice for any crime like any other crimi"}, {"rank": 7, "docid": "training-international-apdwhbpa-con03b", "score": 0.806117057800293, "is_gold": false, "snippet": "NGOs are actively discouraged from hiring mercenaries. In 2003, UK Foreign Secretary Jack Straw strongly advised against the use of mercenaries by British companies on the Ivory Coast. In addition to government deterrence, many charities are more likely to dep"}, {"rank": 8, "docid": "test-politics-dhwem-con02a", "score": 0.7973086833953857, "is_gold": false, "snippet": "PMCs are untrustworthy  The possibility of mercenaries pulling out will always remain a risk. PMCs are not fighting for their own country so they can never be threatened with a charge of desertion. PMCs are motivated by money and do not have the interests of t"}, {"rank": 9, "docid": "test-politics-dhwem-pro03a", "score": 0.7961184978485107, "is_gold": false, "snippet": "PMCs have an equally strong incentive to perform.  PMCs must perform carefully and effectively to secure future contracts. It is therefore in their interests to ensure their employees are well- trained and well-equipped and perform to the highest standard. Mos"}, {"rank": 10, "docid": "test-politics-dhwem-con03a", "score": 0.7958909273147583, "is_gold": false, "snippet": "PMCs violate human rights and International agreements in pursuit of profit or power.  Some PMCs may abuse the power they wield. Simon Mann, founder of PMCs EO and Sandline International, in a recent plot to oust President Obiang in Equatorial Guinea (BBC News"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-economy-epehwmrbals-pro04a", "query": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be a way of allocating it. It is not surprising therefore that countries with shared colonial histories tend to dominate aid flows, thus Britain has historically given most aid to countries that were its colonies; in 1960 Malta and Cyprus received most, while India was the biggest recipient for much of the rest of the 20th Century. [1] Further, often countries offering aid, such as the US, the UK, and the EU, require the pre-requisite of democracy or the start of a democratisation process. Therefore, it is justified to add a pre-requisite for better standards of business and labour as it helps implementation, and principally meets the goals of the developmental aid itself. [2]  [1] Provost, Claire, ‘UK aid: where does it o and how has it changed since 1960?’, Datablog guardian.co.uk, 14 April 2011,   [2] Dollar, David and Alesina, Alberto. “Who Gives Foreign Aid to Whom and Why?” Journal of Economic Growth, Volume 5, No. 1(Mar., 2000).", "gold_docid": "test-economy-epehwmrbals-pro04b", "rank_T": 21, "rank_baseline": 2, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-economy-epehwmrbals-pro04a", "score": 0.6236763596534729, "is_gold": false, "snippet": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be "}, {"rank": 2, "docid": "test-international-aghbfcpspr-con03b", "score": 0.5583059787750244, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 3, "docid": "training-health-ssiahrgmhwc-pro03b", "score": 0.5541010499000549, "is_gold": false, "snippet": "The international community has an obligation to help poorer countries, and cannot simply walk away from it over an issue such as this. Exploitation, through imperialism and other means, has been a major feature of Western relations with Africa. From colonial "}, {"rank": 4, "docid": "training-international-aaghwsddf-pro02b", "score": 0.5453875064849854, "is_gold": false, "snippet": "Cutting aid payments to the governments of states that are aid dependent would severely restrict the provision of public services and undermine public and international confidence in fragile political settlements. This dependence therefore prevents the aid bei"}, {"rank": 5, "docid": "training-economy-fegippghp-pro04b", "score": 0.5182674527168274, "is_gold": false, "snippet": "Resources will only be scarcer without aid; further chaos and corruption will ensue. There would be no need for fighting should resources be shared out equally. If aid is transferred to governments there is surely a centralized method of doing so; aid itself i"}, {"rank": 6, "docid": "test-international-aghbfcpspr-con01b", "score": 0.5062332153320312, "is_gold": false, "snippet": "Given that many former colonies remain poor (even after so many years), it is very unlikely that these people would have no need for such money. The difference in timescale is irrelevant; what is relevant is that such former colonies have a demonstrated need f"}, {"rank": 7, "docid": "training-economy-epiaghwssd-con01b", "score": 0.5055385828018188, "is_gold": false, "snippet": "It does not make sense that India should receive aid simply because it still has poor people. Aid is used to help when the government cannot provide for its own people and India clearly already provides the vast majority of help for its own people and will pro"}, {"rank": 8, "docid": "training-economy-epiaghwssd-pro01b", "score": 0.5050814747810364, "is_gold": false, "snippet": "The geography of poverty has changed; in 1990 94% of those in poverty lived in ‘low income countries’ today that is down to 28%. The rest live in ‘middle income countries’ that are often fast growing and able to provide much of their own poverty reduction fund"}, {"rank": 9, "docid": "training-international-aghwrpusvpa-pro03b", "score": 0.4995461404323578, "is_gold": false, "snippet": "Despite Africa’s demands for increased influence, they are not in a position of power and it is within their interest to maintain positive relations with the developed powers.  They have numbers but despite their economic growth in the past decade Africa is st"}, {"rank": 10, "docid": "training-economy-epiaghwssd-pro02a", "score": 0.4806721806526184, "is_gold": false, "snippet": "“White Man’s Burden”  Aid is simply a continuation of the “white man’s burden” and is therefore demeaning to the countries where it is meant to help. It implies that western countries have to provide money to those who are less ‘developed’ in order to develop "}], "topK_baseline": [{"rank": 1, "docid": "test-economy-epehwmrbals-pro04a", "score": 1.0, "is_gold": false, "snippet": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be "}, {"rank": 2, "docid": "test-economy-epehwmrbals-pro04b", "score": 0.7855496406555176, "is_gold": true, "snippet": "Strategic interests can be put to risk by such pre-requisites. Donor nations have strategic interests when awarding aid, which ensure that future trade relations are well secured (such as United States and the Middle Eastern oil states). This is why aid goes t"}, {"rank": 3, "docid": "training-economy-epiaghwssd-pro02b", "score": 0.7764654755592346, "is_gold": false, "snippet": "It is nonsense to compare aid with the west’s actions during the nineteenth century. Yes the west with aid sometimes wants to encourage its own values but this is a long way from forcing those values on the other state. The IMF may demand certain changes and l"}, {"rank": 4, "docid": "training-economy-epiaghwssd-pro03a", "score": 0.7701785564422607, "is_gold": false, "snippet": "The west does not know best  It is clear that the donor countries do not know how best to spend the money they give as aid. Instead they want their money spent on the latest development fad whether this is the privatisation of basic services, microcredit, cond"}, {"rank": 5, "docid": "test-international-aghbfcpspr-con03b", "score": 0.7698595523834229, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 6, "docid": "training-economy-fegippghp-pro04b", "score": 0.7638905048370361, "is_gold": false, "snippet": "Resources will only be scarcer without aid; further chaos and corruption will ensue. There would be no need for fighting should resources be shared out equally. If aid is transferred to governments there is surely a centralized method of doing so; aid itself i"}, {"rank": 7, "docid": "test-international-aghbfcpspr-con04b", "score": 0.7596766352653503, "is_gold": false, "snippet": "There is a fundamental difference here between colonisation and the modern day; whereas colonial powers were formerly damaging infrastructure [1] and natural resources [2] , in the modern day under reparations they would be helping to preserve such resources a"}, {"rank": 8, "docid": "test-international-aghbfcpspr-pro05a", "score": 0.7571428418159485, "is_gold": false, "snippet": "Reparations demonstrate a true concern for the developing world.  Even alongside the colonial justifications for providing reparations, there are also many other strong reasons why former colonial powers should grant reparations. Former colonial powers tend to"}, {"rank": 9, "docid": "test-international-aghbfcpspr-con01b", "score": 0.7569555044174194, "is_gold": false, "snippet": "Given that many former colonies remain poor (even after so many years), it is very unlikely that these people would have no need for such money. The difference in timescale is irrelevant; what is relevant is that such former colonies have a demonstrated need f"}, {"rank": 10, "docid": "training-economy-epiaghwssd-con04a", "score": 0.7564006447792053, "is_gold": false, "snippet": "Pressure from international donors is essential  Currently the culture of giving in India is not mature enough to enable India to fight poverty on its own. Aid to India therefore provides more than one role. It does not just provide the money and supplies that"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-society-asfhwapg-con02a", "query": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those of conscience.  The Human Genome Project is one of the government funded projects that makes all its research freely and publicly available. They are not driven by profit and offer information on their discoveries for free enabling others to build upon their findings.  The problem with patents is that companies claim ownership without regard towards moral issues. It is purely in the pursuit of their profits that they decide not to allow others to build on their findings and make the process of discovering treatments far more difficult. An example of this is the Myriad company which, whilst holding patents on BRCA 1 &amp; 2, genes connected with breast cancer, prevented the University of Pennsylvania from using a test for these genes which was substantially cheaper than the company’s own screening procedure. 1  Instead of protecting their research investment, companies should have a moral duty to facilitate in any way they can to the development of cheap, available treatments and screenings for diseases which are so dangerous to so many people.  1. Spektor, Michelle, \"Genes Are Still Patentable, Federal Appeals Court Rules\", Science Progress, 17 August 2011,", "gold_docid": "test-society-asfhwapg-con02b", "rank_T": 20, "rank_baseline": 3, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-society-asfhwapg-pro01b", "score": 0.7003973722457886, "is_gold": false, "snippet": "Of course genes should be treated different from any product or other invention; genes are the very basis for human life and to claim that anyone has the right to be regarded as the ‘owner’ of a particular gene, which we all share in our bodies, shows a venal "}, {"rank": 2, "docid": "test-society-asfhwapg-pro02b", "score": 0.6891236305236816, "is_gold": false, "snippet": "In the twenty years of a patent’s duration, any prospective research is carried out in fear of recriminations and law-suits from the patent-holder. Laboratories offering patented genetic tests for research studies have been asked to “cease and desist” unless t"}, {"rank": 3, "docid": "test-society-asfhwapg-con01b", "score": 0.6609642505645752, "is_gold": false, "snippet": "Firstly, it is not self-evident, that people have a right to use and possess something, such as medicine that they did not create.So why should people have the right to use a product that someone else discovered through the power of their own cognitive abiliti"}, {"rank": 4, "docid": "test-society-asfhwapg-con02a", "score": 0.6433460712432861, "is_gold": false, "snippet": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those "}, {"rank": 5, "docid": "test-health-dhghwapgd-con02b", "score": 0.6299878358840942, "is_gold": false, "snippet": "If firms are afraid their formulae will be stolen, then they should keep them hidden. Otherwise, they should seek to make their new drug public, benefiting everyone so that the most people possible can have access to them. The release of ideas is most bountifu"}, {"rank": 6, "docid": "test-health-dhghwapgd-pro03b", "score": 0.6098068356513977, "is_gold": false, "snippet": "Allowing the production of generic drugs will only increase production of drugs currently on the market. Without the profit incentive that patents provide, pharmaceutical companies will not invest in the expensive process of developing new drugs in the first p"}, {"rank": 7, "docid": "training-science-cidfiphwa-con03b", "score": 0.6017128825187683, "is_gold": false, "snippet": "Research and development will continue, irrespective of intellectual property rights. The desire of firms to stay ahead of the competition will drive them to invest in research regardless. That their profits will be diminished by the removal of intellectual pr"}, {"rank": 8, "docid": "test-health-dhiacihwph-pro04b", "score": 0.5793008804321289, "is_gold": false, "snippet": "Pharmaceutical companies investing in R&amp;D deserve to make a return on their investments. Research and development can take a long time and will cost significant sums of money. The cost of creating many new drugs was estimated to be as high as $5 billion in"}, {"rank": 9, "docid": "training-international-gsciidfi-pro02b", "score": 0.5779902935028076, "is_gold": false, "snippet": "The reality is that antibiotics and similar medicines are mostly sold to Monopsonistic governments and don’t represent the profit base of big Pharma. Instead they have focussed on products such as Prozac that are high-profit by their nature, while thirty-year "}, {"rank": 10, "docid": "test-society-asfhwapg-con03b", "score": 0.5771176218986511, "is_gold": false, "snippet": "We are happy to put a price on our ideas and knowledge, which are as much building blocks of life as our genes. Each individual already sells his ideas and has a price tag so patenting makes no further devaluation than that which is already there.Even if owner"}], "topK_baseline": [{"rank": 1, "docid": "test-society-asfhwapg-con02a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those "}, {"rank": 2, "docid": "test-society-asfhwapg-pro02b", "score": 0.8157227635383606, "is_gold": false, "snippet": "In the twenty years of a patent’s duration, any prospective research is carried out in fear of recriminations and law-suits from the patent-holder. Laboratories offering patented genetic tests for research studies have been asked to “cease and desist” unless t"}, {"rank": 3, "docid": "test-society-asfhwapg-con02b", "score": 0.8151764273643494, "is_gold": true, "snippet": "Patenting in general is creating more possibilities for patients than if there was no patenting and less competition for development. Even if treatments and diagnostics for some diseases are expensive, they are at least there and are beginning to benefit the p"}, {"rank": 4, "docid": "test-society-asfhwapg-con03b", "score": 0.8106472492218018, "is_gold": false, "snippet": "We are happy to put a price on our ideas and knowledge, which are as much building blocks of life as our genes. Each individual already sells his ideas and has a price tag so patenting makes no further devaluation than that which is already there.Even if owner"}, {"rank": 5, "docid": "test-society-asfhwapg-con01b", "score": 0.8094020485877991, "is_gold": false, "snippet": "Firstly, it is not self-evident, that people have a right to use and possess something, such as medicine that they did not create.So why should people have the right to use a product that someone else discovered through the power of their own cognitive abiliti"}, {"rank": 6, "docid": "test-society-asfhwapg-pro01a", "score": 0.8001664876937866, "is_gold": false, "snippet": "Genes are intellectual property thus patentable  The patenting office stipulates that a successful patent applicant must have found something in nature, isolated it, and found a way to make something useful with it.The genome research of companies satisfies th"}, {"rank": 7, "docid": "test-society-asfhwapg-pro01b", "score": 0.7914475798606873, "is_gold": false, "snippet": "Of course genes should be treated different from any product or other invention; genes are the very basis for human life and to claim that anyone has the right to be regarded as the ‘owner’ of a particular gene, which we all share in our bodies, shows a venal "}, {"rank": 8, "docid": "test-health-dhghwapgd-con02b", "score": 0.7897857427597046, "is_gold": false, "snippet": "If firms are afraid their formulae will be stolen, then they should keep them hidden. Otherwise, they should seek to make their new drug public, benefiting everyone so that the most people possible can have access to them. The release of ideas is most bountifu"}, {"rank": 9, "docid": "test-society-asfhwapg-con01a", "score": 0.789729654788971, "is_gold": false, "snippet": "Patenting drives up the cost of therapies and renders them unaffordable to the poor  The government and its laws should take care of all their people. Because the state is a construct built by all the people, who all pay taxes to support it, laws should also b"}, {"rank": 10, "docid": "test-health-dhghwapgd-con04a", "score": 0.781156063079834, "is_gold": false, "snippet": "Robust drug patent laws incentivize investment of time and money in developing new products  When a real chance of profit exists in the development of a new product or drug, people and firms put the effort into developing and creating them. The incentive to pr"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-hrpepthwuto-pro01a", "query": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much information as possible can be gathered as quickly as possible.  If that requires pain to be inflicted on an individual to save the lives of millions then it is simply practical to do so. The harm represented by the pain caused to a single individual is outweighed by the possibility that information gathered from a forceful interrogation might save thousands of lives", "gold_docid": "test-law-hrpepthwuto-pro01b", "rank_T": 20, "rank_baseline": 4, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-law-hrpepthwuto-pro01a", "score": 0.7487879991531372, "is_gold": false, "snippet": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much inform"}, {"rank": 2, "docid": "test-law-hrpepthwuto-pro03a", "score": 0.561423659324646, "is_gold": false, "snippet": "Time is of the essence in a crisis. When confronted with extremists who see a virtue in their own death, extraordinary methods may be required.  The use of force and fear in enhanced interrogation gives quick results. In the event of a bomb hidden somewhere in"}, {"rank": 3, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.5441539883613586, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 4, "docid": "training-law-hrilthbtsbs-pro04a", "score": 0.5428059101104736, "is_gold": false, "snippet": "Harsh interrogation is not necessarily an effective tool for extracting valuable information.  Harsh interrogation of captives has not been shown to be effective (White, 2007). Those who are prepared to die to advance their cause are unlikely to yield informat"}, {"rank": 5, "docid": "training-free-speech-debate-fchblmdakw-con01b", "score": 0.5257275700569153, "is_gold": false, "snippet": "This might be a valid argument if the leaked military secrets really were putting lives in danger, but this is not the case in this particular instance. In Israel there is a military censor which newspapers submit articles that might affect national security t"}, {"rank": 6, "docid": "training-law-hrilthbtsbs-pro04b", "score": 0.5228459239006042, "is_gold": false, "snippet": "Harsh interrogation is indeed necessary, due in part to the unique efficacy of harsh interrogation in dealing with the new threat. The interrogation of a terrorist is qualitatively different to that of a soldier, due to the nature of terrorist attacks and the "}, {"rank": 7, "docid": "test-philosophy-elkosmj-con02a", "score": 0.5137328505516052, "is_gold": false, "snippet": "We cannot make any judgments about whose life is valuable and whose is not  It is impossible to know what any of the people involved in the situation will do with their life. One might be a serial killer while another might be a life-saving doctor. By attempti"}, {"rank": 8, "docid": "training-free-speech-debate-fchblmdakw-con02b", "score": 0.5003015995025635, "is_gold": false, "snippet": "Anat Kamm did not leak information that could ever result in the destruction of the Israeli state. Her lawyer argued \"It was never her intention to harm the security of the state” and this was accepted by the Israeli state as shown by the plea bargain in which"}, {"rank": 9, "docid": "test-digital-freedoms-efsappgdfp-pro01a", "score": 0.4981728196144104, "is_gold": false, "snippet": "There is no physical risk  In terms of physical risk it is almost certainly true that you have nothing to fear from government having loads of information. With the exception perhaps of the Russian FSB and despite the James Bond films intelligence agencies in "}, {"rank": 10, "docid": "training-law-hrilppthwr-con02b", "score": 0.4885164797306061, "is_gold": false, "snippet": "The necessity of the measures, and the size of the terrorist threat which faces the US, outweighs the possible problems posed in the opposition argument."}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrpepthwuto-pro01a", "score": 1.0, "is_gold": false, "snippet": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much inform"}, {"rank": 2, "docid": "test-law-hrpepthwuto-pro03a", "score": 0.8078463077545166, "is_gold": false, "snippet": "Time is of the essence in a crisis. When confronted with extremists who see a virtue in their own death, extraordinary methods may be required.  The use of force and fear in enhanced interrogation gives quick results. In the event of a bomb hidden somewhere in"}, {"rank": 3, "docid": "training-law-hrilthbtsbs-pro04a", "score": 0.8026490211486816, "is_gold": false, "snippet": "Harsh interrogation is not necessarily an effective tool for extracting valuable information.  Harsh interrogation of captives has not been shown to be effective (White, 2007). Those who are prepared to die to advance their cause are unlikely to yield informat"}, {"rank": 4, "docid": "test-law-hrpepthwuto-pro01b", "score": 0.7952389121055603, "is_gold": true, "snippet": "What about a biological bomb in a small town killing a few thousand. Or a lunatic with an M16 in a village killing fifty? Or preventing a single murder or rape? Anyone attempting to support the resolution must give a clear explanation of the point at which tor"}, {"rank": 5, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.7922273874282837, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 6, "docid": "test-digital-freedoms-efsappgdfp-pro01a", "score": 0.7866580486297607, "is_gold": false, "snippet": "There is no physical risk  In terms of physical risk it is almost certainly true that you have nothing to fear from government having loads of information. With the exception perhaps of the Russian FSB and despite the James Bond films intelligence agencies in "}, {"rank": 7, "docid": "validation-law-lgdgtihbd-con03b", "score": 0.7808679342269897, "is_gold": false, "snippet": "It is better to have some fear and suspicion in society than letting a terrorist attack which costs lives through. Without a domestic intelligence agency we probably would not even know about the 1600 potential terrorists. Now that many of these plots are know"}, {"rank": 8, "docid": "training-health-sshwnasso-pro03b", "score": 0.7785817980766296, "is_gold": false, "snippet": "The option given to the police and victim to not disclose the information undermines the principled claim in Proposition Argument Two that people should be free to determine the importance of the information on their own; this denies them that freedom in some "}, {"rank": 9, "docid": "training-law-hrilthbtsbs-pro04b", "score": 0.7742060422897339, "is_gold": false, "snippet": "Harsh interrogation is indeed necessary, due in part to the unique efficacy of harsh interrogation in dealing with the new threat. The interrogation of a terrorist is qualitatively different to that of a soldier, due to the nature of terrorist attacks and the "}, {"rank": 10, "docid": "validation-law-lgdgtihbd-pro01b", "score": 0.7696391940116882, "is_gold": false, "snippet": "Even if it is protecting lives the scale of the intelligence gathering is undemocratic. By allowing interception, widespread tracking of public records, unfair legal treatment, we erase the trust between citizens and the government in return for very occasiona"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-culture-mmctghwbsa-pro01a", "query": "Sexist advertising is harmful to society, especially women.  Sexist advertising harms women through objectification and diminishing of self-image. The United Nations Convention to Eliminate Discrimination Against Women (CEDAW) links stereotypes about women to prejudice based on gender.1 Through visual and verbal messages women are portrayed as subservient to men. Women are seen increasingly as sex objects and these ads legitimize violence against women.2 Sexist advertising also harms women's self-image by portraying an ideal stylized body.3 The implied message is that consumers should seek to acquire these images even if they are contrary to the reality of body types and features. Eating disorders and obsessive beauty products consumption results in order to attain ideal beauty images presented in the media.4 Sexist ads also harm men through stereotyped images of masculinity.5 1 Object.Org. \"Women not Sex Objects.\" 2011/ August 24 2 Newswise.com. \"Study Find Rise in Sexualized Images of Women.\" 2011/08/10 3 Kilbourne, Jean. \"Beauty... and the Beast of Advertising \"", "gold_docid": "test-culture-mmctghwbsa-pro01b", "rank_T": 18, "rank_baseline": 2, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-culture-mmctghwbsa-pro02b", "score": 0.6383142471313477, "is_gold": false, "snippet": "Bans on sexist advertising will not necessarily solve the harms presented and could instead cause harm to businesses through restricting their ability to compete for audiences and consumers. Gender differences and beliefs about sex existed before advertising. "}, {"rank": 2, "docid": "test-culture-mmctghwbsa-con02b", "score": 0.6295260787010193, "is_gold": false, "snippet": "Although there is a claim that sexist advertising is to difficult to codify, such codes have and are being developed to guide the advertising industry. These standards speak to advertising which demeans the status of women, objectifies them, and plays upon ste"}, {"rank": 3, "docid": "test-culture-mmctghwbsa-con03b", "score": 0.6240212321281433, "is_gold": false, "snippet": "Even though some businesses have responded to public opinion, there are sufficient international commitments which address gender inequality in all societies. The Universal Declaration of Human rights and subsequent conventions have acknowledged the overwhelmi"}, {"rank": 4, "docid": "test-society-mmcpsgfhbf-pro03b", "score": 0.6087123155593872, "is_gold": false, "snippet": "Women may indeed be harmed through these ideals. However, all forms of media, fashion posters, [1] and razors, all carry the same risk of people potentially hurting themselves with it. This is not grounds for a ban.  Furthermore, placing the blame on pornograp"}, {"rank": 5, "docid": "test-culture-mmctghwbsa-pro01a", "score": 0.592208743095398, "is_gold": false, "snippet": "Sexist advertising is harmful to society, especially women.  Sexist advertising harms women through objectification and diminishing of self-image. The United Nations Convention to Eliminate Discrimination Against Women (CEDAW) links stereotypes about women to "}, {"rank": 6, "docid": "test-culture-mthbah-pro04b", "score": 0.5668154358863831, "is_gold": false, "snippet": "The media and celebrity magazines do much more harm, by mocking unattractive or overweight people, and glorifying models who are often dangerously thin. Adverts never criticise people - that would be terrible for the companies behind them. Their aim is to unde"}, {"rank": 7, "docid": "test-culture-mthbah-con03b", "score": 0.5666389465332031, "is_gold": false, "snippet": "Advertisers don't have the good of society in mind when they do their work - they only care about making profit. This means that they regularly advertise unhealthy or harmful things. Fast food adverts are a large part of the reason so many children are obese. "}, {"rank": 8, "docid": "test-culture-mmctghwbsa-con01b", "score": 0.5631052851676941, "is_gold": false, "snippet": "Although business has a compelling self interest to make a profit and advertising is integral to that endeavour, business does not necessarily sacrifice its profit when curbing sexist advertising. If messages are harmonizing with social attitudes, then adverti"}, {"rank": 9, "docid": "test-culture-mmctghwbsa-pro04b", "score": 0.5324503779411316, "is_gold": false, "snippet": "Policies which ban will interfere with business practices, restrict free expression, and be are difficult to standardize. If ads do not sell, they will be rejected and when ads are effective they are likely to continue in pursuit of gaining consumers. Business"}, {"rank": 10, "docid": "test-culture-mthbah-pro03b", "score": 0.5257475972175598, "is_gold": false, "snippet": "Adverts which use very sly methods like subliminal images (images which are shown so quickly the viewer doesn't consciously realise they saw them) are already banned. The other forms of advertising are just companies being creative. There is no difference from"}], "topK_baseline": [{"rank": 1, "docid": "test-culture-mmctghwbsa-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Sexist advertising is harmful to society, especially women.  Sexist advertising harms women through objectification and diminishing of self-image. The United Nations Convention to Eliminate Discrimination Against Women (CEDAW) links stereotypes about women to "}, {"rank": 2, "docid": "test-culture-mmctghwbsa-pro01b", "score": 0.8524229526519775, "is_gold": true, "snippet": "Sexist advertising reflects current social attitudes. Attitudes and perceptions are based on culturally specific values and beliefs. It is difficult to determine a universal definition of harm and sexist advertising to determine if harm occurs. Some studies ha"}, {"rank": 3, "docid": "test-culture-mmctghwbsa-con02b", "score": 0.8469619750976562, "is_gold": false, "snippet": "Although there is a claim that sexist advertising is to difficult to codify, such codes have and are being developed to guide the advertising industry. These standards speak to advertising which demeans the status of women, objectifies them, and plays upon ste"}, {"rank": 4, "docid": "test-culture-mmctghwbsa-con02a", "score": 0.8466173410415649, "is_gold": false, "snippet": "Sexist advertising is subjective so would be too difficult to codify.  Effective advertising appeals to the social, cultural, and personal values of consumers. Through the connection of values to products, services and ideas, advertising is able to accomplish "}, {"rank": 5, "docid": "test-culture-mmctghwbsa-pro02b", "score": 0.8298689126968384, "is_gold": false, "snippet": "Bans on sexist advertising will not necessarily solve the harms presented and could instead cause harm to businesses through restricting their ability to compete for audiences and consumers. Gender differences and beliefs about sex existed before advertising. "}, {"rank": 6, "docid": "test-culture-mmctghwbsa-con01b", "score": 0.8225334882736206, "is_gold": false, "snippet": "Although business has a compelling self interest to make a profit and advertising is integral to that endeavour, business does not necessarily sacrifice its profit when curbing sexist advertising. If messages are harmonizing with social attitudes, then adverti"}, {"rank": 7, "docid": "test-culture-mmctghwbsa-pro02a", "score": 0.8209013342857361, "is_gold": false, "snippet": "Women have a right to be free of stereotyping.  Women's rights to be free from stereotyping, prejudice, discrimination and objectification should be a matter of deep concern as they infringe on human rights related to gender. Advertising messages influence you"}, {"rank": 8, "docid": "test-society-mmcpsgfhbf-pro03b", "score": 0.8111298680305481, "is_gold": false, "snippet": "Women may indeed be harmed through these ideals. However, all forms of media, fashion posters, [1] and razors, all carry the same risk of people potentially hurting themselves with it. This is not grounds for a ban.  Furthermore, placing the blame on pornograp"}, {"rank": 9, "docid": "test-culture-mmctghwbsa-con03b", "score": 0.8079816699028015, "is_gold": false, "snippet": "Even though some businesses have responded to public opinion, there are sufficient international commitments which address gender inequality in all societies. The Universal Declaration of Human rights and subsequent conventions have acknowledged the overwhelmi"}, {"rank": 10, "docid": "test-culture-mmctghwbsa-pro04a", "score": 0.7990562915802002, "is_gold": false, "snippet": "Policies should be established which ban the promotion of sexist attitudes in advertising.  Norway and Denmark have already developed policies to restrict sexist advertising1. In 2008, the UN Committee to Eliminate Discrimination Against Women calls upon state"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-umtlilhotac-pro03a", "query": "Unruly defendants can play up to the cameras  Televising the trial can create extra incentives for defendants to attempt to disrupt the process. During his trial, Saddam Hussein regularly made outbursts and went on political rants – based on Iraqi law, he was able to examine witnesses after his lawyer. This was not new – Slobodan Milosevic tried various antics in front of the (televised) ICTY [1] , and Ratko Mladic used those tactics post-Hussein [2] . Milosevic’s approval ratings grew, and he even won a seat in the Serbian parliament while on trial.  A televised trial creates more of a risk of a political hijacking of the trial – something that has been shown to be a successful tactic by Milosevic. This both potentially damages the successor government by giving those on trial a platform and the court itself.  [1] Scharf, Michael P., Chaos in the Courtroom: Controlling disruptive defendants and contumacious counsel in war crimes trials’, University of Galway  [2] Biles, Peter, ‘Mladic’s courtroom antics’, BBC News, 4 July 2011,", "gold_docid": "test-law-umtlilhotac-pro03b", "rank_T": 17, "rank_baseline": 2, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-law-umtlilhotac-pro03a", "score": 0.6360424160957336, "is_gold": false, "snippet": "Unruly defendants can play up to the cameras  Televising the trial can create extra incentives for defendants to attempt to disrupt the process. During his trial, Saddam Hussein regularly made outbursts and went on political rants – based on Iraqi law, he was "}, {"rank": 2, "docid": "test-law-umtlilhotac-con02b", "score": 0.5522505640983582, "is_gold": false, "snippet": "Few people would actually watch the entirety of the trial proceedings, most would probably just see clips of the footage of news reports; television news coverage of criminal trials can already take place without actual footage.  While televising trials will e"}, {"rank": 3, "docid": "test-law-umtlilhotac-pro01b", "score": 0.5232998132705688, "is_gold": false, "snippet": "Court proceedings themselves aren’t, in general, entertaining. Live broadcasts would largely involve lawyers discussing intricate details of issues, including complex points of law. If there was a real prospect of an ICC trial becoming a matter of entertainmen"}, {"rank": 4, "docid": "test-law-lghwpcctcc-pro02b", "score": 0.521344006061554, "is_gold": false, "snippet": "A stenographer already records every word spoken during the course of the trial, which already serves to help with potential appeals [1] [2] . Furthermore, appeal court judges rarely interfere with the verdicts of lower courts because they were not present at "}, {"rank": 5, "docid": "test-law-lghwpcctcc-con04b", "score": 0.4955023527145386, "is_gold": false, "snippet": "Juror involvement is made less likely by the proposition line that jurors’ faces will be blanked out during the broadcast. For witnesses, the potential to warp and distort the truth already exists; they could be trying to avoid a sentence, or to make sure that"}, {"rank": 6, "docid": "test-law-lghwpcctcc-pro01b", "score": 0.4877598285675049, "is_gold": false, "snippet": "When people take the time and effort to visit the law courts and watch a case, it is a formal, regulated atmosphere. If this were televised, it would become closer to ‘entertainment’ than to fair, legal proceedings. It becomes a human interest story rather tha"}, {"rank": 7, "docid": "training-law-hrilhshsi-pro02b", "score": 0.4843488931655884, "is_gold": false, "snippet": "Many of these so-called “stunts” may actually be legitimate accusations that deserve to be heard in a court. If an accusation is unfounded, charges will not be brought (or not confirmed at the ICC, for example), or a verdict of not guilty returned.  Just becau"}, {"rank": 8, "docid": "test-law-lghwpcctcc-con02b", "score": 0.4840669631958008, "is_gold": false, "snippet": "Withholding video evidence of a court trial will not stop people from automatically siding with the victim and denouncing the accused; it will just stop them from being able to see the body language and other actions which can balance out the media’s assertion"}, {"rank": 9, "docid": "test-law-umtlilhotac-con01b", "score": 0.4635995030403137, "is_gold": false, "snippet": "While there is no jury that could be identified, or influenced, by the broadcast, there is still the other problems attached to televised trials – issues of legitimacy, lawyers and defendants acting up etc."}, {"rank": 10, "docid": "test-law-lghwpcctcc-con01a", "score": 0.4566512703895569, "is_gold": false, "snippet": "This turns court cases into entertainment, rather than legitimate legal proceedings.  Several television shows, such as ‘Judge Judy’, assert the style of a legal courtroom [1] . These shows are based on entertainment value from scrutinising the accused and def"}], "topK_baseline": [{"rank": 1, "docid": "test-law-umtlilhotac-pro03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Unruly defendants can play up to the cameras  Televising the trial can create extra incentives for defendants to attempt to disrupt the process. During his trial, Saddam Hussein regularly made outbursts and went on political rants – based on Iraqi law, he was "}, {"rank": 2, "docid": "test-law-umtlilhotac-pro03b", "score": 0.814974308013916, "is_gold": true, "snippet": "The Hussein trial identified the solution to problematic rants disrupting the trial - the TV feed cut to the judge and faded out Hussein’s sound [1] . This is part of the reason why the ICC broadcasts are on a 30 minute delay, on web and TV access – outbursts,"}, {"rank": 3, "docid": "test-law-umtlilhotac-con02b", "score": 0.7976524233818054, "is_gold": false, "snippet": "Few people would actually watch the entirety of the trial proceedings, most would probably just see clips of the footage of news reports; television news coverage of criminal trials can already take place without actual footage.  While televising trials will e"}, {"rank": 4, "docid": "test-law-lghwpcctcc-con02b", "score": 0.7902879118919373, "is_gold": false, "snippet": "Withholding video evidence of a court trial will not stop people from automatically siding with the victim and denouncing the accused; it will just stop them from being able to see the body language and other actions which can balance out the media’s assertion"}, {"rank": 5, "docid": "test-law-umtlilhotac-pro01a", "score": 0.7849240899085999, "is_gold": false, "snippet": "Televising turns justice into entertainment  Broadcasting trials would be likely to turn the court in to entertainment. The Simpson trial showed how harmful a televised high profile trial can be degenerating into a freak show. The ICC trials are among the most"}, {"rank": 6, "docid": "test-law-lghwpcctcc-pro01b", "score": 0.7791021466255188, "is_gold": false, "snippet": "When people take the time and effort to visit the law courts and watch a case, it is a formal, regulated atmosphere. If this were televised, it would become closer to ‘entertainment’ than to fair, legal proceedings. It becomes a human interest story rather tha"}, {"rank": 7, "docid": "test-law-umtlilhotac-pro01b", "score": 0.7755969166755676, "is_gold": false, "snippet": "Court proceedings themselves aren’t, in general, entertaining. Live broadcasts would largely involve lawyers discussing intricate details of issues, including complex points of law. If there was a real prospect of an ICC trial becoming a matter of entertainmen"}, {"rank": 8, "docid": "test-law-lghwpcctcc-con01a", "score": 0.7740896344184875, "is_gold": false, "snippet": "This turns court cases into entertainment, rather than legitimate legal proceedings.  Several television shows, such as ‘Judge Judy’, assert the style of a legal courtroom [1] . These shows are based on entertainment value from scrutinising the accused and def"}, {"rank": 9, "docid": "test-law-lghwpcctcc-con04a", "score": 0.7674083709716797, "is_gold": false, "snippet": "Witnesses and jurors could easily become involved in the media coverage of the case and place the trial at jeopardy.  Newspaper interviews with witnesses have already caused trials to be cancelled in the past [1] because the judiciary recognises that media cov"}, {"rank": 10, "docid": "training-law-hrilhshsi-pro02b", "score": 0.7659333348274231, "is_gold": false, "snippet": "Many of these so-called “stunts” may actually be legitimate accusations that deserve to be heard in a court. If an accusation is unfounded, charges will not be brought (or not confirmed at the ICC, for example), or a verdict of not guilty returned.  Just becau"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-miasimyhw-pro02a", "query": "Migration is 'developmental'.  Recent reports by the HDR (2009) and WDR (2009) have shown migration is a means of development – free movement has the power to alleviate poverty, enable markets, and connectivity. Taking recent evidence concerning worldwide remittance flows, the developmental nature of free movement is shown.  In 2013, it is estimated, through international migration, $414bn were remitted back to developing countries [1] . Remittance flows into Africa (from within and internationally) accounted for $40bn in 2010, accounting for an increasing percentage of GDP (AfDB, 2013; IFAD, 2013). Northern Africa articulated the largest total of remittances received. Remittances remain beneficial for supporting livelihoods. The influx of remittances to households provides security, an additional income for support, enables household consumption, and investment in alternative assets, such as education and land, of which present crucial benefits in reducing poverty. Although the geography of remittances remains uneven, and currently barriers remain to sending and receiving money, the developmental potential of remittances from African diasporas (both outside and within Africa) is now recognised [2] .  [1] See further readings: World Bank, 2013.  [2] For additional information on the debate of migration, remittances and social development see further readings: De Haas, 2010.", "gold_docid": "test-international-miasimyhw-pro02b", "rank_T": 16, "rank_baseline": 2, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-international-miasimyhw-pro02a", "score": 0.724419355392456, "is_gold": false, "snippet": "Migration is 'developmental'.  Recent reports by the HDR (2009) and WDR (2009) have shown migration is a means of development – free movement has the power to alleviate poverty, enable markets, and connectivity. Taking recent evidence concerning worldwide remi"}, {"rank": 2, "docid": "training-international-ipeegiahw-con04b", "score": 0.5512242913246155, "is_gold": false, "snippet": "Several points require countering. Firstly, the focus on the brain drain suggests air travel will continue to be dominated by an elite class, however, open-skies acts to enable a broader customer base. Secondly, migration brings a range of benefits – we cannot"}, {"rank": 3, "docid": "training-economy-epeghwrar-con03b", "score": 0.5240130424499512, "is_gold": false, "snippet": "While developed countries may be making it more financially attractive to come to them to work and send back remittances in practice they are unlikely to actually allow more immigrants into their countries.  Secondly the brain drain is not all negative for the"}, {"rank": 4, "docid": "test-politics-pgsimhwoia-con03b", "score": 0.514582097530365, "is_gold": false, "snippet": "Part of the payment of aid would be to ensure that migrants can't simply set off in an attempt to get back into a developed country. The aid would fund sufficiently good living conditions to encourage the migrants that staying where they are is a better option"}, {"rank": 5, "docid": "training-economy-epeghwrar-pro03b", "score": 0.5121680498123169, "is_gold": false, "snippet": "Remittances are of course an excellent way of reducing poverty for those who receive them; more broadly however they are unlikely to be successful. Money sent back as remittances are unlikely to be used to target the development needs of the nation so it will "}, {"rank": 6, "docid": "training-economy-epeghwrar-con02b", "score": 0.5062453746795654, "is_gold": false, "snippet": "This is to ignore the influence of remittances on the market. Of course ODA may build a school, but it is just as likely to make something that the donor country believes the recipient needs when it does not in fact need that investment. Money being sent home "}, {"rank": 7, "docid": "test-international-miasimyhw-pro04b", "score": 0.4965786337852478, "is_gold": false, "snippet": "Promoting a free labour market across Africa will exacerbate difficulties for planning. The geography of migration is uneven; and spatial disparities in the proportion of migrants presents challenges for urban and rural planning, which needs to be considered. "}, {"rank": 8, "docid": "test-politics-pgsimhwoia-pro02b", "score": 0.49292367696762085, "is_gold": false, "snippet": "Providing money to developing countries to provide for the migrants they take in does not ensure that the money will be spent on those who it is meant to be spent on. In some developing countries aid is badly spent or is badly affected by corruption; in 2012 t"}, {"rank": 9, "docid": "test-international-miasimyhw-pro01b", "score": 0.49028265476226807, "is_gold": false, "snippet": "The benefits of a free labour market are merely based on an idealistic reality. The CMP has only existed for three years so it is impossible to draw any conclusions. When looking at whether migration enhances productivity questions need to be raised. First, wh"}, {"rank": 10, "docid": "training-economy-epeghwrar-pro02b", "score": 0.48632025718688965, "is_gold": false, "snippet": "The change to remittances may or may not benefit the countries themselves. It is likely that remittances will go directly to individuals. Rwanda may have managed to persuade Rwandans in foreign countries to put money into its sovereign wealth fund but this wil"}], "topK_baseline": [{"rank": 1, "docid": "test-international-miasimyhw-pro02a", "score": 1.0, "is_gold": false, "snippet": "Migration is 'developmental'.  Recent reports by the HDR (2009) and WDR (2009) have shown migration is a means of development – free movement has the power to alleviate poverty, enable markets, and connectivity. Taking recent evidence concerning worldwide remi"}, {"rank": 2, "docid": "test-international-miasimyhw-pro02b", "score": 0.833633303642273, "is_gold": true, "snippet": "Migration results from poverty; poverty will not be solved through migration. Migration is a survival strategy - therefore development initiatives are required first for poverty to be reduced. Three points need to be raised. First, patterns of migration showca"}, {"rank": 3, "docid": "training-economy-epeghwrar-pro03b", "score": 0.8042475581169128, "is_gold": false, "snippet": "Remittances are of course an excellent way of reducing poverty for those who receive them; more broadly however they are unlikely to be successful. Money sent back as remittances are unlikely to be used to target the development needs of the nation so it will "}, {"rank": 4, "docid": "training-economy-epeghwrar-con03b", "score": 0.8013966083526611, "is_gold": false, "snippet": "While developed countries may be making it more financially attractive to come to them to work and send back remittances in practice they are unlikely to actually allow more immigrants into their countries.  Secondly the brain drain is not all negative for the"}, {"rank": 5, "docid": "test-international-miasimyhw-pro05a", "score": 0.7967206835746765, "is_gold": false, "snippet": "The freedom to move is a human right.  Mobility is a human right - which needs to be enabled across national spaces and Africa. Obstacles need to be removed. Mobility enables access to interconnected rights - such as ensuring women their right to move enables "}, {"rank": 6, "docid": "test-politics-pgsimhwoia-con03b", "score": 0.7841082811355591, "is_gold": false, "snippet": "Part of the payment of aid would be to ensure that migrants can't simply set off in an attempt to get back into a developed country. The aid would fund sufficiently good living conditions to encourage the migrants that staying where they are is a better option"}, {"rank": 7, "docid": "test-international-miasimyhw-pro04b", "score": 0.7839015126228333, "is_gold": false, "snippet": "Promoting a free labour market across Africa will exacerbate difficulties for planning. The geography of migration is uneven; and spatial disparities in the proportion of migrants presents challenges for urban and rural planning, which needs to be considered. "}, {"rank": 8, "docid": "test-international-miasimyhw-con01a", "score": 0.7836039066314697, "is_gold": false, "snippet": "Migration reasonings and exploitation.  A free labour market perceives migration in a predominantly neoclassical light - people migrate due to pull factors, to balance the imbalance of jobs, people move due to economic laws. However, such a perspective fails t"}, {"rank": 9, "docid": "training-economy-epeghwrar-pro03a", "score": 0.7813417911529541, "is_gold": false, "snippet": "Remittances reduce poverty  There has been a lot of concern that aid, particularly from governments and international organisations, does not always help reduce poverty; it might simply create dependence, or it prevents local enterprise. Dambisa Moyo points ou"}, {"rank": 10, "docid": "training-economy-epeghwrar-con01a", "score": 0.7772659063339233, "is_gold": false, "snippet": "Money won’t go to where it is needed most.  Aid goes where it is needed, remittances don’t. Development aid is able to be focused on those who need it most, the poorest, those who are unable to grow their own crops etc. Sub-Saharan Africa gets $28bln in ODA or"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-cpilhbishioe-con02a", "query": "An ICC enforcement arm would be unduly expensive  In a climate where the ICC’s budget is determined exclusively by contentious negotiation between states (at a time where the ICC itself has threatened to close down investigations due to a lack of funds [1] ), many of whom are undergoing austerity, an enforcement arm is not the best use of scarce funds when its role can be taken by the state parties. The ICC is already expensive enough – it cost over €100M in 2009.  [1] Nzau Musau, “Kenya: ICC Threatens to Drop cases for Lack of Funds”, The Star (Kenya), 2013,", "gold_docid": "test-law-cpilhbishioe-con02b", "rank_T": 18, "rank_baseline": 4, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-law-cpilhbishioe-con02a", "score": 0.6943750381469727, "is_gold": false, "snippet": "An ICC enforcement arm would be unduly expensive  In a climate where the ICC’s budget is determined exclusively by contentious negotiation between states (at a time where the ICC itself has threatened to close down investigations due to a lack of funds [1] ), "}, {"rank": 2, "docid": "training-international-alilhbassw-con02b", "score": 0.6821577548980713, "is_gold": false, "snippet": "Is justice something to be subjected to simple financial parameters?  Even so, what is the ICC cheaper than? It may be cheaper than individual criminal tribunals like the ICTY and ICTR, but that assumes that such tribunals are desirable. It should be left up t"}, {"rank": 3, "docid": "training-international-alhrilhwca-con04b", "score": 0.5742302536964417, "is_gold": false, "snippet": "Peace is cheaper than war – however much a court case costs, in both human lives and money, it is better for there to be a trial.  Even if it is more expensive, justice is priceless – it is not something that can be subjected to cost-benefit analyses or bean c"}, {"rank": 4, "docid": "training-free-speech-debate-bphwpborfs-con01b", "score": 0.5686737895011902, "is_gold": false, "snippet": "The suggestion that seven million dollars is an excessive expenditure on a resource for 836,000 is extortionate is simply nonsense. That’s a little over eight dollars a head, hardly likely to break the bank. To say that a government is not discouraging the use"}, {"rank": 5, "docid": "test-law-hrilpgwhwr-con01b", "score": 0.5644396543502808, "is_gold": false, "snippet": "The budget of the ICC is not particularly excessive and can be maintained without US finance. The withholding of US funds from the UN budget is a familiar tactic for expressing disapproval. In 1998, the total US arrears on assessed contributions that had been "}, {"rank": 6, "docid": "training-politics-appghwace-con03b", "score": 0.5573099255561829, "is_gold": false, "snippet": "Earmarks may represent relatively small sums in themselves, but they act as a “gateway drug” to more profligate spending. By giving individual Congressmen the gratification of directing small amounts of taxpayers’ money to their own advantage, it makes it more"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-con01a", "score": 0.5369500517845154, "is_gold": false, "snippet": "The ICC generates crippling expenses.  Cautious estimates suggest an operating budget of $100 million per year1. The costs of the ICTY and ICTR have already spiralled out of control, and the latter tribunal has a legacy of maladministration and internal corrup"}, {"rank": 8, "docid": "training-philosophy-oppelhsdp-con02b", "score": 0.5252835154533386, "is_gold": false, "snippet": "Justice is priceless. Even if the death penalty is more expensive than other punishments, that is not sufficient reason to ban it. Fair and proportionate punishments should be independent of financial considerations. Further, there are ways to make the death p"}, {"rank": 9, "docid": "training-law-lgpcphwawtai-con04b", "score": 0.5179281234741211, "is_gold": false, "snippet": "If wiretapping and intercept evidence can stop large-scale conspiracies [1] and potentially stop terrorist actions [2] , as it has done and has the potential to do, then price becomes irrelevant. The price of preventing perhaps hundred of people from being har"}, {"rank": 10, "docid": "training-law-phsdpww-pro02b", "score": 0.5114079713821411, "is_gold": false, "snippet": "The reason why the death penalty is so expensive – 13 executions since 1978 in California costing around $4bn [1] - is the “super due process” that is necessary in capital cases, especially with the large flaws in the US justice system.  Blacker makes no coher"}], "topK_baseline": [{"rank": 1, "docid": "test-law-cpilhbishioe-con02a", "score": 1.0000001192092896, "is_gold": false, "snippet": "An ICC enforcement arm would be unduly expensive  In a climate where the ICC’s budget is determined exclusively by contentious negotiation between states (at a time where the ICC itself has threatened to close down investigations due to a lack of funds [1] ), "}, {"rank": 2, "docid": "test-law-hrilpgwhwr-con01b", "score": 0.8205788731575012, "is_gold": false, "snippet": "The budget of the ICC is not particularly excessive and can be maintained without US finance. The withholding of US funds from the UN budget is a familiar tactic for expressing disapproval. In 1998, the total US arrears on assessed contributions that had been "}, {"rank": 3, "docid": "test-law-cpilhbishioe-con01a", "score": 0.8125357031822205, "is_gold": false, "snippet": "An ICC enforcement arm is unnecessary  To create an enforcement arm for the ICC would be to accept that state parties are incapable of enforcing decisions themselves, that is not necessarily the case. State parties have supplied the ICC with many of the defend"}, {"rank": 4, "docid": "test-law-cpilhbishioe-con02b", "score": 0.8114446401596069, "is_gold": true, "snippet": "What price justice? The ICC has been supported by a large number of states who accept that, while it does cost money, the ICC is the only effective way to bring war criminals and those who commit crimes against humanity to trial, provide them with a fair trial"}, {"rank": 5, "docid": "training-international-alhrilhwca-con04a", "score": 0.8014274835586548, "is_gold": false, "snippet": "An African Criminal Court would be a waste of money  International trials are expensive – 14% of the AU’s annual budget for an ICC trial [1] .  The ICC is cheaper than the cost of the tribunal system – the cost of the Charles Taylor trial was roughly two and a"}, {"rank": 6, "docid": "training-international-alhrilhwca-con04b", "score": 0.7986241579055786, "is_gold": false, "snippet": "Peace is cheaper than war – however much a court case costs, in both human lives and money, it is better for there to be a trial.  Even if it is more expensive, justice is priceless – it is not something that can be subjected to cost-benefit analyses or bean c"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-con01a", "score": 0.7938433885574341, "is_gold": false, "snippet": "The ICC generates crippling expenses.  Cautious estimates suggest an operating budget of $100 million per year1. The costs of the ICTY and ICTR have already spiralled out of control, and the latter tribunal has a legacy of maladministration and internal corrup"}, {"rank": 8, "docid": "training-international-alilhbassw-con02b", "score": 0.7886043190956116, "is_gold": false, "snippet": "Is justice something to be subjected to simple financial parameters?  Even so, what is the ICC cheaper than? It may be cheaper than individual criminal tribunals like the ICTY and ICTR, but that assumes that such tribunals are desirable. It should be left up t"}, {"rank": 9, "docid": "test-law-cpilhbishioe-pro03b", "score": 0.785326361656189, "is_gold": false, "snippet": "An enforcement arm would still have finite resources. There is no guarantee that an ICC in-house enforcement system would arrest more suspects than the existing system of state bilateral co-operation. This is particularly the case in relation to the most thorn"}, {"rank": 10, "docid": "test-law-cpilhbishioe-pro03a", "score": 0.7803385257720947, "is_gold": false, "snippet": "An ICC Enforcement arm would bring in a higher proportion of defendants in to trial  Eight out of the thirty people indicted by the ICC (four in the Darfur situation, including Omar al-Bashir, three Lord’s Resistance Army leaders in Uganda and one in the DR Co"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-ghwcitca-pro03a", "query": "The use of the internet undermines the state by demonopolizing the use of force  Ever since the state rose to ascendancy over powerful internal actors, such as the nobility in a feudal system, the state has had a monopoly on the use of force. The state quickly became the only institution with the resources to maintain military forces and has become the only legitimate wielder of force. The internet however changes this. Cyber-attacks are often by individuals or groups who can carry out a cross border attack without the aid of their home country.  In 2011 CIA director Leon Panetta told Congress “when it comes to national security, I think this represents the battleground for the future. I've often said that I think the potential for the next Pearl Harbor could very well be a cyber-attack.” [1] If cyber-attacks are so important it stands to reason that the groups who are able to engage in such activities should be as limited as possible. While it is not always possible states try to make sure that the weapons of war for the most part remain in the hands of responsible actors. This should apply as much in cyberspace as elsewhere. While terrorist groups do exist – and are occasionally armed by states – for the most part they are seen by every government as being illegitimate.  [1] Serrano, Richard A., ‘U.S. intelligence officials concerned about cyber attack’, Los Angeles Times, 11 February 2011,", "gold_docid": "test-international-ghwcitca-pro03b", "rank_T": 19, "rank_baseline": 5, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-science-wsihwclscaaw-pro01a", "score": 0.5959817171096802, "is_gold": false, "snippet": "Cyber attacks are no different from traditional attacks  The world has developed along with the new digital medium. Lots of crucial business and government services have moved online. While the military modernised in relation to digital developments, a definit"}, {"rank": 2, "docid": "test-international-ghwcitca-pro03a", "score": 0.591334342956543, "is_gold": false, "snippet": "The use of the internet undermines the state by demonopolizing the use of force  Ever since the state rose to ascendancy over powerful internal actors, such as the nobility in a feudal system, the state has had a monopoly on the use of force. The state quickly"}, {"rank": 3, "docid": "test-science-wsihwclscaaw-con02b", "score": 0.5704194903373718, "is_gold": false, "snippet": "It is unlikely that states would freely attack other states when there is unclear evidence as to who the perpetrator was. In any country that is going to engage in military action regardless of the reason there is intense public debate this would apply all the"}, {"rank": 4, "docid": "test-science-wsihwclscaaw-con03b", "score": 0.5683625340461731, "is_gold": false, "snippet": "A definition of aggression in traditional warfare is the act that threatens sovereignty, territorial integrity or political independence of another state [26] – a definition which is expected to be used with cyber attacks too. It is highly unlikely to see a sm"}, {"rank": 5, "docid": "test-international-ghwcitca-con02b", "score": 0.5559052228927612, "is_gold": false, "snippet": "Everyone would benefit from the potential closure of a zone of possible future conflict. While cyber warfare may give a smaller state a brief advantage due to some low cost methods of attack ultimately the superior resources, both in defence and attack in cybe"}, {"rank": 6, "docid": "test-science-wsihwclscaaw-con01b", "score": 0.5378115177154541, "is_gold": false, "snippet": "In case of non-state actors attack, many practitioners in international law agree that the state can still retaliate in self-defence if another state is 'unwilling or unable to take effective action' to deal with attacks coming from within their territory [19]"}, {"rank": 7, "docid": "test-international-ghwcitca-pro04b", "score": 0.5326187610626221, "is_gold": false, "snippet": "It is unlikely that all states would see this as beneficial to them. There will always be some states that benefit more from engaging in cyber-attacks than others – usually the underdog in other areas. If cyber-attacks are an area being used to redress the bal"}, {"rank": 8, "docid": "test-international-ghwcitca-con03b", "score": 0.5253291130065918, "is_gold": false, "snippet": "Clearly cyber-attacks are not currently deadly but this does not mean they will not become so in the future. Leon Panetta has warned “A cyber-attack perpetrated by nation states or violent extremist groups could be as destructive as the terrorist attack of 9/1"}, {"rank": 9, "docid": "test-international-ghwcitca-con03a", "score": 0.5237044095993042, "is_gold": false, "snippet": "Unlike warfare cyber-attacks don’t kill so they don’t need to be restricted in the same way  Warfare needs to be closely regulated because of the numbers of people who can be killed and the devastation that can result. This is not something that is a concern w"}, {"rank": 10, "docid": "training-politics-dwdfiphwut-pro01b", "score": 0.5101632475852966, "is_gold": false, "snippet": "How do we determine what is proportionate? If some valuable intellectual property, such as part of the designs for the US's latest fighter jet the F35, which were hacked in 2009. [1] Then what can be the response to this? Can it simply be the cost of developin"}], "topK_baseline": [{"rank": 1, "docid": "test-international-ghwcitca-pro03a", "score": 1.0, "is_gold": false, "snippet": "The use of the internet undermines the state by demonopolizing the use of force  Ever since the state rose to ascendancy over powerful internal actors, such as the nobility in a feudal system, the state has had a monopoly on the use of force. The state quickly"}, {"rank": 2, "docid": "test-international-ghwcitca-pro04b", "score": 0.8057658672332764, "is_gold": false, "snippet": "It is unlikely that all states would see this as beneficial to them. There will always be some states that benefit more from engaging in cyber-attacks than others – usually the underdog in other areas. If cyber-attacks are an area being used to redress the bal"}, {"rank": 3, "docid": "test-science-wsihwclscaaw-pro03b", "score": 0.8046513795852661, "is_gold": false, "snippet": "While a modification to international law is needed in terms of acknowledging the gravity of cyber attacks, it does not mean that these should be considered acts of war. There are many things that states do that other states do not like and even find harmful, "}, {"rank": 4, "docid": "test-science-wsihwclscaaw-pro01a", "score": 0.7982703447341919, "is_gold": false, "snippet": "Cyber attacks are no different from traditional attacks  The world has developed along with the new digital medium. Lots of crucial business and government services have moved online. While the military modernised in relation to digital developments, a definit"}, {"rank": 5, "docid": "test-international-ghwcitca-pro03b", "score": 0.7964285612106323, "is_gold": true, "snippet": "While it is true that governments for the most part seek to prevent non-state actors that engage in violence we should not assume that the response will be the same for activities that are not violent. The rise of multinational companies has sometimes (particu"}, {"rank": 6, "docid": "test-science-wsihwclscaaw-con01b", "score": 0.7882480621337891, "is_gold": false, "snippet": "In case of non-state actors attack, many practitioners in international law agree that the state can still retaliate in self-defence if another state is 'unwilling or unable to take effective action' to deal with attacks coming from within their territory [19]"}, {"rank": 7, "docid": "test-international-ghwcitca-con02b", "score": 0.7871768474578857, "is_gold": false, "snippet": "Everyone would benefit from the potential closure of a zone of possible future conflict. While cyber warfare may give a smaller state a brief advantage due to some low cost methods of attack ultimately the superior resources, both in defence and attack in cybe"}, {"rank": 8, "docid": "test-science-wsihwclscaaw-con01a", "score": 0.7827801704406738, "is_gold": false, "snippet": "Cyber attacks are often carried out by non-state actors  Cyber attacks are often carried out by non-state actors, such as cyberterrorists or hacktivists (social activists who hack), without any involvement of the actual state. For instance, in 2007 a massive c"}, {"rank": 9, "docid": "test-science-wsihwclscaaw-pro02b", "score": 0.7792183756828308, "is_gold": false, "snippet": "Cyber attacks might be disruptive, but they do not result in destruction, violence, injury and death the same way traditional armed aggressions do. For the majority of businesses and citizens, disruptions to online baking might be very inconvenient, but they a"}, {"rank": 10, "docid": "test-science-wsihwclscaaw-con02b", "score": 0.7777495384216309, "is_gold": false, "snippet": "It is unlikely that states would freely attack other states when there is unclear evidence as to who the perpetrator was. In any country that is going to engage in military action regardless of the reason there is intense public debate this would apply all the"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-gmehwasr-pro04a", "query": "Would balance the support for Syrian government  Syria's government has been receiving outside support from a variety of sources; Russia and Iran being the most prominent. Iran has been training the Jaysh al- Shabi, a Syrian government-controlled force modelled on Iran's Basij militia. Far from just providing weapons, both Iran and Hezbollah from Lebanon have been sending fighters to support the Syrian government. [1] The rebels have received some support for Qatar and Saudi Arabia but not to the extent the Syrian government has. Anyone with an interest in the free Syrian cause should realise that they cannot do so simply by sitting on their hands expecting a victory when those doing the fighting are only provided diplomatic support.  [1] Doran, Michael, and Shaikh, Salman, ‘Arm the Syrian Rebels. Now’. Foreign Policy, 8 February 2013", "gold_docid": "test-international-gmehwasr-pro04b", "rank_T": 19, "rank_baseline": 5, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-international-gmehwasr-pro04a", "score": 0.6670600771903992, "is_gold": false, "snippet": "Would balance the support for Syrian government  Syria's government has been receiving outside support from a variety of sources; Russia and Iran being the most prominent. Iran has been training the Jaysh al- Shabi, a Syrian government-controlled force modelle"}, {"rank": 2, "docid": "training-law-rgmelhrpwhbw-pro02b", "score": 0.5755147337913513, "is_gold": false, "snippet": "Although it is true that Bashar al-Assad has very strong entrenched powers of control in Syria, there are less risky and damaging ways to undermine this to help support the domestic opposition movements if this is your aim. The crux of this case comes down to "}, {"rank": 3, "docid": "test-international-gmehwasr-pro02b", "score": 0.5687806606292725, "is_gold": false, "snippet": "The west has historically not been good at picking the winner in the Middle East; take its backing of Saddam in the 1980, the Shah in the 1970s, or the mujahideen in Afghanistan. All have either lost power or turned on those who supported them. If we back the "}, {"rank": 4, "docid": "training-international-mehbcbiapts-pro03b", "score": 0.5041762590408325, "is_gold": false, "snippet": "Palestinian support for two-state solution declined around 2008, and is waning even among the 'moderate' Palestinian camp, as well as among additional Arab elements.(8) It is also naïve to think that a two-state solution would gain the favour or even support o"}, {"rank": 5, "docid": "training-law-rgmelhrpwhbw-pro02a", "score": 0.5016521215438843, "is_gold": false, "snippet": "Success depends on military intervention.  There is no reasonable chance of success for the opposition movement absent substantial military re-enforcement by the West.  The Syrian government is uniquely placed for several reasons to be able to quell any opposi"}, {"rank": 6, "docid": "test-international-gmehwasr-con01b", "score": 0.49961113929748535, "is_gold": false, "snippet": "This makes the assumption that the Assad government is considered the legitimate authority within Syria, the Russians accept this, but other countries are less sure. Both the US and UK now recognise the Syrian opposition as the legitimate representative of the"}, {"rank": 7, "docid": "test-international-gmehwasr-pro05b", "score": 0.49462515115737915, "is_gold": false, "snippet": "Simply because there is stalemate in diplomacy and on the ground does not make arming the rebels the option that should now be taken, indeed it does not mean that outside powers need to take any action at all. Those with Syria's best interests at heart would r"}, {"rank": 8, "docid": "validation-international-mewhwakapps-pro03a", "score": 0.49206602573394775, "is_gold": false, "snippet": "The Syrian opposition will never be willing to deal with Assad.  As a follow up to the six point plan on the 1st July in Geneva it was agreed that a transitional government would be set up which “could include members of the present government and the oppositi"}, {"rank": 9, "docid": "training-politics-oamepdgtwh-con02a", "score": 0.48138728737831116, "is_gold": false, "snippet": "The west only supports democracies that fit with its world view.  Fincial and diplomatic engagement with the international community is essential for democracy to take hold. Tensions turn to conflict when governments are unable to provide basic services to the"}, {"rank": 10, "docid": "test-international-gmehwasr-con05a", "score": 0.47519710659980774, "is_gold": false, "snippet": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even t"}], "topK_baseline": [{"rank": 1, "docid": "test-international-gmehwasr-pro04a", "score": 1.0, "is_gold": false, "snippet": "Would balance the support for Syrian government  Syria's government has been receiving outside support from a variety of sources; Russia and Iran being the most prominent. Iran has been training the Jaysh al- Shabi, a Syrian government-controlled force modelle"}, {"rank": 2, "docid": "training-law-rgmelhrpwhbw-pro02b", "score": 0.7770959734916687, "is_gold": false, "snippet": "Although it is true that Bashar al-Assad has very strong entrenched powers of control in Syria, there are less risky and damaging ways to undermine this to help support the domestic opposition movements if this is your aim. The crux of this case comes down to "}, {"rank": 3, "docid": "training-law-rgmelhrpwhbw-pro02a", "score": 0.7515851259231567, "is_gold": false, "snippet": "Success depends on military intervention.  There is no reasonable chance of success for the opposition movement absent substantial military re-enforcement by the West.  The Syrian government is uniquely placed for several reasons to be able to quell any opposi"}, {"rank": 4, "docid": "test-international-gmehwasr-pro02b", "score": 0.7489949464797974, "is_gold": false, "snippet": "The west has historically not been good at picking the winner in the Middle East; take its backing of Saddam in the 1980, the Shah in the 1970s, or the mujahideen in Afghanistan. All have either lost power or turned on those who supported them. If we back the "}, {"rank": 5, "docid": "test-international-gmehwasr-pro04b", "score": 0.7458526492118835, "is_gold": true, "snippet": "Balance in this case would not be a good thing as this would simply mean a much longer continuation of a bloody civil war. The longer the conflict continues the more difficult it is to put Syria back together again when peace finally does arrive."}, {"rank": 6, "docid": "test-international-gmehwasr-pro02a", "score": 0.7433974146842957, "is_gold": false, "snippet": "It is in the national interest for democracies to support those seeking to oust dictators  Democracies should support moderate groups seeking to oust dictators because the result will hopefully be a moderate, democratic state. This would then be a reliable par"}, {"rank": 7, "docid": "test-international-gmehwasr-con01b", "score": 0.7377649545669556, "is_gold": false, "snippet": "This makes the assumption that the Assad government is considered the legitimate authority within Syria, the Russians accept this, but other countries are less sure. Both the US and UK now recognise the Syrian opposition as the legitimate representative of the"}, {"rank": 8, "docid": "test-international-gmehwasr-pro05b", "score": 0.7374294400215149, "is_gold": false, "snippet": "Simply because there is stalemate in diplomacy and on the ground does not make arming the rebels the option that should now be taken, indeed it does not mean that outside powers need to take any action at all. Those with Syria's best interests at heart would r"}, {"rank": 9, "docid": "test-international-gmehwasr-con04b", "score": 0.7354739308357239, "is_gold": false, "snippet": "The strategic situation in Syria is nothing like that which meant the US felt it could not withdraw from Vietnam. There is no line of 'dominos' that could be knocked over in a row as a result of a victory by the Syrian government. Far from it, some of Syria's "}, {"rank": 10, "docid": "test-international-gmehwasr-pro03a", "score": 0.7351107597351074, "is_gold": false, "snippet": "The Free Syrian Army is outgunned  The Syrian army is one of the biggest armies in the world; it is nothing like the poorly equipped Libyan army that was beaten by western backed rebels in 2011. The government has aircraft, and helicopters that are used to bom"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-gmehwasr-con03a", "query": "Unforeseeable consequences  We do not know where arming the rebels will lead. The most obvious parallel has to be Afghanistan in the 1980s where the United States armed the mujahideen and succeeded in their objective of damaging the USSR through a war of attrition much as the US had suffered in Vietnam. Afghanistan became an albatross around the Soviet Union’s neck. [1] But the US did not win the peace, Afghanistan descended into civil conflict which had a Taliban victory that sheltered Osama bin Laden; US arms in Afghanistan unintentionally lead more than a decade later to September 11. In this case we would be arming a movement that has many jihadi elements that could end up with the weaponry. Other countries such as Turkey are also worried about where powerful weapons such as anti aircraft missiles could end up if provided to the rebels. They fear they could easily find their way across the border to militant Kurds. [2] Other paths that this could lead to are just as bad; for example helping the Libyan rebels lead to the conflict in Mali. [3] In this case the short term consequences could be just as bad. Arming the Sunnis could provoke retaliation from either Iran or Hezbollah who could feel undermined by the move, in the worst case scenario they could even attack western assets in the area. [4]  [1] Hoffman, David E., The Dead Hand: Reagan, Gorbachev and the Untold Story of the Cold War Arms Race, Icon Books Ltd, 2011, p.211  [2] Hokayem, Emile, in ‘Roundtable: arming the Syrian rebels’, Foreign Policy, 21 February 2013  [3] Jones, Owen, ‘The war in Libya was seen as a success, now here we are engaging with the blowback in Mali’, The Independent, 13 January 2013  [4] Yacoubian, Mona, in ‘Roundtable: arming the Syrian rebels’, Foreign Policy, 21 February 2013", "gold_docid": "test-international-gmehwasr-con03b", "rank_T": 17, "rank_baseline": 4, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-international-gmehwasr-con03a", "score": 0.6333556175231934, "is_gold": false, "snippet": "Unforeseeable consequences  We do not know where arming the rebels will lead. The most obvious parallel has to be Afghanistan in the 1980s where the United States armed the mujahideen and succeeded in their objective of damaging the USSR through a war of attri"}, {"rank": 2, "docid": "test-international-gmehwasr-con04b", "score": 0.5178508758544922, "is_gold": false, "snippet": "The strategic situation in Syria is nothing like that which meant the US felt it could not withdraw from Vietnam. There is no line of 'dominos' that could be knocked over in a row as a result of a victory by the Syrian government. Far from it, some of Syria's "}, {"rank": 3, "docid": "test-international-gmehwasr-con05a", "score": 0.5151163339614868, "is_gold": false, "snippet": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even t"}, {"rank": 4, "docid": "test-international-gmehwasr-con04a", "score": 0.5048503279685974, "is_gold": false, "snippet": "Possibility of being drawn into a long drawn out conflict  Even just providing the rebels with arms risks drawing the powers that supply those arms into the conflict. [1] This is because it gives the intervening power a stake in the conflict. Once weapons have"}, {"rank": 5, "docid": "training-international-amehbncag-pro04b", "score": 0.48019373416900635, "is_gold": false, "snippet": "This is the weakest argument by far. It isn't logical. As all of us who've read about Karl Popper will attest that a historical trend is not an indication of future courses unless causality can be proven. Here it can’t. It’s a different war altogether. Histori"}, {"rank": 6, "docid": "test-international-gmehwasr-pro03b", "score": 0.46166500449180603, "is_gold": false, "snippet": "And what happens to these weapons afterwards? Air defensive systems that can destroy Syrian jets could pose an equal risk to Israeli or western warplanes. While Israel was surprised by Hezbollah's use of anti tank systems that did not stop the Israeli army fro"}, {"rank": 7, "docid": "training-law-hrpthwuuavs-pro04b", "score": 0.4614453911781311, "is_gold": false, "snippet": "Today most forms of conflict do not have much risk to western militaries. While the attacks were carried out from high in the sky NATO did not suffer a single loss in combat operations over Kosovo in 1999. [1] Moreover this lack of danger with UAVs is potentia"}, {"rank": 8, "docid": "test-international-gmehwasr-pro01b", "score": 0.4539218544960022, "is_gold": false, "snippet": "The if the rebels are armed and the regime gets close to losing surely it will simply increase the bloodshed and have greater motive to use its chemical and biological weapons. Therefore arming either side simply increases the potential for killing. A balance "}, {"rank": 9, "docid": "test-politics-eppghwlrba-con02b", "score": 0.4534321427345276, "is_gold": false, "snippet": "The 2nd Amendment of the U.S. Constitution was written in the age of horse and musket, where a private citizen could gain access to the same (or even better) weaponry that the state did.  Unless the opposition want to remove all barriers on gun ownership compl"}, {"rank": 10, "docid": "training-politics-dtwhbnhsa-con02b", "score": 0.4522409737110138, "is_gold": false, "snippet": "There is little reason to believe that the Taliban will succeed in rapidly forcing the Karzai government out of power. The Taliban has been failing to retake the ground they have lost after offensives by NATO forces so even if the Afghan National Army fails to"}], "topK_baseline": [{"rank": 1, "docid": "test-international-gmehwasr-con03a", "score": 1.0, "is_gold": false, "snippet": "Unforeseeable consequences  We do not know where arming the rebels will lead. The most obvious parallel has to be Afghanistan in the 1980s where the United States armed the mujahideen and succeeded in their objective of damaging the USSR through a war of attri"}, {"rank": 2, "docid": "test-international-gmehwasr-con04a", "score": 0.7395057678222656, "is_gold": false, "snippet": "Possibility of being drawn into a long drawn out conflict  Even just providing the rebels with arms risks drawing the powers that supply those arms into the conflict. [1] This is because it gives the intervening power a stake in the conflict. Once weapons have"}, {"rank": 3, "docid": "test-international-gmehwasr-con05a", "score": 0.7359848022460938, "is_gold": false, "snippet": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even t"}, {"rank": 4, "docid": "test-international-gmehwasr-con03b", "score": 0.7238110899925232, "is_gold": true, "snippet": "This is a pointless argument; the consequences of inaction are just unknowable. Doing nothing could lead to exactly the same consequences. Alternatively arming the moderates could speed the end to the civil war and the creation of a democratic state."}, {"rank": 5, "docid": "test-international-gmehwasr-pro05b", "score": 0.7187308669090271, "is_gold": false, "snippet": "Simply because there is stalemate in diplomacy and on the ground does not make arming the rebels the option that should now be taken, indeed it does not mean that outside powers need to take any action at all. Those with Syria's best interests at heart would r"}, {"rank": 6, "docid": "training-international-agpwhouhmp-pro03b", "score": 0.7183710932731628, "is_gold": false, "snippet": "The Pro only identifies US military failures; there are also many occasions of US military success. The Opposition case details examples of military success in Panama, Kuwait, and Bosnia. The recent success of Libyan rebel attempts to overthrow Gaddafi is part"}, {"rank": 7, "docid": "test-international-gmehwasr-pro01b", "score": 0.7170646786689758, "is_gold": false, "snippet": "The if the rebels are armed and the regime gets close to losing surely it will simply increase the bloodshed and have greater motive to use its chemical and biological weapons. Therefore arming either side simply increases the potential for killing. A balance "}, {"rank": 8, "docid": "training-politics-oamepwhbwi-con02a", "score": 0.709222137928009, "is_gold": false, "snippet": "It increased conflict and instability in Libya and its neighbours.  The toppling of Muammar Gaddafi has had unpleasant side effects. Gaddafi’s army involved a large number of mercenaries, many of them Tuaregs from northern Mali. When Gaddafi was overthrown the"}, {"rank": 9, "docid": "test-international-gmehwasr-pro03b", "score": 0.7091396450996399, "is_gold": false, "snippet": "And what happens to these weapons afterwards? Air defensive systems that can destroy Syrian jets could pose an equal risk to Israeli or western warplanes. While Israel was surprised by Hezbollah's use of anti tank systems that did not stop the Israeli army fro"}, {"rank": 10, "docid": "training-international-mesimhbgs-con03b", "score": 0.7072129249572754, "is_gold": false, "snippet": "The effort to fund and arm the rebels has not shown any result, it’s been over 4 years and yet nothing has solved the problem. Rather the situation has got steadily worse with moderate opposition first losing out to Daesh, and then to Assad since Russian air s"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
