{"qid": "test-sport-otshwbe2uuyt-pro01a", "query": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the constitution that occurred after the Orange revolution have been rolled back to give more power to the presidency. [1] Most visibly opponents of the regime such as Yulia Timoshenko have been jailed in politically motivated trials. At the same time there have been attacks on the freedom of the media and Ukraine has fallen down rankings of press freedom in 2010-11 with its score from freedom house falling from 56 to 59 with its ranking falling to 130th. [2]  Ukraine, like its neighbours Russia and Belarus, has become a ‘virtual mafia state’ where the SBU (Ukraine’s successor to the KGB) is all powerful and the elite are unaccountable. [3] It is becoming more and more corrupt as is shown by its fall down the Corruption Perceptions Index from 118th in 2007 to 152nd in 2011. [4] Ukraine is clearly going in the wrong direction and European leaders need to stand up and show that the will not allow this to continue.  [1] Bureau of Democracy, Human Rights, and Labor, ‘2010 Country Reports on Human Rights Practices Report’, U.S. Department of State, 8 April 2011.  [2] Karlekar, Karin Deutsch and Dunham, Jennifer, ‘Press Freedom in 2011: Breakthroughs and Pushback in the Middle East’, Freedom House, 2012, pp.7, 16.  [3] Luzio, Taras, ‘Ukraine, Like Russia, Is Becoming a ‘Virtual Mafia State’’, Atlantic Council, 1 March 2012.  [4] Transparency International, Corruption Perceptions Index 2011 , Transparency International, Corruption Perceptions Index 2007 .", "gold_docid": "test-sport-otshwbe2uuyt-pro01b", "rank_T": 493, "rank_baseline": -1, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-sport-otshwbe2uuyt-pro01a", "score": 0.8502042889595032, "is_gold": false, "snippet": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the co"}, {"rank": 2, "docid": "test-politics-oepghbrnsl-pro01b", "score": 0.677393913269043, "is_gold": false, "snippet": "All periods of transition have been chaotic by definition and reforms are by their nature disruptive. At the same time, it is only through these reforms that a future of freedom and prosperity is possible. While a long transition process can certainly cloud mi"}, {"rank": 3, "docid": "test-politics-oepghbrnsl-pro03a", "score": 0.6508550643920898, "is_gold": false, "snippet": "A strong leader is working in the state’s best interest  Putin’s authoritarian style is not a threat to democracy but rather a requirement for a successful and quicker transition. Having Putin control the media is probably healthier than having it be controlle"}, {"rank": 4, "docid": "training-politics-gvhbtnd-pro01b", "score": 0.6479367017745972, "is_gold": false, "snippet": "Each country should be free to decide which freedoms are important to it and fit with its own culture rather than having to fit into a western straitjacket in order to be considered ‘democratic’. It is true that press freedoms are a difficult issue but it is n"}, {"rank": 5, "docid": "training-international-egilpwhbrh-pro02b", "score": 0.6475246548652649, "is_gold": false, "snippet": "Acting due to a change of government is not the prerogative of another state. Putin is within his rights not to recognise that government and to grant asylum to former president Yanukovych but not to take action within the Ukraine to change the situation.  The"}, {"rank": 6, "docid": "test-politics-oepghbrnsl-con02b", "score": 0.6435994505882263, "is_gold": false, "snippet": "Russia has the attributes of a democracy. It is a federal state with a constitution. It has a two chamber legislature; the lower house is the Duma with 450 members elected from nationwide party lists based upon proportional representation. The Upper house; the"}, {"rank": 7, "docid": "training-law-hrilhwsyh-pro03b", "score": 0.6411154270172119, "is_gold": false, "snippet": "There is little evidence that Yanukovych still has much support anywhere in Ukraine. However an ICC trial could simply inflame the other side; those who have overthrown Yanukovych are likely to want a trial to take place as soon as possible (which may be a lon"}, {"rank": 8, "docid": "training-digital-freedoms-fehwiwcb-pro04b", "score": 0.6357553005218506, "is_gold": false, "snippet": "Whether the West thinks it is being clever by hiding behind the intermediary of private companies and acting as if the software they are creating is not for use in destabilizing undemocratic, or perhaps just unfriendly, regimes, that story will not fly on the "}, {"rank": 9, "docid": "test-politics-oepghbrnsl-pro03b", "score": 0.6322189569473267, "is_gold": false, "snippet": "Putting your hopes and trust in a single person can be fairly dangerous, particularly in a transition period. Putin is not the state and his ability to control and represent the state and the population at large is questionable. Putin is also not a saint and a"}, {"rank": 10, "docid": "test-politics-oepghbrnsl-pro02b", "score": 0.6309296488761902, "is_gold": false, "snippet": "Putin’s initial support was based mainly on strong promises, a series of arrests of corrupt businessmen and tough action towards Chechnya that at first seemed to give positive results. His support base, however, has been significantly damaged following his inc"}], "topK_baseline": [{"rank": 1, "docid": "test-sport-otshwbe2uuyt-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Europe must not give approval to this regime.  Viktor Yanukovych fairly came to power in 2010 however since then he has set about attacking the country’s fragile democracy. There are numerous cases showing this democratic decline. For example changes to the co"}, {"rank": 2, "docid": "test-sport-otshwbe2uuyt-con05a", "score": 0.7670028209686279, "is_gold": false, "snippet": "Europe needs to prevent Russian influence in Ukraine  If Europe shuns Ukraine then Yanukovych has an obvious alternative he can turn to; Russia. Putin, the newly re-elected President of Russia, is holding out the option of a customs union with Ukraine which Ya"}, {"rank": 3, "docid": "training-economy-ecegiehbe-con03b", "score": 0.7663929462432861, "is_gold": false, "snippet": "The EU, in practice, is not a particularly consistent or effective promoter of democracy. It has been unsuccessful in countries such as Ukraine and Georgia in the European neighbourhood (18): this suggests the EU can only lead countries into democracy when the"}, {"rank": 4, "docid": "test-sport-otshwbe2uuyt-pro02a", "score": 0.7621301412582397, "is_gold": false, "snippet": "Boycotting Euro 2012 will highlight Ukraine’s backsliding on human rights  European leaders must take a stand on human rights in their own back yard if they are to be taken seriously on the issue anywhere in the world. There are numerous human rights abuses in"}, {"rank": 5, "docid": "training-international-egilpwhbrh-pro02b", "score": 0.7508441805839539, "is_gold": false, "snippet": "Acting due to a change of government is not the prerogative of another state. Putin is within his rights not to recognise that government and to grant asylum to former president Yanukovych but not to take action within the Ukraine to change the situation.  The"}, {"rank": 6, "docid": "training-law-hrilhwsyh-pro03b", "score": 0.7472614049911499, "is_gold": false, "snippet": "There is little evidence that Yanukovych still has much support anywhere in Ukraine. However an ICC trial could simply inflame the other side; those who have overthrown Yanukovych are likely to want a trial to take place as soon as possible (which may be a lon"}, {"rank": 7, "docid": "test-politics-oepghbrnsl-pro01b", "score": 0.7469629049301147, "is_gold": false, "snippet": "All periods of transition have been chaotic by definition and reforms are by their nature disruptive. At the same time, it is only through these reforms that a future of freedom and prosperity is possible. While a long transition process can certainly cloud mi"}, {"rank": 8, "docid": "test-politics-oepghbrnsl-pro04b", "score": 0.7451327443122864, "is_gold": false, "snippet": "History is not destiny and a highly-selective view of Russia's past should not lead us to prefer authoritarian rule today. The Tsars and their communist successors killed millions of people through brutal rule and failed policies - made possible by the same la"}, {"rank": 9, "docid": "test-politics-oepghbrnsl-pro03a", "score": 0.7420944571495056, "is_gold": false, "snippet": "A strong leader is working in the state’s best interest  Putin’s authoritarian style is not a threat to democracy but rather a requirement for a successful and quicker transition. Having Putin control the media is probably healthier than having it be controlle"}, {"rank": 10, "docid": "training-law-hrilhwsyh-pro04a", "score": 0.7409142255783081, "is_gold": false, "snippet": "The Ukrainian justice system is broken  Justice for Yanukovych should be international simply because it would be a much better guarantor of a fair trial. The Ukrainian justice system is unfortunately corrupt, and at the behest of prosecutors; it has an amazin"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-digital-freedoms-piidfaihbg-con03a", "query": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We require the same when a company wants to operate within our territory: suppose a big Chinese company came to our home country and suddenly started criticizing our domestic policies – these are the policies of the sovereign state whose territory it is, and outsiders have no place to tell it how to run itself. [1]  [1] Nicholas Deleon, TechChrunch, ‘China has every right to be upset with Google right now’, March 23, 2010. URL:  Last consulted: December 22, 2011", "gold_docid": "test-digital-freedoms-piidfaihbg-con03b", "rank_T": 74, "rank_baseline": 4, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-piidfaihbg-con03a", "score": 0.8553049564361572, "is_gold": false, "snippet": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We requi"}, {"rank": 2, "docid": "validation-international-gsidfphb-pro04b", "score": 0.6226505041122437, "is_gold": false, "snippet": "There is no reason for foreign companies to be worried about NSA surveillance. The companies involved such as Google have denied involvement “we have not joined any program that would give the U.S. government—or any other government—direct access to our server"}, {"rank": 3, "docid": "training-economy-egplhbbsa-con03b", "score": 0.6220928430557251, "is_gold": false, "snippet": "Foreign companies simply adapt to the political and economic conditions that exist in different countries. You cannot blame them for high level of corruption, which is the inner problem of the state. Involvement of business representatives in anti-corruption a"}, {"rank": 4, "docid": "training-digital-freedoms-fehbwdsot-con03a", "score": 0.6095007658004761, "is_gold": false, "snippet": "It results in Western companies getting kicked out of the countries, damaging significant Western businesses  Western businesses have been seeking entry into external markets, some of which could well be classified as oppressive. These firms have invested sign"}, {"rank": 5, "docid": "training-free-speech-debate-ifcidffe-pro03b", "score": 0.6081855893135071, "is_gold": false, "snippet": "Corporations are bound to obey the laws of the societies in which they are based, but they are not so constrained in their foreign dealings, in which they are bound instead by foreign laws that are often much more lax. The nature of the international landscape"}, {"rank": 6, "docid": "test-law-sdiflhrdffe-pro03b", "score": 0.6061789989471436, "is_gold": false, "snippet": "This policy will not be a public statement of anything other than Western attempts to interfere in the internal affairs of others. It is also a powerfully hypocritical message; many democracies have libel laws that prevent libel and misrepresentation and autho"}, {"rank": 7, "docid": "validation-international-gsidfphb-pro03b", "score": 0.6017698645591736, "is_gold": false, "snippet": "Most other states accept that there is a large degree of self interest in the United States opposing Russian and Chinese proposals for internet governance, finding out that there is some hypocrisy too is unlikely to sway their votes."}, {"rank": 8, "docid": "training-digital-freedoms-fehbwdsot-con03b", "score": 0.6006641387939453, "is_gold": false, "snippet": "Western companies must be governed by codes of ethics. These should not merely stop at the border of their home state. If they are to be ethical actors they must uphold the freedoms they claim to value. If this means not being able to profit massively in marke"}, {"rank": 9, "docid": "training-digital-freedoms-fehwiwcb-con04b", "score": 0.5891699194908142, "is_gold": false, "snippet": "Engagement will still occur. The software exists to aid in uprisings, which is the endpoint of the regime, or at least a signal of its imminent change. It is a play that Western governments should back on a human as well as political level. The subsidies and i"}, {"rank": 10, "docid": "test-economy-epegiahsc-con01b", "score": 0.5884759426116943, "is_gold": false, "snippet": "Protectionism cannot create a healthy national industry. Only by competing openly against each other on the global market, companies become truly efficient and effective. And small, local companies and industries can often have the advantage in such a confront"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-piidfaihbg-con03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "As a business, Google shouldn’t interfere with domestic politics  Business is business and politics is politics – and the two shouldn’t mingle. When a company wants to operate in a foreign country, it should respect the government and its regulations. We requi"}, {"rank": 2, "docid": "training-digital-freedoms-fehbwdsot-con03a", "score": 0.766703724861145, "is_gold": false, "snippet": "It results in Western companies getting kicked out of the countries, damaging significant Western businesses  Western businesses have been seeking entry into external markets, some of which could well be classified as oppressive. These firms have invested sign"}, {"rank": 3, "docid": "training-free-speech-debate-ifcidffe-pro03a", "score": 0.7522086501121521, "is_gold": false, "snippet": "The right of Western businesses to sell their services abroad can be curtailed when their actions stand counter to the interests of their home governments  Corporations are private entities that have the right to sell their services and to deal with agents for"}, {"rank": 4, "docid": "test-digital-freedoms-piidfaihbg-con03b", "score": 0.743046760559082, "is_gold": true, "snippet": "Google’s business is inseparable from basic human rights  The World Summit on the Information Society (WSIS), a UN conference, affirmed that access to information is a basic human right, a corollary to the freedom of opinion and expression as articulated in Ar"}, {"rank": 5, "docid": "validation-politics-pgvhwlacc-con01a", "score": 0.7371532320976257, "is_gold": false, "snippet": "Corporations are fundamentally different than individuals and have the right to influence politics differently.  The rules under which an individual citizen operate are different from those of corporations and should remain that way. Corporations and individua"}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-con03b", "score": 0.7348177433013916, "is_gold": false, "snippet": "Western companies must be governed by codes of ethics. These should not merely stop at the border of their home state. If they are to be ethical actors they must uphold the freedoms they claim to value. If this means not being able to profit massively in marke"}, {"rank": 7, "docid": "training-free-speech-debate-ifcidffe-pro03b", "score": 0.730466365814209, "is_gold": false, "snippet": "Corporations are bound to obey the laws of the societies in which they are based, but they are not so constrained in their foreign dealings, in which they are bound instead by foreign laws that are often much more lax. The nature of the international landscape"}, {"rank": 8, "docid": "training-economy-egplhbbsa-con03b", "score": 0.7292654514312744, "is_gold": false, "snippet": "Foreign companies simply adapt to the political and economic conditions that exist in different countries. You cannot blame them for high level of corruption, which is the inner problem of the state. Involvement of business representatives in anti-corruption a"}, {"rank": 9, "docid": "test-digital-freedoms-piidfaihbg-pro02a", "score": 0.7291617393493652, "is_gold": false, "snippet": "Not censoring helps Google’s business proposition and corporate identity  Google’s corporate motto is ‘don’t be evil’. This is partly an issue of corporate identity, and partly a clever business proposition. In both cases, complying with Chinese censorship rul"}, {"rank": 10, "docid": "validation-international-gsidfphb-pro04b", "score": 0.7267928123474121, "is_gold": false, "snippet": "There is no reason for foreign companies to be worried about NSA surveillance. The companies involved such as Google have denied involvement “we have not joined any program that would give the U.S. government—or any other government—direct access to our server"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-gsciidffe-pro04a", "query": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this right then it is legitimate for other countries to step in to act as an enabler of those rights. By circumventing censorship so the freedom of expression is returned to those that have had their voice stripped from them. Doing this costs the state that is acting almost nothing; thus Britain’s Foreign Office is devoting a mere £1.5million to promoting expression online, [1] and yet the benefits for those who it helps can be considerable by helping them to publicise and organise themselves by providing a platform. The small cost should be compared to the benefit of keeping activists one step ahead of the authorities by, for example providing software that helps make sure online communication is anonymous, which can save lives.  [1] “William Hague promises £1.5m to promote freedom of expression online”, BBC News, 30 April 2012,", "gold_docid": "test-international-gsciidffe-pro04b", "rank_T": 25, "rank_baseline": 3, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-international-gsciidffe-pro04a", "score": 0.8430806398391724, "is_gold": false, "snippet": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this"}, {"rank": 2, "docid": "test-international-gsciidffe-con03b", "score": 0.7097554206848145, "is_gold": false, "snippet": "If a regime is so intolerant as to threaten its citizens for using lines of communication that have been opened by another country then that country is clearly in need of greater openness towards freedom of expression and information. This is something that un"}, {"rank": 3, "docid": "test-digital-freedoms-aihbiahr-pro03b", "score": 0.6995555758476257, "is_gold": false, "snippet": "This is taking the freedom of expression too far. A freedom to impart information does not mean the freedom to impart it through whatever medium the individual wishes simply through a method of communication. It is also taking it too far to consider that the g"}, {"rank": 4, "docid": "training-digital-freedoms-fehbwdsot-pro03b", "score": 0.6909986734390259, "is_gold": false, "snippet": "As with all messages this will not make a “clear and emphatic statement about free speech” rather it will be a message that is muddied by hypocrisy. Autocratic ‘repressive’ regimes are not the only states to enable some form of censorship on the internet. Brit"}, {"rank": 5, "docid": "test-philosophy-pphbclsbs-pro03b", "score": 0.6893044710159302, "is_gold": false, "snippet": "The opposition does not except the importance of legalisation like the US Patriot Act, as such legislation is always used for aims it was not originally intended for example when it is being used to investigate media companies dedicated to free speech - Wikile"}, {"rank": 6, "docid": "test-international-gsciidffe-pro03b", "score": 0.6877013444900513, "is_gold": false, "snippet": "The public are rarely interested in foreign policy and want to keep well clear of foreign entanglements; they may like the idea of promoting democracy but if it means anything more than simple public support then they shy away as shown by only around 20-30% co"}, {"rank": 7, "docid": "training-digital-freedoms-fehwufafra-pro03b", "score": 0.686015248298645, "is_gold": false, "snippet": "Funding such technologies is unlikely to result in large benefits or will result in escalating costs. China has billions invested in its online censorship activities. Any attempt to fund ways to counter this censorship would likely become involved in an online"}, {"rank": 8, "docid": "test-international-gsciidffe-pro02b", "score": 0.6852468252182007, "is_gold": false, "snippet": "It is not up to outside powers to decide what is and what is not in the interest of any peoples but their own. While those attempting to circumvent censorship may see themselves as promoting some kind of universal human rights in practice they are pushing thei"}, {"rank": 9, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.6834354996681213, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 10, "docid": "test-free-speech-debate-nshbcsbawc-pro04a", "score": 0.6805015206336975, "is_gold": false, "snippet": "Freedom of expression, like any right is fairly meaningless if it’s only respected when it’s convenient.  Recognising rights when there is no inconvenience to anybody involved is verging on the irrelevant. This is, perhaps, especially true, with freedom of exp"}], "topK_baseline": [{"rank": 1, "docid": "test-international-gsciidffe-pro04a", "score": 1.0, "is_gold": false, "snippet": "It is legitimate to enable freedom  Circumventing censorship is a cost effective method of promoting freedom. When a country has refused to recognise the right to freedom of expression of its own people and indeed is actively stopping them from exercising this"}, {"rank": 2, "docid": "test-international-gsciidffe-con03b", "score": 0.7995927929878235, "is_gold": false, "snippet": "If a regime is so intolerant as to threaten its citizens for using lines of communication that have been opened by another country then that country is clearly in need of greater openness towards freedom of expression and information. This is something that un"}, {"rank": 3, "docid": "test-international-gsciidffe-pro04b", "score": 0.7939110398292542, "is_gold": true, "snippet": "As foreign states are not the legitimate representative of the people it is not legitimate for them to set themselves up as the arbiter for those whom it believes are being deprived of rights. These states that are meddling in the affairs of others cannot know"}, {"rank": 4, "docid": "test-international-gsciidffe-con03a", "score": 0.7934615612030029, "is_gold": false, "snippet": "This policy is not necessary and may be counterproductive  Unless a state wishes to pull the plug on the internet entirely state censorship on the internet is never complete. Dissidents and those who are interested in getting around censorship will manage with"}, {"rank": 5, "docid": "training-digital-freedoms-fehwufafra-pro03b", "score": 0.7901504039764404, "is_gold": false, "snippet": "Funding such technologies is unlikely to result in large benefits or will result in escalating costs. China has billions invested in its online censorship activities. Any attempt to fund ways to counter this censorship would likely become involved in an online"}, {"rank": 6, "docid": "test-international-gsciidffe-con02a", "score": 0.7872042059898376, "is_gold": false, "snippet": "Governments enable censorship to protect their citizens  What censorship is it legitimate to undermine? Censorship is often created in order to protect the people not to strip them of freedoms. This is most obvious when we consider that filters to prevent hate"}, {"rank": 7, "docid": "training-digital-freedoms-fehwufafra-con03a", "score": 0.7869392037391663, "is_gold": false, "snippet": "Evading censorship is already possible and censorship does not prevent the use of the internet.  Proposition itself concedes that authoritarian states in the vast majority of cases are unlikely to cut off access to the internet for their population entirely. F"}, {"rank": 8, "docid": "training-digital-freedoms-fehbwdsot-pro03b", "score": 0.7844862341880798, "is_gold": false, "snippet": "As with all messages this will not make a “clear and emphatic statement about free speech” rather it will be a message that is muddied by hypocrisy. Autocratic ‘repressive’ regimes are not the only states to enable some form of censorship on the internet. Brit"}, {"rank": 9, "docid": "test-international-gsciidffe-pro03b", "score": 0.783941388130188, "is_gold": false, "snippet": "The public are rarely interested in foreign policy and want to keep well clear of foreign entanglements; they may like the idea of promoting democracy but if it means anything more than simple public support then they shy away as shown by only around 20-30% co"}, {"rank": 10, "docid": "training-digital-freedoms-aihbied-con01a", "score": 0.7820180654525757, "is_gold": false, "snippet": "The internet can be successfully censored so that it only promotes pro-regime propaganda.  The internet is said to promote democracy based on the claim that it leads to the free flow of information. Unfortunately, this is false in many parts of the world. 40 c"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-hrpepthwuto-con02a", "query": "Introducing the use of violence into the justice system means that liberties that have taken centuries to secure are lost  The principle that all people are presumed innocent and, as a result, should not be abused either physically or mentally by officers of the state is one that took centuries- not to mention a great deal of blood and sweat- to establish. In the words of British Chief Justice Phillips this respect for human rights is, in and of itself, “a vital part in the fight against terror”, as if terrorism is to be defeated states that ascribe to such principles must show that they remain true to them in order to win the ideological battle.  Using torture on suspected terrorist would be to tear apart that basic principle in response to crimes, which, it has been noted, are on nothing like the scale of the industrialised warfare of the twentieth century, would be a massively damaging step. Regardless of the scale of the crime the individual must have protections against false accusation and punishment, this means that a fair trial is necessary in order to determine innocence or guilt.", "gold_docid": "test-law-hrpepthwuto-con02b", "rank_T": 20, "rank_baseline": 4, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-law-hrpepthwuto-con02a", "score": 0.8623708486557007, "is_gold": false, "snippet": "Introducing the use of violence into the justice system means that liberties that have taken centuries to secure are lost  The principle that all people are presumed innocent and, as a result, should not be abused either physically or mentally by officers of t"}, {"rank": 2, "docid": "test-law-hrpepthwuto-pro02b", "score": 0.7104889154434204, "is_gold": false, "snippet": "When battling those who would seek to replace the rule of law and democratic governance with religious decree, it is more important than ever to demonstrate that the principles of a civilised society are paramount.  In the light of that reality, for the state "}, {"rank": 3, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.697238564491272, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 4, "docid": "test-law-hrpepthwuto-con03b", "score": 0.6963344216346741, "is_gold": false, "snippet": "No amount of legal niceties would bring any comfort to the families of those slaughtered in terrorist atrocities around the world. When you are fighting an enemy that has no time for the European Convention on Human Rights, the US Bill of Rights, English commo"}, {"rank": 5, "docid": "test-philosophy-pphbclsbs-pro02a", "score": 0.6858300566673279, "is_gold": false, "snippet": "The apparent loss of liberty is overstated.  Negative cases of security abuse are few and have been greatly exaggerated by an emphatic civil rights lobby that has no empathy for the victims of terrorism. Of course, with any wide-scale attempt to fight terroris"}, {"rank": 6, "docid": "test-philosophy-pphbclsbs-con05a", "score": 0.6842043399810791, "is_gold": false, "snippet": "In the public’s eyes, the government seems to suspect everyone.  Although the anti-terrorist measures are supposed to be trying to catch certain people, it is the whole of the public who have to suffer on a daily basis: an abundance of security cameras, securi"}, {"rank": 7, "docid": "training-free-speech-debate-fchbdeonl-con03b", "score": 0.6788239479064941, "is_gold": false, "snippet": "It is an interesting argument to suggest that the suppression of Mehanna’s rights is okay because it has not been as sweeping as the generalised internment of Japanese Americans or the insanity of the McCarthy trials. Op is basically arguing, “Look, it could h"}, {"rank": 8, "docid": "test-society-tsmihwurpp-pro01b", "score": 0.6780076622962952, "is_gold": false, "snippet": "The presumption of innocence is a principle worth defending and an important part of this is rejecting policing strategies that assume certain groups are more likely to be engage in criminal activity than others. In the last ten years, a few dozen people, at m"}, {"rank": 9, "docid": "training-law-hrilthbtsbs-con03b", "score": 0.677367627620697, "is_gold": false, "snippet": "Special interrogation methods are not necessary to combat the terrorist threat. It is always easy to imagine extra lengths that states could conceivably go to in order to protect their soldiers or civilians. However the ambition of the Geneva Conventions in th"}, {"rank": 10, "docid": "validation-law-hrilphwcgbd-con03b", "score": 0.6746847629547119, "is_gold": false, "snippet": "The fact that the majority of detainees may be guilty of terror-related crimes or attacks doesn't justify the continued detention of those who were clearly detained under mistaken information, and who will only be cleared through trial in a civilian court. Oth"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrpepthwuto-con02a", "score": 0.9999997615814209, "is_gold": false, "snippet": "Introducing the use of violence into the justice system means that liberties that have taken centuries to secure are lost  The principle that all people are presumed innocent and, as a result, should not be abused either physically or mentally by officers of t"}, {"rank": 2, "docid": "test-law-hrpepthwuto-con03b", "score": 0.8373543620109558, "is_gold": false, "snippet": "No amount of legal niceties would bring any comfort to the families of those slaughtered in terrorist atrocities around the world. When you are fighting an enemy that has no time for the European Convention on Human Rights, the US Bill of Rights, English commo"}, {"rank": 3, "docid": "test-law-hrpepthwuto-pro02b", "score": 0.8218958377838135, "is_gold": false, "snippet": "When battling those who would seek to replace the rule of law and democratic governance with religious decree, it is more important than ever to demonstrate that the principles of a civilised society are paramount.  In the light of that reality, for the state "}, {"rank": 4, "docid": "test-law-hrpepthwuto-con02b", "score": 0.8031669855117798, "is_gold": true, "snippet": "The era of battlefield warfare has passed. The war on terror may be a new form of combat, but the results are no less serious. Were a terrorist flying a military bomber aircraft to deliver a payload of death and destruction on one of the world’s major cities, "}, {"rank": 5, "docid": "test-philosophy-pphbclsbs-pro02a", "score": 0.8019605875015259, "is_gold": false, "snippet": "The apparent loss of liberty is overstated.  Negative cases of security abuse are few and have been greatly exaggerated by an emphatic civil rights lobby that has no empathy for the victims of terrorism. Of course, with any wide-scale attempt to fight terroris"}, {"rank": 6, "docid": "test-philosophy-pphbclsbs-pro01b", "score": 0.7982733249664307, "is_gold": false, "snippet": "Nothing justifies some of the security measures taken by western governments. The ancient western conventions of the accused being innocent until proven guilty and his right to a fair trial have both been undermined [1] by the recent Labour administration in t"}, {"rank": 7, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.7936854362487793, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 8, "docid": "test-society-tsmihwurpp-pro01b", "score": 0.7917306423187256, "is_gold": false, "snippet": "The presumption of innocence is a principle worth defending and an important part of this is rejecting policing strategies that assume certain groups are more likely to be engage in criminal activity than others. In the last ten years, a few dozen people, at m"}, {"rank": 9, "docid": "test-law-hrpepthwuto-pro01b", "score": 0.7915181517601013, "is_gold": false, "snippet": "What about a biological bomb in a small town killing a few thousand. Or a lunatic with an M16 in a village killing fifty? Or preventing a single murder or rape? Anyone attempting to support the resolution must give a clear explanation of the point at which tor"}, {"rank": 10, "docid": "training-law-hrilthbtsbs-con02b", "score": 0.7907633781433105, "is_gold": false, "snippet": "Treating terrorists with respect for their human rights allows those fighting the war on terror to take the moral high ground. By failing to comply with the Geneva Conventions, countries such as the USA are no better than the terrorist groups that they are fig"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-economy-eptpghdtre-con01a", "query": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cuts were responsible for the creation of 6.6 million jobs, primarily in the private sector – real jobs producing real goods and providing real services not tax-payer funded sinecures to mask the reality of the economic situation. [i]  [i] The White House, “Fact Sheet: Job Creation Continues – More than 6.6 Million Jobs Created Since August 2003”, 6 October 2006,", "gold_docid": "test-economy-eptpghdtre-con01b", "rank_T": 17, "rank_baseline": 5, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-economy-eptpghdtre-con01a", "score": 0.862966001033783, "is_gold": false, "snippet": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cu"}, {"rank": 2, "docid": "test-economy-eptpghdtre-pro02b", "score": 0.6957669258117676, "is_gold": false, "snippet": "The reason for the apparent superiority of Democrat administrations is that they use government as a job creation service; using taxpayers’ money to create jobs in a bloated federal administration [i] .  Ultimately, these are not real jobs as they are not actu"}, {"rank": 3, "docid": "test-economy-thsptr-pro05b", "score": 0.6608158349990845, "is_gold": false, "snippet": "Progressive taxation does not improve economic growth. This is because, when the rich are heavily taxed, they have less likely to invest in new enterprises. Higher taxes serve as a disincentive to investment, both domestic and foreign. As to economic growth in"}, {"rank": 4, "docid": "training-economy-epehwpaja-con03b", "score": 0.6431829333305359, "is_gold": false, "snippet": "Whilst successful individuals may be confronted with an increased tax bill, the American Jobs Act also significantly reduces taxes on businesses. This is especially important with respect to innovative risk as it is businesses, not individuals, which bear the "}, {"rank": 5, "docid": "training-philosophy-ppphwrbtcw-con02b", "score": 0.6249910593032837, "is_gold": false, "snippet": "Firstly, the harm to small business from such tax cuts could easily be mitigated by providing some measure of exception for small business owners. The U.S. already provides subsidies for small businesses that show signs of innovation and as such it seems logic"}, {"rank": 6, "docid": "training-economy-tpvovrsugcsc-pro02b", "score": 0.6241233348846436, "is_gold": false, "snippet": "Raising taxes for individuals with income over $250,000 will have a hugely detrimental outcome. This is because a huge number of small businesses are legally taxed as individuals. Raising taxes may be manageable for wealthy individuals, but small firms will be"}, {"rank": 7, "docid": "training-philosophy-ppphwrbtcw-con01b", "score": 0.6173425912857056, "is_gold": false, "snippet": "As mentioned, tax cuts for the rich offer the least direct stimulus owing to the small percentage of their income that the wealthiest Americans spend on consumption. Often what is taxed is money that simply sits in bank accounts accruing interest. Given, then,"}, {"rank": 8, "docid": "training-philosophy-ppphwrbtcw-pro01b", "score": 0.6144380569458008, "is_gold": false, "snippet": "Under current economic circumstances, the deficit is bad, and a downgrade of the credit rating has bad effects. However, stimulation of the economy during a recession is needed more.  If the economy is stimulated through lower taxes, it might cause it to recov"}, {"rank": 9, "docid": "test-economy-eptpghdtre-pro02a", "score": 0.610388994216919, "is_gold": false, "snippet": "Historically Democrats have presided over more economic stability whereas the GOP is the party of boom and Bust  During the past 60 years Democrats have been considerably more likely to preside over a balanced budget than their Republican rivals. Since the OPE"}, {"rank": 10, "docid": "test-economy-eptpghdtre-pro03a", "score": 0.6020532846450806, "is_gold": false, "snippet": "Democrats focus on increasing wages, creating better consumers.  Quality customers can only be created by paying people enough to allow them to purchase goods and services. You can create as many jobs as you like but if they’re created at a level where consume"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-eptpghdtre-con01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Republicans are the best at stimulating economic growth  The tax cuts proposed by President Bush and passed by a Republican Congress ensured that real, after-tax income was up 15% by 2006. The Dow Jones hit record Highs during his time in office.  These tax cu"}, {"rank": 2, "docid": "test-economy-eptpghdtre-pro02b", "score": 0.7449523210525513, "is_gold": false, "snippet": "The reason for the apparent superiority of Democrat administrations is that they use government as a job creation service; using taxpayers’ money to create jobs in a bloated federal administration [i] .  Ultimately, these are not real jobs as they are not actu"}, {"rank": 3, "docid": "test-economy-thsptr-pro05b", "score": 0.7348541021347046, "is_gold": false, "snippet": "Progressive taxation does not improve economic growth. This is because, when the rich are heavily taxed, they have less likely to invest in new enterprises. Higher taxes serve as a disincentive to investment, both domestic and foreign. As to economic growth in"}, {"rank": 4, "docid": "training-economy-epfthwpebd-pro03a", "score": 0.7342638969421387, "is_gold": false, "snippet": "Many of the reasons for operating a debt have now been eliminated  At the end of the Clinton presidency the government was running at a healthy surplus following the longest sustained period of growth in US history. Bush Chose to spend that on tax cuts and two"}, {"rank": 5, "docid": "test-economy-eptpghdtre-con01b", "score": 0.7327703833580017, "is_gold": true, "snippet": "George Bush announced that cutting government was one of his greatest priorities, his actions could not have been further from this ambition. As with most Republican presidents, government spending grew considerably on his watch. Indeed no president since FDR "}, {"rank": 6, "docid": "training-economy-tpvovrsugcsc-con02a", "score": 0.7276659607887268, "is_gold": false, "snippet": "Tax cuts and spending cuts are necessary for growth.  With a national unemployment rate of 8.1% as of September 2012 [1], the United States economy has not recovered from the global financial crisis of 2008 and the recession that followed it. Governor Mitt Rom"}, {"rank": 7, "docid": "training-economy-epehwpaja-pro03a", "score": 0.7257779240608215, "is_gold": false, "snippet": "The American Jobs Act Helps Small Business and Creates Jobs  The American Jobs Act helps small businesses and is also set to significantly increase the number of jobs available to people. Small enterprise is particularly important in the creation of jobs becau"}, {"rank": 8, "docid": "training-economy-epehwpaja-con03b", "score": 0.7232807874679565, "is_gold": false, "snippet": "Whilst successful individuals may be confronted with an increased tax bill, the American Jobs Act also significantly reduces taxes on businesses. This is especially important with respect to innovative risk as it is businesses, not individuals, which bear the "}, {"rank": 9, "docid": "training-economy-egppgghwgo-pro02b", "score": 0.7213156223297119, "is_gold": false, "snippet": "President Bush took a series of extremely difficult decisions that were necessary for national security. Admittedly they were expensive but they made the world a safer place. His decisions on taxation ensured that all Americans benefitted from economic growth."}, {"rank": 10, "docid": "training-economy-epehwpaja-con03a", "score": 0.7194451093673706, "is_gold": false, "snippet": "The American Jobs Act Will Not Help Successful Businesses  While the American Jobs Act gives help to small businesses it does nothing to help proven companies that already have a record of success as is shown by their size. Indeed these companies may even be h"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-philosophy-pphbclsbs-con02a", "query": "The loss of individual liberty is the start of a slippery slope.  The proposition puts us in a dangerous place. That situation is the thin edge of a totalitarian wedge – we must take a principled stand for liberty and stop the increasing number of anti-terrorist legislation and over powerful policing powers. Many evil events in history started with good intentions and few cases of injustice. Allowing even a few abuses as an acceptable side effect of improved security will change the tolerance level of the public and lead to a belief that rights such as the presumption of innocence and habeas corpus (which prevents the state from imprisoning someone without charging them with a crime and then trying them) are a negotiable luxury. Furthermore, abuses of the system are likely to victimise certain minority groups (e.g. Muslims, Arab-Americans) in the same way that Japanese-Americans and many other groups were persecuted in World War II, [1] something about which Americans are now rightly ashamed.  [1] Hummel, Jeffrey Rogers, ‘Not Just Japanese Americans: The Untold Story of U.S. Repression During 'The Good War'’, The Journal of Historical Review, Fall 1987 (Vol. 7, No. 3),  , accessed 9 September 2011", "gold_docid": "test-philosophy-pphbclsbs-con02b", "rank_T": 17, "rank_baseline": 5, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-philosophy-pphbclsbs-con02a", "score": 0.8650985360145569, "is_gold": false, "snippet": "The loss of individual liberty is the start of a slippery slope.  The proposition puts us in a dangerous place. That situation is the thin edge of a totalitarian wedge – we must take a principled stand for liberty and stop the increasing number of anti-terrori"}, {"rank": 2, "docid": "test-philosophy-pphbclsbs-pro01b", "score": 0.7312208414077759, "is_gold": false, "snippet": "Nothing justifies some of the security measures taken by western governments. The ancient western conventions of the accused being innocent until proven guilty and his right to a fair trial have both been undermined [1] by the recent Labour administration in t"}, {"rank": 3, "docid": "test-philosophy-pphbclsbs-pro02a", "score": 0.7245916724205017, "is_gold": false, "snippet": "The apparent loss of liberty is overstated.  Negative cases of security abuse are few and have been greatly exaggerated by an emphatic civil rights lobby that has no empathy for the victims of terrorism. Of course, with any wide-scale attempt to fight terroris"}, {"rank": 4, "docid": "training-law-hrilppthwr-pro02b", "score": 0.7103102803230286, "is_gold": false, "snippet": "Via legal precedent, [1] Habeas Corpus protections extend to foreign nationals detained in the US. Furthermore, to focus solely on the immigration status and purported guilt of suspected terrorists ignore the fact that Habeas Corpus exists to protect us all. E"}, {"rank": 5, "docid": "validation-law-lghrilthwdt-con04b", "score": 0.6979923844337463, "is_gold": false, "snippet": "It is essential to reach an appropriate balance of rights and freedoms. Everyone recognises the importance of protecting rights and liberties, but this cannot be done at any cost. There is a wider duty on politicians to protect society from harm, and their vot"}, {"rank": 6, "docid": "training-free-speech-debate-fchbdeonl-con03b", "score": 0.697333037853241, "is_gold": false, "snippet": "It is an interesting argument to suggest that the suppression of Mehanna’s rights is okay because it has not been as sweeping as the generalised internment of Japanese Americans or the insanity of the McCarthy trials. Op is basically arguing, “Look, it could h"}, {"rank": 7, "docid": "test-philosophy-pphbclsbs-pro03b", "score": 0.6959879398345947, "is_gold": false, "snippet": "The opposition does not except the importance of legalisation like the US Patriot Act, as such legislation is always used for aims it was not originally intended for example when it is being used to investigate media companies dedicated to free speech - Wikile"}, {"rank": 8, "docid": "training-health-sshwnasso-pro04b", "score": 0.6755797863006592, "is_gold": false, "snippet": "Freedom is not an absolute good; only something that typically advances overall utility, as we understand that people are normally better placed to maximise their utility, being the only ones with knowledge of their desires and values. This, however, is not su"}, {"rank": 9, "docid": "test-philosophy-pphbclsbs-pro02b", "score": 0.6726446151733398, "is_gold": false, "snippet": "If there is even a slight injustice, then there is a problem worth addressing. It is a fact that recent anti-terrorism legislation, in nearly all western countries, has been used for a variety of uses from international banking [1] to petty thievery. This is o"}, {"rank": 10, "docid": "test-philosophy-pphbclsbs-pro03a", "score": 0.6714923977851868, "is_gold": false, "snippet": "Western countries already benefit from extremely liberal laws.  The USA is at present far better than most countries in their respect and regard for civil liberties. New security measures do not greatly compromise this liberty, and the US measures are at the v"}], "topK_baseline": [{"rank": 1, "docid": "test-philosophy-pphbclsbs-con02a", "score": 0.9999998807907104, "is_gold": false, "snippet": "The loss of individual liberty is the start of a slippery slope.  The proposition puts us in a dangerous place. That situation is the thin edge of a totalitarian wedge – we must take a principled stand for liberty and stop the increasing number of anti-terrori"}, {"rank": 2, "docid": "test-philosophy-pphbclsbs-pro02a", "score": 0.8320612907409668, "is_gold": false, "snippet": "The apparent loss of liberty is overstated.  Negative cases of security abuse are few and have been greatly exaggerated by an emphatic civil rights lobby that has no empathy for the victims of terrorism. Of course, with any wide-scale attempt to fight terroris"}, {"rank": 3, "docid": "test-philosophy-pphbclsbs-pro01b", "score": 0.8251323103904724, "is_gold": false, "snippet": "Nothing justifies some of the security measures taken by western governments. The ancient western conventions of the accused being innocent until proven guilty and his right to a fair trial have both been undermined [1] by the recent Labour administration in t"}, {"rank": 4, "docid": "validation-law-lghrilthwdt-con01a", "score": 0.8027945756912231, "is_gold": false, "snippet": "Internment without trial encourages the bad behaviour of other states.  Compromising our usual high standards of human rights encourages bad behaviour by other countries. Governments with less concern for rights are reassured by the apparent failure of liberal"}, {"rank": 5, "docid": "test-philosophy-pphbclsbs-con02b", "score": 0.7931807041168213, "is_gold": true, "snippet": "If the opposition is citing examples from history then there are just as many examples, if not more, of western governments resisting the corrupting effects of increased power and turning not from good into evil intentions. The fact of the matter is that most "}, {"rank": 6, "docid": "training-law-hrilppthwr-pro02b", "score": 0.787623941898346, "is_gold": false, "snippet": "Via legal precedent, [1] Habeas Corpus protections extend to foreign nationals detained in the US. Furthermore, to focus solely on the immigration status and purported guilt of suspected terrorists ignore the fact that Habeas Corpus exists to protect us all. E"}, {"rank": 7, "docid": "test-law-hrpepthwuto-con02a", "score": 0.7868025898933411, "is_gold": false, "snippet": "Introducing the use of violence into the justice system means that liberties that have taken centuries to secure are lost  The principle that all people are presumed innocent and, as a result, should not be abused either physically or mentally by officers of t"}, {"rank": 8, "docid": "test-law-hrpepthwuto-con03a", "score": 0.7810508012771606, "is_gold": false, "snippet": "If legal principles are abandoned then there is little point in defending the liberties that democratic governments say they are so keen to defend  If we accept that this is a war, then its focus is not so much political control of territory as the preservatio"}, {"rank": 9, "docid": "test-philosophy-pphbclsbs-pro03a", "score": 0.7803080677986145, "is_gold": false, "snippet": "Western countries already benefit from extremely liberal laws.  The USA is at present far better than most countries in their respect and regard for civil liberties. New security measures do not greatly compromise this liberty, and the US measures are at the v"}, {"rank": 10, "docid": "test-law-hrpepthwuto-con03b", "score": 0.7800648212432861, "is_gold": false, "snippet": "No amount of legal niceties would bring any comfort to the families of those slaughtered in terrorist atrocities around the world. When you are fighting an enemy that has no time for the European Convention on Human Rights, the US Bill of Rights, English commo"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-science-ciidfaihwc-pro02a", "query": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to the point where it does not impede the ‘protection of other human rights’ [2] – other peoples’ right not to be abused. In this case, if an individual expresses abuse towards another – especially racism - they may be deemed to be outside of the boundaries or free speech and can be punished for it. This motion is simply an extension of this principle; the kinds of sites which would be banned are those which perpetuate hatred or attack other groups in society, an so already fall outside of the protection of free speech. The harms that stem from these kinds of sites outweigh any potential harm from limiting speech in a small number of cases.  [1] Hera.org, ‘Freedom of Expression’, Human Rights Education Association,  on 09/09/11  [2] Hera.org, ‘Freedom of Expression’, Human Rights Education Association,  on 09/09/11", "gold_docid": "test-science-ciidfaihwc-pro02b", "rank_T": 13, "rank_baseline": 2, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-science-ciidfaihwc-pro02a", "score": 0.8601952195167542, "is_gold": false, "snippet": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to t"}, {"rank": 2, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.7853647470474243, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 3, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.7675978541374207, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 4, "docid": "test-science-ciidfaihwc-con01b", "score": 0.767516016960144, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 5, "docid": "test-free-speech-debate-ldhwprhs-con02a", "score": 0.7595784068107605, "is_gold": false, "snippet": "There is no right not to be offended, enforcing what is acceptable to be thought or said places far too much power in the hands of the state.  It is impossible to ensure that nobody is ever offended and it is questionable as to whether it is even desirable [1]"}, {"rank": 6, "docid": "training-law-aullgsmhwchs-pro01b", "score": 0.7573487758636475, "is_gold": false, "snippet": "The government’s primary duty is to protect the constitutional rights of its citizens. Censoring speech is a clear attack on the right to free expression. Governments can use the criminal code to ensure people are protected. Acts that physically harm people or"}, {"rank": 7, "docid": "training-digital-freedoms-fehwbawdh-con01b", "score": 0.7483715415000916, "is_gold": false, "snippet": "Freedom of speech certainly may be curtailed when there is a real harm manifested from it. Holocaust denial, in its refusal to acknowledge one of the most barbaric acts in human history and attempt to justify terrible crimes, is an incredibly dehumanizing forc"}, {"rank": 8, "docid": "test-free-speech-debate-nshbcsbawc-con03b", "score": 0.7483530044555664, "is_gold": false, "snippet": "Recognizing that people have different views is a fairly fundamental part of maintaining societal cohesion. Freedom of expression requires the corollary that there is no right not to be offended – it is hard to see how such a right would be manifest in practic"}, {"rank": 9, "docid": "training-culture-amcghbmgvaw-con03b", "score": 0.7405498623847961, "is_gold": false, "snippet": "However, while freedom of expression is definitely an important concept to consider, such freedoms can only go so far. When it comes to language that promotes violence then freedom of expression is no longer sufficient reason not to ban something as a physical"}, {"rank": 10, "docid": "test-free-speech-debate-ldhwprhs-con01a", "score": 0.7381517887115479, "is_gold": false, "snippet": "Regardless of the views expressed, freedom of speech means that all opinions should be heard.  Allowing politicians to regulate what it is acceptable to say – or think – is not something that has a happy history. This isn’t the result of a purely intellectual "}], "topK_baseline": [{"rank": 1, "docid": "test-science-ciidfaihwc-pro02a", "score": 1.0, "is_gold": false, "snippet": "The government here may legitimately limit ‘free speech’.  We already set boundaries on what constitutes ‘free speech’ within our society. For example, we often endorse a ‘balancing act’ [1] an individual may express their beliefs or opinions, but only up to t"}, {"rank": 2, "docid": "test-science-ciidfaihwc-pro02b", "score": 0.8356688022613525, "is_gold": true, "snippet": "Outright banning this kind of prejudice does not directly tackle it – it ignores it. A better way for the government to tackle derogatory and prejudicial speech is to engage with it in a public forum and reasonably point out the flaws and ignorance that it emb"}, {"rank": 3, "docid": "test-science-ciidfaihwc-con01b", "score": 0.8350057601928711, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 4, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.8315662145614624, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 5, "docid": "test-free-speech-debate-ldhwprhs-con02a", "score": 0.8297735452651978, "is_gold": false, "snippet": "There is no right not to be offended, enforcing what is acceptable to be thought or said places far too much power in the hands of the state.  It is impossible to ensure that nobody is ever offended and it is questionable as to whether it is even desirable [1]"}, {"rank": 6, "docid": "training-culture-amcghbmgvaw-con03b", "score": 0.829150915145874, "is_gold": false, "snippet": "However, while freedom of expression is definitely an important concept to consider, such freedoms can only go so far. When it comes to language that promotes violence then freedom of expression is no longer sufficient reason not to ban something as a physical"}, {"rank": 7, "docid": "test-digital-freedoms-eifpgdff-pro02b", "score": 0.8282753825187683, "is_gold": false, "snippet": "As in the offline world, free speech isn’t unlimited  Even in free societies, free speech isn’t always free. Free speech can be demeaning and hurtful to certain people or can even incite hatred and violence. [1] The first reason is why, under internet libel la"}, {"rank": 8, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.8279837965965271, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 9, "docid": "training-digital-freedoms-gtdfais-con01b", "score": 0.8222471475601196, "is_gold": false, "snippet": "Freedom of expression, assembly, and information are important rights, but restrictions can be placed on all of them if a greater good, like public safety, is at stake. For example, one cannot use her freedom of expression to incite violence towards others and"}, {"rank": 10, "docid": "test-science-ciidfaihwc-con01a", "score": 0.8175135850906372, "is_gold": false, "snippet": "Censorship is fundamentally incompatible with the notion of free speech.  Censoring particular material essentially blinds the public to a complete world view by asserting the patronising view that ordinary citizens simply cannot read extreme material without "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-cppshbcjsfm-con03a", "query": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system is really working? Tagging prisoners? Free counselling for the prisoner for the rest of their life? These measures would require huge administration costs and then the question follows would it even be feasible to enforce such a system?  The root of criminality exists before exposure to the prison system; otherwise criminals would have no reason to be there in the first place. What may be more sensible is to analyse the root causes of what makes criminals offend in the first instance and introduce reform to counteract it, for example the economic crisis. [1]  Some have cited the education system as failing to instil a sense of morality in people. Others suggest that a lack of welfare leads individuals to lose faith in society and therefore be unwilling to follow the law. Assuming that the right time to change people’s outlook on society is after they have offended is naïve – criminal urges are better ‘nipped in the bud’.  It could be argued that criminal mentalities are inherent within certain individuals, either due to their inborn psyche or their upbringing. If one accepts this, then basic rehabilitation into society is going to do little to stop re-offending, whereas incarceration will keep them in a position where they cannot offend. Allowing them easy passage back into the world, with minimal supervision, could provide a gateway for them to commit more serious crimes.  [1] Dodd, Vikram, ‘Police face years of public disorder, former Met chief warns’, guardian.co.uk, 6 December 2011.", "gold_docid": "test-law-cppshbcjsfm-con03b", "rank_T": 13, "rank_baseline": 3, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-law-cppshbcjsfm-con03a", "score": 0.8500791788101196, "is_gold": false, "snippet": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system i"}, {"rank": 2, "docid": "training-law-apslpsyhwbbc-con03b", "score": 0.7327017188072205, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 3, "docid": "training-law-apslpsyhwbbc-pro01b", "score": 0.7320032715797424, "is_gold": false, "snippet": "What pretends to be an argument in support of the resolution is in fact an argument in favour of reforming the prison system. It is true that in an alarming number of prisons the rehabilitative objective of incarceration has been forgotten. In many other priso"}, {"rank": 4, "docid": "training-law-lgpcpao-con01b", "score": 0.7281044721603394, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 5, "docid": "test-law-cppshbcjsfm-con02a", "score": 0.7268266677856445, "is_gold": false, "snippet": "Rehabilitation Doesn’t Actually Work  While some rehabilitative programmes work with some offenders (those who would probably change by themselves anyway), most do not. Many programs cannot overcome, or even appreciably reduce, the powerful tendency for offend"}, {"rank": 6, "docid": "training-law-apslpsyhwbbc-pro03b", "score": 0.7190544009208679, "is_gold": false, "snippet": "Rehabilitation programmes are not a panacea – nor are they instantly or reliably effective. The risk of an individual committing crime can only be reduced by long-term engagement with reform schemes. In 2009 violations of parole- the rules, conditions and sche"}, {"rank": 7, "docid": "test-law-cppshbcjsfm-con01b", "score": 0.7165998220443726, "is_gold": false, "snippet": "The needs of society are not being met by those who reoffend due to lack of rehabilitation. The fact that two thirds of offenders subsequently re-offend with two years [1] suggests that the prison system does little to encourage people to stay on the right sid"}, {"rank": 8, "docid": "test-law-cppshbcjsfm-con02b", "score": 0.7069441676139832, "is_gold": false, "snippet": "If we had the opportunity to stop some offenders re-offending why do we not seize this opportunity? Rehabilitative programs provide such an opportunity. Such programs include cognitive-behavioural programs (say, trying to get a violent offender to think and re"}, {"rank": 9, "docid": "training-law-cplgpsyhwsas-con02a", "score": 0.7045814394950867, "is_gold": false, "snippet": "No system is perfect  Of course, some ASBOs fail. But no aspect of the justice system has a 100% success rate, and by their nature ASBOs are more likely to be abused because (unlike prison) the offender remains in his own environment. Should more in breach of "}, {"rank": 10, "docid": "training-society-gmhbztpgtf-pro02b", "score": 0.7037697434425354, "is_gold": false, "snippet": "Only idealists believe that prisons have rehabilitative role; we have to look at the reality. Juveniles sent to prison are less employable afterwards, and thus more likely to resort to crime. They meet established criminals in prison who both encourage the lif"}], "topK_baseline": [{"rank": 1, "docid": "test-law-cppshbcjsfm-con03a", "score": 0.9999997615814209, "is_gold": false, "snippet": "How Would One Know a System of Rehabilitation Is Really Working  The question “does it work” must be joined by the second question: “even if it does work, how can you tell, with each individual offender, when it has worked?” How would we check if this system i"}, {"rank": 2, "docid": "test-law-cppshbcjsfm-con02a", "score": 0.8368120789527893, "is_gold": false, "snippet": "Rehabilitation Doesn’t Actually Work  While some rehabilitative programmes work with some offenders (those who would probably change by themselves anyway), most do not. Many programs cannot overcome, or even appreciably reduce, the powerful tendency for offend"}, {"rank": 3, "docid": "test-law-cppshbcjsfm-con03b", "score": 0.7960717082023621, "is_gold": true, "snippet": "The expense of re-offenders re-entering the system is also an expense that our prison system cannot afford. A system such as counselling for released prisoners would prove to be inexpensive when weighed against the benefits of decreased crime, and all the cost"}, {"rank": 4, "docid": "training-law-apslpsyhwbbc-pro01b", "score": 0.7886629104614258, "is_gold": false, "snippet": "What pretends to be an argument in support of the resolution is in fact an argument in favour of reforming the prison system. It is true that in an alarming number of prisons the rehabilitative objective of incarceration has been forgotten. In many other priso"}, {"rank": 5, "docid": "training-law-lgpcpao-con01b", "score": 0.7880797386169434, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 6, "docid": "validation-health-aapdpglovr-pro02b", "score": 0.7873876094818115, "is_gold": false, "snippet": "Whether rehabilitation reduces crime more than prison has been the subject of considerable debate for more than a century. [1] Not all treatments work and the twelve step model used by most rehab clinics does not work and almost all the success in treatment fo"}, {"rank": 7, "docid": "training-law-apslpsyhwbbc-con03b", "score": 0.7865382432937622, "is_gold": false, "snippet": "The opposition is unable to conclusively prove that the growth in the prison population and the reduced effectiveness of rehabilitation is a direct result of over-criminalisation.  It may be true that the list of non-traditional crimes is expanding, but the ha"}, {"rank": 8, "docid": "validation-law-cpphwmpfcp-pro01b", "score": 0.7776928544044495, "is_gold": false, "snippet": "This is all based on the vengeance-fuelled concept of “retributive justice”. This is not a model of thinking that has much merit. Imprisonment in the criminal justice works by deterring individuals from crime (prison always will be a deterrent), and incapacita"}, {"rank": 9, "docid": "test-law-cppshbcjsfm-con02b", "score": 0.7708631753921509, "is_gold": false, "snippet": "If we had the opportunity to stop some offenders re-offending why do we not seize this opportunity? Rehabilitative programs provide such an opportunity. Such programs include cognitive-behavioural programs (say, trying to get a violent offender to think and re"}, {"rank": 10, "docid": "test-law-cppshbcjsfm-con01a", "score": 0.7703459858894348, "is_gold": false, "snippet": "Rehabilitation Does Not Serve The Needs of Society  The primary goal of our criminal justice system is to remove offenders from general society and protect law abiding citizens. Many criminals are repeat offenders and rehabilitation can be a long and expensive"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-glilpdwhsn-pro02a", "query": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, which came from Robert G. Sugarman, ADL National Chair, and Abraham H. Foxman, ADL National Director: \"The severe damage that could be inflicted on that relationship by failing to ratify the treaty would inevitably hamper effective American international leadership to stop the Iranian nuclear weapons program. The Iranian nuclear threat is the most serious national security issue facing the United States, Israel, and other allies in the Middle East. While some Senators may have legitimate reservations about the New START treaty or its protocol, we believe the interest of our greater and common goal of preventing Iran from developing nuclear weapons must take precedence.\" [1] New START is crucial in getting Russian support against Iran and other rogue nuclear states.  Although the United States needs a strong and reliable nuclear force, the chief nuclear danger today comes not from Russia but from rogue states such as Iran and North Korea and the potential for nuclear material to fall into the hands of terrorists. Given those pressing dangers, some question why an arms control treaty with Russia matters. It matters because it is in both parties' interest that there be transparency and stability in their strategic nuclear relationship. It also matters because Russia's cooperation will be needed if we are to make progress in rolling back the Iranian and North Korean programs. Russian help will be needed to continue our work to secure \"loose nukes\" in Russia and elsewhere. And Russian assistance is needed to improve the situation in Afghanistan, a breeding ground for international terrorism.  Obviously, the United States does not sign arms control agreements just to make friends. Any treaty must be considered on its merits. But the New START agreement is clearly in the US’ national interest, and the ramifications of not ratifying it could be significantly negative. [2] As US Vice President Joe Biden argued in 2010: \"New Start is also a cornerstone of our efforts to reset relations with Russia, which have improved significantly in the last two years. This has led to real benefits for U.S. and global security. Russian cooperation made it possible to secure strong sanctions against Iran over its nuclear ambitions, and Russia canceled a sale to Iran of an advanced anti-aircraft missile system that would have been dangerously destabilizing. Russia has permitted the flow of materiel through its territory for our troops in Afghanistan. And—as the NATO-Russia Council in Lisbon demonstrated—European security has been advanced by the pursuit of a more cooperative relationship with Russia. We should not jeopardize this progress.\" [3] Therefore, because New START will have significant positive consequences in terms of aiding relations with Russia, and thus in dealing with rogue nuclear states like Iran, it should be supported.  [1] Weingarten, Elizabeth. “How did New START become a Jewish issue?”. The Atlantic. 1 Decemebr 2010.   [2] Kissinger, Henry A. ; Shultz, George P. ; Baker III, James A’ ; Eagleburger , Lawrence S. ; and Powell, Colin L. \"The Republican case for ratifying New START\". Washington Post. 2 December 2010.   [3] Biden, Joseph. \"The case for ratifying New START\". Wall Street Journal. 25 November 2010.", "gold_docid": "test-international-glilpdwhsn-pro02b", "rank_T": 19, "rank_baseline": 9, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-glilpdwhsn-pro02a", "score": 0.8430671095848083, "is_gold": false, "snippet": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, w"}, {"rank": 2, "docid": "test-politics-oglilpdwhsn-con02b", "score": 0.7115429639816284, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 3, "docid": "test-international-glilpdwhsn-con02b", "score": 0.7115429639816284, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 4, "docid": "test-international-glilpdwhsn-con03a", "score": 0.7106871604919434, "is_gold": false, "snippet": "The New START treaty sets a bad approach for a changing world  New START reduces US deterrence in world that is arming, not disarming. The United States has relied on deterrence for sixty years and as a result has prevented war between the great powers. A US d"}, {"rank": 5, "docid": "test-international-glilpdwhsn-pro03a", "score": 0.7058994174003601, "is_gold": false, "snippet": "The New START treaty maintains US nuclear and missile defence.  The US’ Nuclear armament will be modernized along with New START. “The Obama administration has agreed to provide for modernization of the infrastructure essential to maintaining our nuclear arsen"}, {"rank": 6, "docid": "test-politics-oglilpdwhsn-pro03b", "score": 0.7025030851364136, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 7, "docid": "test-international-glilpdwhsn-pro03b", "score": 0.7025030851364136, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 8, "docid": "training-international-aeghbltcbra-pro01a", "score": 0.6975877285003662, "is_gold": false, "snippet": "Russian and the US have many areas where they can cooperate.  In 2009 President Obama stated “I believe that on the fundamental issues that will shape this century, Americans and Russians share common interests that form a basis for cooperation.” [1] This make"}, {"rank": 9, "docid": "test-politics-oglilpdwhsn-pro01b", "score": 0.6968224048614502, "is_gold": false, "snippet": "New START is about national politics, not about the interests of the world or peace. As George Will argued in 2010: \"The (Obama) administration's ardor for ratification is understandable, as is Russia's. The president needs a success somewhere; Russia needs ps"}, {"rank": 10, "docid": "test-international-glilpdwhsn-pro01b", "score": 0.6968224048614502, "is_gold": false, "snippet": "New START is about national politics, not about the interests of the world or peace. As George Will argued in 2010: \"The (Obama) administration's ardor for ratification is understandable, as is Russia's. The president needs a success somewhere; Russia needs ps"}], "topK_baseline": [{"rank": 1, "docid": "test-international-glilpdwhsn-pro02a", "score": 1.0, "is_gold": false, "snippet": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, w"}, {"rank": 2, "docid": "test-international-glilpdwhsn-pro03a", "score": 0.8447731137275696, "is_gold": false, "snippet": "The New START treaty maintains US nuclear and missile defence.  The US’ Nuclear armament will be modernized along with New START. “The Obama administration has agreed to provide for modernization of the infrastructure essential to maintaining our nuclear arsen"}, {"rank": 3, "docid": "test-international-glilpdwhsn-con03a", "score": 0.8319673538208008, "is_gold": false, "snippet": "The New START treaty sets a bad approach for a changing world  New START reduces US deterrence in world that is arming, not disarming. The United States has relied on deterrence for sixty years and as a result has prevented war between the great powers. A US d"}, {"rank": 4, "docid": "test-politics-oglilpdwhsn-pro03b", "score": 0.8164461851119995, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 5, "docid": "test-international-glilpdwhsn-pro03b", "score": 0.8164461851119995, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 6, "docid": "test-politics-oglilpdwhsn-con02b", "score": 0.8162412643432617, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 7, "docid": "test-international-glilpdwhsn-con02b", "score": 0.8162412643432617, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 8, "docid": "test-politics-oglilpdwhsn-pro02b", "score": 0.8150702714920044, "is_gold": false, "snippet": "Reducing nuclear arms through New START will not compel others to stop pursuing nukes. The logic behind New START asserts that for every neg­ative development in the area of nuclear proliferation the US needs to take a substantive step in the direction of nucl"}, {"rank": 9, "docid": "test-international-glilpdwhsn-pro02b", "score": 0.8150702714920044, "is_gold": true, "snippet": "Reducing nuclear arms through New START will not compel others to stop pursuing nukes. The logic behind New START asserts that for every neg­ative development in the area of nuclear proliferation the US needs to take a substantive step in the direction of nucl"}, {"rank": 10, "docid": "test-international-glilpdwhsn-pro01a", "score": 0.8141211867332458, "is_gold": false, "snippet": "The New START treaty will make for a safer world.  Reducing US and Russian nuclear weapons stockpiles makes for a safer world, as Dr. David Gushee states: \"The issue on the table is a nuclear arms reduction and verification treaty between the United States and"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-hrpepthwuto-pro01a", "query": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much information as possible can be gathered as quickly as possible.  If that requires pain to be inflicted on an individual to save the lives of millions then it is simply practical to do so. The harm represented by the pain caused to a single individual is outweighed by the possibility that information gathered from a forceful interrogation might save thousands of lives", "gold_docid": "test-law-hrpepthwuto-pro01b", "rank_T": 14, "rank_baseline": 4, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-law-hrpepthwuto-pro01a", "score": 0.8785409927368164, "is_gold": false, "snippet": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much inform"}, {"rank": 2, "docid": "training-law-hrilthbtsbs-pro04a", "score": 0.691119909286499, "is_gold": false, "snippet": "Harsh interrogation is not necessarily an effective tool for extracting valuable information.  Harsh interrogation of captives has not been shown to be effective (White, 2007). Those who are prepared to die to advance their cause are unlikely to yield informat"}, {"rank": 3, "docid": "test-law-hrpepthwuto-pro03a", "score": 0.6866482496261597, "is_gold": false, "snippet": "Time is of the essence in a crisis. When confronted with extremists who see a virtue in their own death, extraordinary methods may be required.  The use of force and fear in enhanced interrogation gives quick results. In the event of a bomb hidden somewhere in"}, {"rank": 4, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.6817486882209778, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 5, "docid": "training-health-sshwnasso-pro03b", "score": 0.6786008477210999, "is_gold": false, "snippet": "The option given to the police and victim to not disclose the information undermines the principled claim in Proposition Argument Two that people should be free to determine the importance of the information on their own; this denies them that freedom in some "}, {"rank": 6, "docid": "validation-law-lgdgtihbd-con03b", "score": 0.6742838025093079, "is_gold": false, "snippet": "It is better to have some fear and suspicion in society than letting a terrorist attack which costs lives through. Without a domestic intelligence agency we probably would not even know about the 1600 potential terrorists. Now that many of these plots are know"}, {"rank": 7, "docid": "test-philosophy-elkosmj-con02a", "score": 0.6668649315834045, "is_gold": false, "snippet": "We cannot make any judgments about whose life is valuable and whose is not  It is impossible to know what any of the people involved in the situation will do with their life. One might be a serial killer while another might be a life-saving doctor. By attempti"}, {"rank": 8, "docid": "test-philosophy-elkosmj-pro03b", "score": 0.6628380417823792, "is_gold": false, "snippet": "We do not always choose the most rational course of action. If we do not know anything about who we are in the situation we still know that if the one person is killed then their life has been unfairly ended. If the five people die then we know that this is an"}, {"rank": 9, "docid": "test-politics-cdmaggpdgdf-pro05b", "score": 0.6627206802368164, "is_gold": false, "snippet": "This is clearly not always the case. Often transparency means that the public becomes aware when there is little need for them to know. There had been previous nuclear accidents that had caused no damage, and had not been noticed, such as in Goldsboro, N.C. in"}, {"rank": 10, "docid": "validation-law-lgdgtihbd-pro01b", "score": 0.6614682078361511, "is_gold": false, "snippet": "Even if it is protecting lives the scale of the intelligence gathering is undemocratic. By allowing interception, widespread tracking of public records, unfair legal treatment, we erase the trust between citizens and the government in return for very occasiona"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrpepthwuto-pro01a", "score": 1.0, "is_gold": false, "snippet": "In the event of an imminent attack it is only reasonable to use force to find information  If authorities have good reason to believe that there is a realistic threat of a nuclear explosion in downtown Manhattan or Tel Aviv then it is vital that as much inform"}, {"rank": 2, "docid": "test-law-hrpepthwuto-pro03a", "score": 0.8078463077545166, "is_gold": false, "snippet": "Time is of the essence in a crisis. When confronted with extremists who see a virtue in their own death, extraordinary methods may be required.  The use of force and fear in enhanced interrogation gives quick results. In the event of a bomb hidden somewhere in"}, {"rank": 3, "docid": "training-law-hrilthbtsbs-pro04a", "score": 0.8026490211486816, "is_gold": false, "snippet": "Harsh interrogation is not necessarily an effective tool for extracting valuable information.  Harsh interrogation of captives has not been shown to be effective (White, 2007). Those who are prepared to die to advance their cause are unlikely to yield informat"}, {"rank": 4, "docid": "test-law-hrpepthwuto-pro01b", "score": 0.7952389121055603, "is_gold": true, "snippet": "What about a biological bomb in a small town killing a few thousand. Or a lunatic with an M16 in a village killing fifty? Or preventing a single murder or rape? Anyone attempting to support the resolution must give a clear explanation of the point at which tor"}, {"rank": 5, "docid": "test-law-hrpepthwuto-pro03b", "score": 0.7922273874282837, "is_gold": false, "snippet": "The primary difficulty with the use of torture is not one of principle but one of practice – it doesn’t work. You simply have no way of checking whether the information is accurate. By using force or the threat of force, suspects are under pressure to say some"}, {"rank": 6, "docid": "test-digital-freedoms-efsappgdfp-pro01a", "score": 0.7866580486297607, "is_gold": false, "snippet": "There is no physical risk  In terms of physical risk it is almost certainly true that you have nothing to fear from government having loads of information. With the exception perhaps of the Russian FSB and despite the James Bond films intelligence agencies in "}, {"rank": 7, "docid": "validation-law-lgdgtihbd-con03b", "score": 0.7808679342269897, "is_gold": false, "snippet": "It is better to have some fear and suspicion in society than letting a terrorist attack which costs lives through. Without a domestic intelligence agency we probably would not even know about the 1600 potential terrorists. Now that many of these plots are know"}, {"rank": 8, "docid": "training-health-sshwnasso-pro03b", "score": 0.7785817980766296, "is_gold": false, "snippet": "The option given to the police and victim to not disclose the information undermines the principled claim in Proposition Argument Two that people should be free to determine the importance of the information on their own; this denies them that freedom in some "}, {"rank": 9, "docid": "training-law-hrilthbtsbs-pro04b", "score": 0.7742060422897339, "is_gold": false, "snippet": "Harsh interrogation is indeed necessary, due in part to the unique efficacy of harsh interrogation in dealing with the new threat. The interrogation of a terrorist is qualitatively different to that of a soldier, due to the nature of terrorist attacks and the "}, {"rank": 10, "docid": "validation-law-lgdgtihbd-pro01b", "score": 0.7696391940116882, "is_gold": false, "snippet": "Even if it is protecting lives the scale of the intelligence gathering is undemocratic. By allowing interception, widespread tracking of public records, unfair legal treatment, we erase the trust between citizens and the government in return for very occasiona"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-politics-oglilpdwhsn-pro02a", "query": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, which came from Robert G. Sugarman, ADL National Chair, and Abraham H. Foxman, ADL National Director: \"The severe damage that could be inflicted on that relationship by failing to ratify the treaty would inevitably hamper effective American international leadership to stop the Iranian nuclear weapons program. The Iranian nuclear threat is the most serious national security issue facing the United States, Israel, and other allies in the Middle East. While some Senators may have legitimate reservations about the New START treaty or its protocol, we believe the interest of our greater and common goal of preventing Iran from developing nuclear weapons must take precedence.\" [1] New START is crucial in getting Russian support against Iran and other rogue nuclear states.  Although the United States needs a strong and reliable nuclear force, the chief nuclear danger today comes not from Russia but from rogue states such as Iran and North Korea and the potential for nuclear material to fall into the hands of terrorists. Given those pressing dangers, some question why an arms control treaty with Russia matters. It matters because it is in both parties' interest that there be transparency and stability in their strategic nuclear relationship. It also matters because Russia's cooperation will be needed if we are to make progress in rolling back the Iranian and North Korean programs. Russian help will be needed to continue our work to secure \"loose nukes\" in Russia and elsewhere. And Russian assistance is needed to improve the situation in Afghanistan, a breeding ground for international terrorism.  Obviously, the United States does not sign arms control agreements just to make friends. Any treaty must be considered on its merits. But the New START agreement is clearly in the US’ national interest, and the ramifications of not ratifying it could be significantly negative. [2] As US Vice President Joe Biden argued in 2010: \"New Start is also a cornerstone of our efforts to reset relations with Russia, which have improved significantly in the last two years. This has led to real benefits for U.S. and global security. Russian cooperation made it possible to secure strong sanctions against Iran over its nuclear ambitions, and Russia canceled a sale to Iran of an advanced anti-aircraft missile system that would have been dangerously destabilizing. Russia has permitted the flow of materiel through its territory for our troops in Afghanistan. And—as the NATO-Russia Council in Lisbon demonstrated—European security has been advanced by the pursuit of a more cooperative relationship with Russia. We should not jeopardize this progress.\" [3] Therefore, because New START will have significant positive consequences in terms of aiding relations with Russia, and thus in dealing with rogue nuclear states like Iran, it should be supported.  [1] Weingarten, Elizabeth. “How did New START become a Jewish issue?”. The Atlantic. 1 Decemebr 2010.   [2] Kissinger, Henry A. ; Shultz, George P. ; Baker III, James A’ ; Eagleburger , Lawrence S. ; and Powell, Colin L. \"The Republican case for ratifying New START\". Washington Post. 2 December 2010.   [3] Biden, Joseph. \"The case for ratifying New START\". Wall Street Journal. 25 November 2010.", "gold_docid": "test-politics-oglilpdwhsn-pro02b", "rank_T": 18, "rank_baseline": 8, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-glilpdwhsn-pro02a", "score": 0.8430671095848083, "is_gold": false, "snippet": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, w"}, {"rank": 2, "docid": "test-politics-oglilpdwhsn-con02b", "score": 0.7115429639816284, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 3, "docid": "test-international-glilpdwhsn-con02b", "score": 0.7115429639816284, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 4, "docid": "test-international-glilpdwhsn-con03a", "score": 0.7106871604919434, "is_gold": false, "snippet": "The New START treaty sets a bad approach for a changing world  New START reduces US deterrence in world that is arming, not disarming. The United States has relied on deterrence for sixty years and as a result has prevented war between the great powers. A US d"}, {"rank": 5, "docid": "test-international-glilpdwhsn-pro03a", "score": 0.7058994174003601, "is_gold": false, "snippet": "The New START treaty maintains US nuclear and missile defence.  The US’ Nuclear armament will be modernized along with New START. “The Obama administration has agreed to provide for modernization of the infrastructure essential to maintaining our nuclear arsen"}, {"rank": 6, "docid": "test-politics-oglilpdwhsn-pro03b", "score": 0.7025030851364136, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 7, "docid": "test-international-glilpdwhsn-pro03b", "score": 0.7025030851364136, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 8, "docid": "training-international-aeghbltcbra-pro01a", "score": 0.6975877285003662, "is_gold": false, "snippet": "Russian and the US have many areas where they can cooperate.  In 2009 President Obama stated “I believe that on the fundamental issues that will shape this century, Americans and Russians share common interests that form a basis for cooperation.” [1] This make"}, {"rank": 9, "docid": "test-politics-oglilpdwhsn-pro01b", "score": 0.6968224048614502, "is_gold": false, "snippet": "New START is about national politics, not about the interests of the world or peace. As George Will argued in 2010: \"The (Obama) administration's ardor for ratification is understandable, as is Russia's. The president needs a success somewhere; Russia needs ps"}, {"rank": 10, "docid": "test-international-glilpdwhsn-pro01b", "score": 0.6968224048614502, "is_gold": false, "snippet": "New START is about national politics, not about the interests of the world or peace. As George Will argued in 2010: \"The (Obama) administration's ardor for ratification is understandable, as is Russia's. The president needs a success somewhere; Russia needs ps"}], "topK_baseline": [{"rank": 1, "docid": "test-international-glilpdwhsn-pro02a", "score": 1.0, "is_gold": false, "snippet": "The New START treaty will help against Iran’s nuclear program.  New START will help bolster US-Russian cooperation, which is necessary for solving the problem of Iran’s nuclear proliferation. On Nov. 19, 2010, the Anti-Defamation League released a statement, w"}, {"rank": 2, "docid": "test-international-glilpdwhsn-pro03a", "score": 0.8447731137275696, "is_gold": false, "snippet": "The New START treaty maintains US nuclear and missile defence.  The US’ Nuclear armament will be modernized along with New START. “The Obama administration has agreed to provide for modernization of the infrastructure essential to maintaining our nuclear arsen"}, {"rank": 3, "docid": "test-international-glilpdwhsn-con03a", "score": 0.8319673538208008, "is_gold": false, "snippet": "The New START treaty sets a bad approach for a changing world  New START reduces US deterrence in world that is arming, not disarming. The United States has relied on deterrence for sixty years and as a result has prevented war between the great powers. A US d"}, {"rank": 4, "docid": "test-politics-oglilpdwhsn-pro03b", "score": 0.8164461851119995, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 5, "docid": "test-international-glilpdwhsn-pro03b", "score": 0.8164461851119995, "is_gold": false, "snippet": "New START will cause American missile and nuclear capabilities to atrophy, not to be maintained. This is because it locks the US in to agreements of defensive reductions which are tied into Russian offensive reductions. This could eventually leave the US badly"}, {"rank": 6, "docid": "test-politics-oglilpdwhsn-con02b", "score": 0.8162412643432617, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 7, "docid": "test-international-glilpdwhsn-con02b", "score": 0.8162412643432617, "is_gold": false, "snippet": "The New START treaty does not help Russia more than it does the United States. Former Secretary of Defense Robert Gates argued at the time the Russians are currently “above the treaty limits. So they will have to take down warheads.” [1] If there really is und"}, {"rank": 8, "docid": "test-politics-oglilpdwhsn-pro02b", "score": 0.8150702714920044, "is_gold": true, "snippet": "Reducing nuclear arms through New START will not compel others to stop pursuing nukes. The logic behind New START asserts that for every neg­ative development in the area of nuclear proliferation the US needs to take a substantive step in the direction of nucl"}, {"rank": 9, "docid": "test-international-glilpdwhsn-pro02b", "score": 0.8150702714920044, "is_gold": false, "snippet": "Reducing nuclear arms through New START will not compel others to stop pursuing nukes. The logic behind New START asserts that for every neg­ative development in the area of nuclear proliferation the US needs to take a substantive step in the direction of nucl"}, {"rank": 10, "docid": "test-international-glilpdwhsn-pro01a", "score": 0.8141211867332458, "is_gold": false, "snippet": "The New START treaty will make for a safer world.  Reducing US and Russian nuclear weapons stockpiles makes for a safer world, as Dr. David Gushee states: \"The issue on the table is a nuclear arms reduction and verification treaty between the United States and"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-digital-freedoms-eifdfaihs-pro03a", "query": "Threats to Freeware, Shareware and Objectivity  There are very real concerns that ISPs have a commercial interest in guiding people away from certain sites – especially when those sites provide services or products for nothing when the ISP or a related company charges for a competing product. File sharing more generally is an obvious target. The example of Comcast against NetFlix and other file sharing sites is simply the most obvious [i] .  There are also concerns about the impact on objectivity more generally; the Internet works most effectively as a tool because it is, by definition cross-referencing. Although there are many mistakes on many sources as a whole it is possible to reach something resembling the truth. Essentially, “We need freeware, we need shareware, and we need open access. People need to be able to trust sources that they can find on the internet, rather than have them controlled in a small number of hands or by the government.” [ii] Making some sites more accessible than others reduces users’ choice and their ability to check multiple sites so preventing this cross-referencing.  [i] A useful overview of some of the more notorious examples can be found here .  [ii] Bob Gibson, Executive Director of the University of Virginia’s Sorensen Institute for Political Leadership, on the Charlottesville, VA, politics interview program Politics Matters with host and producer Jan Madeleine Paynter discussing journalism", "gold_docid": "test-digital-freedoms-eifdfaihs-pro03b", "rank_T": 17, "rank_baseline": 8, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-eifdfaihs-pro03a", "score": 0.8413428068161011, "is_gold": false, "snippet": "Threats to Freeware, Shareware and Objectivity  There are very real concerns that ISPs have a commercial interest in guiding people away from certain sites – especially when those sites provide services or products for nothing when the ISP or a related company"}, {"rank": 2, "docid": "training-international-gsciidfi-con03b", "score": 0.6441584825515747, "is_gold": false, "snippet": "The EU [i] has described this agreement as a balance of the interests of all stakeholders – including customers or other users. Nobody is banned from freely sharing their own ideas, inventions or research; merely from ripping off that of other people. The oppo"}, {"rank": 3, "docid": "training-digital-freedoms-pidfakhwnfawn-pro02b", "score": 0.6319246292114258, "is_gold": false, "snippet": "Is it really in the public interest that there should be a norm that government information should be shared? There are clearly some areas where we do not want our government to share information; most clearly in the realm of security, [1] but also where the g"}, {"rank": 4, "docid": "training-free-speech-debate-dmagghwrp-pro03b", "score": 0.6276289820671082, "is_gold": false, "snippet": "t is entirely fair to say that the way we approach and share information has changed beyond recognition in the last thirty years. There have been innumerable efforts made to control high-speed information networks and all have failed.  To hobble journalists wi"}, {"rank": 5, "docid": "training-digital-freedoms-gthbtsbp-con02b", "score": 0.6210376024246216, "is_gold": false, "snippet": "It is frequently useful to see the general approach of a public organisation as reflected in routine discussions. Opposition is wrong to suggest that such information would only cast a light on ideas that were never pursued anyway so they don’t matter. It woul"}, {"rank": 6, "docid": "test-politics-cdmaggpdgdf-pro05b", "score": 0.6179559826850891, "is_gold": false, "snippet": "This is clearly not always the case. Often transparency means that the public becomes aware when there is little need for them to know. There had been previous nuclear accidents that had caused no damage, and had not been noticed, such as in Goldsboro, N.C. in"}, {"rank": 7, "docid": "test-politics-cdmaggpdgdf-con02b", "score": 0.6175854206085205, "is_gold": false, "snippet": "Transparency clearly does not have to extend to things like technical specifications of weapons. Such information would be a clear benefit to a competitor allowing them to build their own while being of little help in terms of transparency as most people could"}, {"rank": 8, "docid": "test-digital-freedoms-dfiphbgs-pro03a", "score": 0.6168342232704163, "is_gold": false, "snippet": "Governments can re-define industry standards by choosing open source software.  Economists use the term ‘network effect’ to describe the phenomenon whereby, as several people use the same communication platform (be it a specific device, such as a telephone, or"}, {"rank": 9, "docid": "test-philosophy-pphbclsbs-pro03b", "score": 0.6165305972099304, "is_gold": false, "snippet": "The opposition does not except the importance of legalisation like the US Patriot Act, as such legislation is always used for aims it was not originally intended for example when it is being used to investigate media companies dedicated to free speech - Wikile"}, {"rank": 10, "docid": "training-digital-freedoms-ifakhbwfg-con02b", "score": 0.6144810318946838, "is_gold": false, "snippet": "Entries are not easily or wantonly manipulated. Wikipedia harnesses the best qualities of humanity – trust and cooperation in pursuit of an unselfish goal. Sceptics essentially take a negative view of society, unable to understand why people would club togethe"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-eifdfaihs-pro03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Threats to Freeware, Shareware and Objectivity  There are very real concerns that ISPs have a commercial interest in guiding people away from certain sites – especially when those sites provide services or products for nothing when the ISP or a related company"}, {"rank": 2, "docid": "training-international-gsciidfi-con03b", "score": 0.7417981028556824, "is_gold": false, "snippet": "The EU [i] has described this agreement as a balance of the interests of all stakeholders – including customers or other users. Nobody is banned from freely sharing their own ideas, inventions or research; merely from ripping off that of other people. The oppo"}, {"rank": 3, "docid": "training-science-ciidffehwa-con01b", "score": 0.7414092421531677, "is_gold": false, "snippet": "Freedom of speech is important, but must be curtailed when people are threatened. Extremists are a very real threat because their messages and actions galvanize people to take violent, disruptive actions against the state and its citizens. ISPs have a right, a"}, {"rank": 4, "docid": "test-digital-freedoms-eifdfaihs-pro02a", "score": 0.7385258674621582, "is_gold": false, "snippet": "Risk of a two-tier Internet  As things stand there are relatively flat rate services. The concern is that ISP would charge higher rates for full Internet access or act to ensure that their own content arrived seamlessly and smoothly, while that of competitors "}, {"rank": 5, "docid": "test-digital-freedoms-dfiphbgs-con02a", "score": 0.7309864163398743, "is_gold": false, "snippet": "Open source software undermines national security.  Even if closed source software firms are ultimately answerable to their shareholders, their shareholders want them to produce software which meets the needs of their customers so that they can sell their prod"}, {"rank": 6, "docid": "training-science-ciidffehwa-con03b", "score": 0.7307015061378479, "is_gold": false, "snippet": "The ISPs would not be defining the parameters of what constitutes extremism; they would simply be interpreting the parameters that are given to them by government. They do not need to gauge the extent of the harm from a site simply determine whether it falls w"}, {"rank": 7, "docid": "training-digital-freedoms-pidfakhwnfawn-pro02b", "score": 0.7256760597229004, "is_gold": false, "snippet": "Is it really in the public interest that there should be a norm that government information should be shared? There are clearly some areas where we do not want our government to share information; most clearly in the realm of security, [1] but also where the g"}, {"rank": 8, "docid": "test-digital-freedoms-eifdfaihs-pro03b", "score": 0.724567174911499, "is_gold": true, "snippet": "The idea that there is a virtue in providing things for free takes a somewhat cavalier attitude toward jobs. It is a predicate of this, and many other, arguments that the Internet should be either free or very cheap, but this does little for protecting genuine"}, {"rank": 9, "docid": "test-digital-freedoms-dfiphbgs-pro03a", "score": 0.7232810258865356, "is_gold": false, "snippet": "Governments can re-define industry standards by choosing open source software.  Economists use the term ‘network effect’ to describe the phenomenon whereby, as several people use the same communication platform (be it a specific device, such as a telephone, or"}, {"rank": 10, "docid": "test-digital-freedoms-dfiphbgs-pro03b", "score": 0.7232663631439209, "is_gold": false, "snippet": "The network effect is more complex than the argument that, if a government uses a product, then its population will too. Firstly, 90% of desktop PCs use Microsoft products; the cost for companies and citizens to transition from Microsoft to an open source alte"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-iighbopcc-pro01a", "query": "The hard part is the cutting of emissions  The problem with a non-binding agreement, even one where the targets have been submitted by the governments themselves is exactly that it is non-binding. If governments are not bound to cut emissions then there is a good chance that many of them wont. [1] The British government, which has binding targets, has been on course to miss its 2025 targets with reductions of only 23% against targets of 31% due to a decision to reduce subsidies for housing insulation. [2] If countries which have set targets for themselves in the past are missing them what hope do we have for these voluntary targets?  [1] Taylor, Lenore, ‘Paris climate talks: the real test is whether countries will keep their word’, The Guardian, 30 November 2015,   [2] Harvey, Fiona, ‘UK on track to miss carbon targets, climate change advisers warn’, The Guardian, 15 July 2014,", "gold_docid": "test-international-iighbopcc-pro01b", "rank_T": 14, "rank_baseline": 5, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-international-iighbopcc-pro01a", "score": 0.8560401201248169, "is_gold": false, "snippet": "The hard part is the cutting of emissions  The problem with a non-binding agreement, even one where the targets have been submitted by the governments themselves is exactly that it is non-binding. If governments are not bound to cut emissions then there is a g"}, {"rank": 2, "docid": "test-international-iighbopcc-pro03b", "score": 0.744913637638092, "is_gold": false, "snippet": "Voluntary measures have got much further than previous attempts to get a binding agreement – at least there is going to be a good working agreement to build on in future this time. The changes that could mean countries ultimately targeting 2C or even 1.5C are "}, {"rank": 3, "docid": "training-environment-crasbmurcc-pro01b", "score": 0.7137492895126343, "is_gold": false, "snippet": "It’s been apparent from Rio onwards that ensuring action would require both patience and an acceptance that governments and industry would only genuinely get on board when Climate Change became an emergency rather than a distant theory. That is now starting to"}, {"rank": 4, "docid": "test-environment-chbwtlgcc-pro03b", "score": 0.6949763298034668, "is_gold": false, "snippet": "Despite the failure of the Copenhagen Protocol, local, regional, national, and international organizations are all still working on solutions for climate change. The Kyoto Protocol was a failure by virtue of its design (too many credits would have gone to form"}, {"rank": 5, "docid": "test-international-iighbopcc-con02a", "score": 0.6934223175048828, "is_gold": false, "snippet": "Only a non-binding agreement would get the targets necessary  Fully binding treaties with mechanisms for compliance are the gold standard for agreements between nations. But because they are onerous they are the most difficult kind of treaties to get agreed to"}, {"rank": 6, "docid": "test-environment-chbwtlgcc-con01b", "score": 0.6842861771583557, "is_gold": false, "snippet": "Carbon trading systems may have the effect of slowing the rise in CO2 emissions, and possibly even creating a fall. However this will not solve the problem as changes are already occurring and there may be no way to stop feedback that creates more emissions."}, {"rank": 7, "docid": "test-international-iighbopcc-pro02a", "score": 0.6764640808105469, "is_gold": false, "snippet": "Only an international treaty can create penalties for non-compliance  A non-binding agreement will not have any penalties for any countries that do not comply with it, this sets the agreement up for failure. Without a binding agreement a government will find i"}, {"rank": 8, "docid": "training-environment-crasbmurcc-con02b", "score": 0.6762090921401978, "is_gold": false, "snippet": "The mono-focus on prevention has, effectively, blinded the world’s governments to the real issue – that climate change is happening and will continue to happen. That is a process that will require great adaptation on behalf of everyone. As with any significant"}, {"rank": 9, "docid": "training-environment-cpiahwdwf-con02b", "score": 0.662979006767273, "is_gold": false, "snippet": "In India 456 million people live on under $1.25 per day, [1] it is absurd to suggest that India despite having higher CO2 emissions than Japan, indeed almost double, [2] should have the same responsibility for cutting emissions, or for paying for the consequen"}, {"rank": 10, "docid": "test-international-iighbopcc-pro02b", "score": 0.6586877107620239, "is_gold": false, "snippet": "While there are sure to be some countries that won’t live up to their pledges this is also the case with binding agreements even if they have built in penalties. This has been shown by the European Union where Germany and France both flouted budget rules that "}], "topK_baseline": [{"rank": 1, "docid": "test-international-iighbopcc-pro01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "The hard part is the cutting of emissions  The problem with a non-binding agreement, even one where the targets have been submitted by the governments themselves is exactly that it is non-binding. If governments are not bound to cut emissions then there is a g"}, {"rank": 2, "docid": "test-international-iighbopcc-con02a", "score": 0.8370558619499207, "is_gold": false, "snippet": "Only a non-binding agreement would get the targets necessary  Fully binding treaties with mechanisms for compliance are the gold standard for agreements between nations. But because they are onerous they are the most difficult kind of treaties to get agreed to"}, {"rank": 3, "docid": "test-international-iighbopcc-pro02a", "score": 0.8317065238952637, "is_gold": false, "snippet": "Only an international treaty can create penalties for non-compliance  A non-binding agreement will not have any penalties for any countries that do not comply with it, this sets the agreement up for failure. Without a binding agreement a government will find i"}, {"rank": 4, "docid": "test-international-iighbopcc-pro03b", "score": 0.8063695430755615, "is_gold": false, "snippet": "Voluntary measures have got much further than previous attempts to get a binding agreement – at least there is going to be a good working agreement to build on in future this time. The changes that could mean countries ultimately targeting 2C or even 1.5C are "}, {"rank": 5, "docid": "test-international-iighbopcc-pro01b", "score": 0.7955320477485657, "is_gold": true, "snippet": "Each government has put in targets that they believe are realistic and that they are willing to try to reach. The countries involved are therefore much more likely to want to meet the target than if they had been imposed on them by a binding international trea"}, {"rank": 6, "docid": "test-international-iighbopcc-pro02b", "score": 0.7750312685966492, "is_gold": false, "snippet": "While there are sure to be some countries that won’t live up to their pledges this is also the case with binding agreements even if they have built in penalties. This has been shown by the European Union where Germany and France both flouted budget rules that "}, {"rank": 7, "docid": "training-environment-crasbmurcc-pro01b", "score": 0.7717370986938477, "is_gold": false, "snippet": "It’s been apparent from Rio onwards that ensuring action would require both patience and an acceptance that governments and industry would only genuinely get on board when Climate Change became an emergency rather than a distant theory. That is now starting to"}, {"rank": 8, "docid": "test-international-iighbopcc-con02b", "score": 0.7611548900604248, "is_gold": false, "snippet": "There is little reason why countries can’t voluntarily come up with their quotas and then be bound to them by treaty. Being willing to be bound by a treaty would show that the targets submitted are really the targets that countries are setting for themselves r"}, {"rank": 9, "docid": "test-environment-chbwtlgcc-pro03a", "score": 0.7518625855445862, "is_gold": false, "snippet": "Failure to reach global accord  The Kyoto Protocol failed to reduce global GHG emissions and in the midst of an economic crisis, world leaders were unable to even agree to a replacement treaty when it expired. There is no meaningful global emissions reduction "}, {"rank": 10, "docid": "test-international-iighbopcc-pro03a", "score": 0.7508542537689209, "is_gold": false, "snippet": "It is too late for half measures  Two degrees Celsius has generally been regarded as that safe level which agreements should be aiming for. This agreement does not go so far with it expected to keep the temperature increase to around 2.7 degrees if everyone st"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-segiahbarr-con02a", "query": "Majority of states are still undemocratic  While there is a lot of contention over government type, democracy is seen as an aspiration in Western eyes, and African dictators have a history of running brutal and corrupt regimes. In Africa the majority of states are still dictatorships. Only 25 of the 55 states are democratic, whilst the rest are authoritarian or hybrid regimes. These dictators are commonly associated with poor governance, which in turn can affect economic growth. Recent pictures of Robert Mugabe and his team of ministers asleep at an African-Arab economic summit demonstrate how little enthusiasm some of these leaders have for the progress of their country [1] .  [1] Moyo, ‘Mugabe and his ministers sleep through economic summit’, 2013", "gold_docid": "test-international-segiahbarr-con02b", "rank_T": 18, "rank_baseline": 9, "overlap@K": 0.8, "topK_T": [{"rank": 1, "docid": "test-international-segiahbarr-con02a", "score": 0.8528832197189331, "is_gold": false, "snippet": "Majority of states are still undemocratic  While there is a lot of contention over government type, democracy is seen as an aspiration in Western eyes, and African dictators have a history of running brutal and corrupt regimes. In Africa the majority of states"}, {"rank": 2, "docid": "test-economy-bepighbdb-con04b", "score": 0.7345736622810364, "is_gold": false, "snippet": "Economic development is not exclusively bound up with regimes or institutions. Natural factors such as rivers for transport, potential land use and natural resources are key to explaining why some countries are more prosperous than others. Many countries with "}, {"rank": 3, "docid": "test-economy-bepighbdb-con02b", "score": 0.7231238484382629, "is_gold": false, "snippet": "Certain economic standards have to be met to genuinely satisfy individual autonomy and freedom. If economic growth is a necessity for democracy, dictatorships are better at gaining the required growth. If dictatorships grow faster while not redistributing weal"}, {"rank": 4, "docid": "test-economy-bepighbdb-pro03b", "score": 0.7059128284454346, "is_gold": false, "snippet": "Dictatorships generally focus only on supporting one element of society, which means that there are often opposition groups from other demographics ready to oppose them. When the repression fails, the state will no longer be stable. Even if a dictatorship can "}, {"rank": 5, "docid": "training-politics-gvhbtnd-con04b", "score": 0.6939517855644226, "is_gold": false, "snippet": "Democratic legitimacy cannot simply be equated with economic growth even if most people see the economy as the main issue when it comes to voting. The economy is important but there are plenty of countries which have used economic growth to buttress undemocrat"}, {"rank": 6, "docid": "training-international-ygiadwmhb-pro02b", "score": 0.6931195855140686, "is_gold": false, "snippet": "Poverty may have something to do with countries becoming dictatorships but little. That it is about the efficiency of government is much more credible, this is partially why India, with a large native civil service at independence is one of the exceptions. In "}, {"rank": 7, "docid": "test-economy-bepighbdb-con01b", "score": 0.6774957180023193, "is_gold": false, "snippet": "Those cases show that the dictatorship helped the economy. Even if it did not trigger the growth, it laid the ground work for it. In Spain’s case it was a dictator who was able to change to the necessary free market policies while in South Korea it was the pre"}, {"rank": 8, "docid": "test-economy-bepighbdb-con03b", "score": 0.6774957180023193, "is_gold": false, "snippet": "Those cases show that the dictatorship helped the economy. Even if it did not trigger the growth, it laid the ground work for it. In Spain’s case it was a dictator who was able to change to the necessary free market policies while in South Korea it was the pre"}, {"rank": 9, "docid": "validation-international-ahbiataucs-con04b", "score": 0.6761207580566406, "is_gold": false, "snippet": "First of all Africa is becoming more democratic; in 1983 there were only three democracies in Africa but by 2010 this had increased to 23 and with this comes an increase in accountability and desire both for cooperation with neighbours and for economic liberal"}, {"rank": 10, "docid": "training-international-apdwhbpa-pro04b", "score": 0.6745678186416626, "is_gold": false, "snippet": "More than half of African countries are ruled by dictatorships. Authoritarian regimes remain numerous enough, and the opposition still prominent enough, for there to be adequate instability for mercenaries to gain employment. During the Libyan revolution, caus"}], "topK_baseline": [{"rank": 1, "docid": "test-international-segiahbarr-con02a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Majority of states are still undemocratic  While there is a lot of contention over government type, democracy is seen as an aspiration in Western eyes, and African dictators have a history of running brutal and corrupt regimes. In Africa the majority of states"}, {"rank": 2, "docid": "test-economy-bepighbdb-con02b", "score": 0.7960008978843689, "is_gold": false, "snippet": "Certain economic standards have to be met to genuinely satisfy individual autonomy and freedom. If economic growth is a necessity for democracy, dictatorships are better at gaining the required growth. If dictatorships grow faster while not redistributing weal"}, {"rank": 3, "docid": "test-economy-bepighbdb-con04b", "score": 0.7915668487548828, "is_gold": false, "snippet": "Economic development is not exclusively bound up with regimes or institutions. Natural factors such as rivers for transport, potential land use and natural resources are key to explaining why some countries are more prosperous than others. Many countries with "}, {"rank": 4, "docid": "validation-international-ahbiataucs-con04b", "score": 0.7889008522033691, "is_gold": false, "snippet": "First of all Africa is becoming more democratic; in 1983 there were only three democracies in Africa but by 2010 this had increased to 23 and with this comes an increase in accountability and desire both for cooperation with neighbours and for economic liberal"}, {"rank": 5, "docid": "training-international-ygiadwmhb-pro02b", "score": 0.7816753387451172, "is_gold": false, "snippet": "Poverty may have something to do with countries becoming dictatorships but little. That it is about the efficiency of government is much more credible, this is partially why India, with a large native civil service at independence is one of the exceptions. In "}, {"rank": 6, "docid": "training-politics-gvhbtnd-con04b", "score": 0.7814977169036865, "is_gold": false, "snippet": "Democratic legitimacy cannot simply be equated with economic growth even if most people see the economy as the main issue when it comes to voting. The economy is important but there are plenty of countries which have used economic growth to buttress undemocrat"}, {"rank": 7, "docid": "test-economy-bepighbdb-pro03b", "score": 0.7749252319335938, "is_gold": false, "snippet": "Dictatorships generally focus only on supporting one element of society, which means that there are often opposition groups from other demographics ready to oppose them. When the repression fails, the state will no longer be stable. Even if a dictatorship can "}, {"rank": 8, "docid": "training-international-apdwhbpa-pro04b", "score": 0.7676457166671753, "is_gold": false, "snippet": "More than half of African countries are ruled by dictatorships. Authoritarian regimes remain numerous enough, and the opposition still prominent enough, for there to be adequate instability for mercenaries to gain employment. During the Libyan revolution, caus"}, {"rank": 9, "docid": "test-international-segiahbarr-con02b", "score": 0.764845073223114, "is_gold": true, "snippet": "The rise in the number of democracies, and the Arab Spring movement in Northern Africa, demonstrates an increasing dedication to democracy. At the end of the cold war there were only three democracies; the large number of regime changes show that African gover"}, {"rank": 10, "docid": "test-economy-bepighbdb-con03a", "score": 0.7580078840255737, "is_gold": false, "snippet": "Political regime has a limited impact on development  It can be argued that a good economic policy, such as China’s economic policies, have helped development. But a free market policy can be done with any form of government, and cannot be exclusively attached"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-hrpepthwuto-con03a", "query": "If legal principles are abandoned then there is little point in defending the liberties that democratic governments say they are so keen to defend  If we accept that this is a war, then its focus is not so much political control of territory as the preservation of a way of life. It is ridiculous to fight to defend principles of equality and decency using the tool of abandoning them the moment they become inconvenient.  The forces of religious extremism wish to undo 1,400 years of democratic development. We should not assist them in that process by allowing the major powers of the West throw out the most basic principles of the rule of law. Such a move, ultimately, has the potential to be vastly more destructive than the actions of a few fanatics", "gold_docid": "test-law-hrpepthwuto-con03b", "rank_T": 10, "rank_baseline": 2, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-law-hrpepthwuto-con03a", "score": 0.8574422597885132, "is_gold": false, "snippet": "If legal principles are abandoned then there is little point in defending the liberties that democratic governments say they are so keen to defend  If we accept that this is a war, then its focus is not so much political control of territory as the preservatio"}, {"rank": 2, "docid": "test-law-hrpepthwuto-pro02b", "score": 0.709427535533905, "is_gold": false, "snippet": "When battling those who would seek to replace the rule of law and democratic governance with religious decree, it is more important than ever to demonstrate that the principles of a civilised society are paramount.  In the light of that reality, for the state "}, {"rank": 3, "docid": "test-politics-ypppdghwid-con04b", "score": 0.6784602999687195, "is_gold": false, "snippet": "It is wrong to suggest that the rule of law, or protection of civil rights, is less important in different regions. The fact is that democracy is the only form of government which respects every individual's right to political self determination (as explained "}, {"rank": 4, "docid": "test-philosophy-pphbclsbs-pro03b", "score": 0.6771371960639954, "is_gold": false, "snippet": "The opposition does not except the importance of legalisation like the US Patriot Act, as such legislation is always used for aims it was not originally intended for example when it is being used to investigate media companies dedicated to free speech - Wikile"}, {"rank": 5, "docid": "test-politics-ypppdghwid-pro04b", "score": 0.6671689748764038, "is_gold": false, "snippet": "There are two problems: democracy is not necessarily the best form of government, and even if it is that does not mean it is our obligation to impose it.  First, just because we believe that political self-determination is an important value, it does not mean "}, {"rank": 6, "docid": "test-philosophy-pphbclsbs-pro04b", "score": 0.6621238589286804, "is_gold": false, "snippet": "Granted, the measures are implemented with popular support; the opposition cannot argue against this. However, to claim that democracy has some inherent value beyond providing a stable society is naïve. Democracy is, in this example, simply the tyranny of the "}, {"rank": 7, "docid": "test-international-gsciidffe-pro02b", "score": 0.6580366492271423, "is_gold": false, "snippet": "It is not up to outside powers to decide what is and what is not in the interest of any peoples but their own. While those attempting to circumvent censorship may see themselves as promoting some kind of universal human rights in practice they are pushing thei"}, {"rank": 8, "docid": "test-philosophy-pphbclsbs-con02b", "score": 0.6560831069946289, "is_gold": false, "snippet": "If the opposition is citing examples from history then there are just as many examples, if not more, of western governments resisting the corrupting effects of increased power and turning not from good into evil intentions. The fact of the matter is that most "}, {"rank": 9, "docid": "validation-law-lghrilthwdt-con05b", "score": 0.6553478240966797, "is_gold": false, "snippet": "Internment without trial does not undermine either democracy or its values. Tough measures are aimed only at very few suspects; only 11 are currently detained in Britain, only a few hundred at Guantanamo Bay. Exceptional circumstances call for special measures"}, {"rank": 10, "docid": "test-law-hrpepthwuto-con03b", "score": 0.6524465680122375, "is_gold": true, "snippet": "No amount of legal niceties would bring any comfort to the families of those slaughtered in terrorist atrocities around the world. When you are fighting an enemy that has no time for the European Convention on Human Rights, the US Bill of Rights, English commo"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrpepthwuto-con03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "If legal principles are abandoned then there is little point in defending the liberties that democratic governments say they are so keen to defend  If we accept that this is a war, then its focus is not so much political control of territory as the preservatio"}, {"rank": 2, "docid": "test-law-hrpepthwuto-con03b", "score": 0.8319301605224609, "is_gold": true, "snippet": "No amount of legal niceties would bring any comfort to the families of those slaughtered in terrorist atrocities around the world. When you are fighting an enemy that has no time for the European Convention on Human Rights, the US Bill of Rights, English commo"}, {"rank": 3, "docid": "test-law-hrpepthwuto-pro02b", "score": 0.8122441172599792, "is_gold": false, "snippet": "When battling those who would seek to replace the rule of law and democratic governance with religious decree, it is more important than ever to demonstrate that the principles of a civilised society are paramount.  In the light of that reality, for the state "}, {"rank": 4, "docid": "test-philosophy-pphbclsbs-con01b", "score": 0.8063079714775085, "is_gold": false, "snippet": "The proposition can point to the clear acts of terrorism of recent years that have proven difficult to combat and fatal to so many thousands. What the opposition is asking is to simply disregard all these facts on principle, and on principle only; this is over"}, {"rank": 5, "docid": "validation-law-lghrilthwdt-con05b", "score": 0.8003499507904053, "is_gold": false, "snippet": "Internment without trial does not undermine either democracy or its values. Tough measures are aimed only at very few suspects; only 11 are currently detained in Britain, only a few hundred at Guantanamo Bay. Exceptional circumstances call for special measures"}, {"rank": 6, "docid": "test-philosophy-pphbclsbs-pro02a", "score": 0.794617772102356, "is_gold": false, "snippet": "The apparent loss of liberty is overstated.  Negative cases of security abuse are few and have been greatly exaggerated by an emphatic civil rights lobby that has no empathy for the victims of terrorism. Of course, with any wide-scale attempt to fight terroris"}, {"rank": 7, "docid": "test-politics-ypppdghwid-con04b", "score": 0.7904958724975586, "is_gold": false, "snippet": "It is wrong to suggest that the rule of law, or protection of civil rights, is less important in different regions. The fact is that democracy is the only form of government which respects every individual's right to political self determination (as explained "}, {"rank": 8, "docid": "test-philosophy-pphbclsbs-pro01b", "score": 0.7884717583656311, "is_gold": false, "snippet": "Nothing justifies some of the security measures taken by western governments. The ancient western conventions of the accused being innocent until proven guilty and his right to a fair trial have both been undermined [1] by the recent Labour administration in t"}, {"rank": 9, "docid": "test-philosophy-pphbclsbs-pro03a", "score": 0.7860451340675354, "is_gold": false, "snippet": "Western countries already benefit from extremely liberal laws.  The USA is at present far better than most countries in their respect and regard for civil liberties. New security measures do not greatly compromise this liberty, and the US measures are at the v"}, {"rank": 10, "docid": "training-free-speech-debate-ifcidffe-pro02b", "score": 0.7854356169700623, "is_gold": false, "snippet": "A democracy, like any state, owes its first duty to its citizens, and its national interest is therefore in selling this equipment to help business at home. While it is convenient, perhaps even morally right at times, to stand publicly for the universality of "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-education-udfakusma-pro01a", "query": "Opens up education  Higher education, as with other levels of education, should be open to all. Universities are universally respected as the highest form of educational institution available and it is a matter of principle that everyone should have access to this higher level of education. Unfortunately not everyone in the world has this access usually because they cannot afford it, but it may also be because they are not academically inclined. This does not however mean that it is right to simply cut them off from higher educational opportunities. Should those who do not attend university not have access to the same resources as those who do?  This can have an even greater impact globally than within an individual country. 90% of the world’s population currently have no access to higher education. Providing access to all academic work gives them the opportunities that those in developed countries already have. [1]  [1] Daniel, Sir John, and Killion, David, “Are open educational resources the key to global economic growth?”, Guardian Professional, 4 July 2012,", "gold_docid": "test-education-udfakusma-pro01b", "rank_T": 11, "rank_baseline": 3, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-education-udfakusma-pro01a", "score": 0.845076322555542, "is_gold": false, "snippet": "Opens up education  Higher education, as with other levels of education, should be open to all. Universities are universally respected as the highest form of educational institution available and it is a matter of principle that everyone should have access to "}, {"rank": 2, "docid": "test-education-udfakusma-con03b", "score": 0.7130747437477112, "is_gold": false, "snippet": "The vast majority of people who go to University are not doing so simply because they are interested in a subject and want to find out more. Instead they are after the qualification and improved job prospects university provides. Even those few who are in larg"}, {"rank": 3, "docid": "test-education-egtuscpih-pro05b", "score": 0.7122654318809509, "is_gold": false, "snippet": "Though it is good for personal development opportunities to access educational material don’t mean anything in the labour market that requires verification of understanding through grading. As regards to universities cooperating; that might actually result in "}, {"rank": 4, "docid": "test-education-ughbuesbf-pro03a", "score": 0.7038767337799072, "is_gold": false, "snippet": "Individuals have a right to equal opportunities that free university provides.  The employment prospects created by a university degree are substantial, and many lines of work are only available to university graduates. True merit should define the ability to "}, {"rank": 5, "docid": "test-education-ughbuesbf-con02b", "score": 0.7025200724601746, "is_gold": false, "snippet": "While there will of course be people who do not try to get the most out of their university educations, what matters is that everyone has access to it. It is a fair trade between inefficiencies created by inattentive students and diligent students who would ha"}, {"rank": 6, "docid": "test-education-udfakusma-pro02a", "score": 0.6990365982055664, "is_gold": false, "snippet": "Most universities are publically funded so should have to be open with their materials.  The United States University system is famously expensive and as a result it is probably the system in a developed country that has least public funding yet $346.8billion "}, {"rank": 7, "docid": "test-education-egtuscpih-pro02b", "score": 0.696758508682251, "is_gold": false, "snippet": "MOOCs primarily reach already educated and thus privileged people. Roughly 80% of people who took Coursera courses already have a Bachelor' degree [12]. This statistic shows that the less-advantaged do not prefer online courses over the traditional university "}, {"rank": 8, "docid": "training-education-uhwecpuu-pro02b", "score": 0.6952980756759644, "is_gold": false, "snippet": "Universities can't be guided by an \"invisible hand\": the conditions in the higher education market are not such that optimum results will obtain from this sort of \"free market\" idea. There are several reasons why. First, demand for university courses fluctuate"}, {"rank": 9, "docid": "training-education-eguhwefpgu-con01b", "score": 0.6887137293815613, "is_gold": false, "snippet": "The importance of university to minority groups derives directly from its importance to the rest of the country. It is seen as the key to things like higher-paying jobs for low-income families because it is seen as the key to higher-paying jobs in general. Mor"}, {"rank": 10, "docid": "training-education-uhwecpuu-con03b", "score": 0.686060905456543, "is_gold": false, "snippet": "The reason why people from poorer backgrounds are underrepresented at university is not because they perceive it as something only rich people can do. Instead, it is because their schools did not adequately prepare them: on average, they have fewer/worse quali"}], "topK_baseline": [{"rank": 1, "docid": "test-education-udfakusma-pro01a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Opens up education  Higher education, as with other levels of education, should be open to all. Universities are universally respected as the highest form of educational institution available and it is a matter of principle that everyone should have access to "}, {"rank": 2, "docid": "test-education-udfakusma-con03b", "score": 0.8170318007469177, "is_gold": false, "snippet": "The vast majority of people who go to University are not doing so simply because they are interested in a subject and want to find out more. Instead they are after the qualification and improved job prospects university provides. Even those few who are in larg"}, {"rank": 3, "docid": "test-education-udfakusma-pro01b", "score": 0.7888528108596802, "is_gold": true, "snippet": "Making these academic materials available to the general public does not mean they are useful to anyone. Many of the materials universities produce are not useful unless the reader has attended the relevant lectures. Rather than simply putting those lectures t"}, {"rank": 4, "docid": "test-education-ughbuesbf-pro03a", "score": 0.7808622121810913, "is_gold": false, "snippet": "Individuals have a right to equal opportunities that free university provides.  The employment prospects created by a university degree are substantial, and many lines of work are only available to university graduates. True merit should define the ability to "}, {"rank": 5, "docid": "test-education-egtuscpih-pro05b", "score": 0.780147135257721, "is_gold": false, "snippet": "Though it is good for personal development opportunities to access educational material don’t mean anything in the labour market that requires verification of understanding through grading. As regards to universities cooperating; that might actually result in "}, {"rank": 6, "docid": "test-education-ughbuesbf-con02b", "score": 0.779914379119873, "is_gold": false, "snippet": "While there will of course be people who do not try to get the most out of their university educations, what matters is that everyone has access to it. It is a fair trade between inefficiencies created by inattentive students and diligent students who would ha"}, {"rank": 7, "docid": "test-education-egtuscpih-pro02a", "score": 0.7796404361724854, "is_gold": false, "snippet": "Online courses broadens access to education  Online courses can expand access to university education. University education is based on the idea of merit - that the brightest people should be enabled to learn - however in real life many different circumstances"}, {"rank": 8, "docid": "test-education-udfakusma-con03a", "score": 0.7778264284133911, "is_gold": false, "snippet": "Less incentive to study at university  If everything that University provides is open to all then there is less incentive to study at university. Anyone who is studying in order to learn about a subject rather than achieve a particular qualification will no lo"}, {"rank": 9, "docid": "test-education-udfakusma-pro02a", "score": 0.7765885591506958, "is_gold": false, "snippet": "Most universities are publically funded so should have to be open with their materials.  The United States University system is famously expensive and as a result it is probably the system in a developed country that has least public funding yet $346.8billion "}, {"rank": 10, "docid": "training-education-uhwecpuu-con01a", "score": 0.7644609212875366, "is_gold": false, "snippet": "Allowing universities to be guided by an invisible hand does more harm than good  University degree programmes, unlike other products like televisions or designer shoes, are tools of social mobility: unlike a TV, a good degree will help you to get other good t"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-gmehwasr-con04a", "query": "Possibility of being drawn into a long drawn out conflict  Even just providing the rebels with arms risks drawing the powers that supply those arms into the conflict. [1] This is because it gives the intervening power a stake in the conflict. Once weapons have been supplied allowing the Syrian government to reassert control would be a large foreign policy reversal and would damage relations with the Syrian government for years to come.  We need only look at the Vietnam conflict to know that what starts out as a very small commitment can rapidly escalate when the government decides it cannot afford to back down. What starts as just arming the rebels could quickly lead to troops on the ground. Indeed it might require men on the ground right from the start as if we were to be providing heavy weapons the rebels would need training in how to use those weapons if they are to seriously be considered an equaliser.  [1] Byman, Daniel, in ‘Roundtable: arming the Syrian rebels’, Foreign Policy, 21 February 2013", "gold_docid": "test-international-gmehwasr-con04b", "rank_T": 14, "rank_baseline": 6, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-gmehwasr-con04a", "score": 0.8618924021720886, "is_gold": false, "snippet": "Possibility of being drawn into a long drawn out conflict  Even just providing the rebels with arms risks drawing the powers that supply those arms into the conflict. [1] This is because it gives the intervening power a stake in the conflict. Once weapons have"}, {"rank": 2, "docid": "test-international-gmehwasr-pro05b", "score": 0.7136548757553101, "is_gold": false, "snippet": "Simply because there is stalemate in diplomacy and on the ground does not make arming the rebels the option that should now be taken, indeed it does not mean that outside powers need to take any action at all. Those with Syria's best interests at heart would r"}, {"rank": 3, "docid": "test-international-gmehwasr-con05a", "score": 0.7006396055221558, "is_gold": false, "snippet": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even t"}, {"rank": 4, "docid": "test-international-gmehwasr-pro01b", "score": 0.6924712657928467, "is_gold": false, "snippet": "The if the rebels are armed and the regime gets close to losing surely it will simply increase the bloodshed and have greater motive to use its chemical and biological weapons. Therefore arming either side simply increases the potential for killing. A balance "}, {"rank": 5, "docid": "training-international-mesimhbgs-con03b", "score": 0.690081000328064, "is_gold": false, "snippet": "The effort to fund and arm the rebels has not shown any result, it’s been over 4 years and yet nothing has solved the problem. Rather the situation has got steadily worse with moderate opposition first losing out to Daesh, and then to Assad since Russian air s"}, {"rank": 6, "docid": "test-international-gmehwasr-pro04b", "score": 0.6673555970191956, "is_gold": false, "snippet": "Balance in this case would not be a good thing as this would simply mean a much longer continuation of a bloody civil war. The longer the conflict continues the more difficult it is to put Syria back together again when peace finally does arrive."}, {"rank": 7, "docid": "test-international-gmehwasr-con03b", "score": 0.6646683812141418, "is_gold": false, "snippet": "This is a pointless argument; the consequences of inaction are just unknowable. Doing nothing could lead to exactly the same consequences. Alternatively arming the moderates could speed the end to the civil war and the creation of a democratic state."}, {"rank": 8, "docid": "training-international-mepdwhwhwi-con01b", "score": 0.6614639759063721, "is_gold": false, "snippet": "Conflict would not break out if the inspectors left; that point has passed. Now if the inspectors left it is likely that nothing would happen. Clearly the better option is for there to be significant pressure on Syria and Assad to bring about peace in the coun"}, {"rank": 9, "docid": "validation-law-hrilppwhb-con01b", "score": 0.6614214777946472, "is_gold": false, "snippet": "The problem with fears of fuelling the conflict further is that the conflict is already almost as large as it can be within the borders of Syria, and has already spilled over in to neighbouring Lebanon, with bombings in Tripoli and Beirut) – it is a full scale"}, {"rank": 10, "docid": "test-international-gmehwasr-con05b", "score": 0.6587466597557068, "is_gold": false, "snippet": "We cannot know whether this policy will work until it is tried. The Free Syrian Army has been remarkably successful so far capturing large swathes of the country and taking the fight to the regime in the capital Damascus. [1] With more sophisticated weaponry t"}], "topK_baseline": [{"rank": 1, "docid": "test-international-gmehwasr-con04a", "score": 1.0, "is_gold": false, "snippet": "Possibility of being drawn into a long drawn out conflict  Even just providing the rebels with arms risks drawing the powers that supply those arms into the conflict. [1] This is because it gives the intervening power a stake in the conflict. Once weapons have"}, {"rank": 2, "docid": "test-international-gmehwasr-pro01b", "score": 0.7861306071281433, "is_gold": false, "snippet": "The if the rebels are armed and the regime gets close to losing surely it will simply increase the bloodshed and have greater motive to use its chemical and biological weapons. Therefore arming either side simply increases the potential for killing. A balance "}, {"rank": 3, "docid": "test-international-gmehwasr-pro05b", "score": 0.7849805951118469, "is_gold": false, "snippet": "Simply because there is stalemate in diplomacy and on the ground does not make arming the rebels the option that should now be taken, indeed it does not mean that outside powers need to take any action at all. Those with Syria's best interests at heart would r"}, {"rank": 4, "docid": "test-international-gmehwasr-con05a", "score": 0.781621515750885, "is_gold": false, "snippet": "Would it work?  The most fundamental question for any policy is whether it would actually work if implemented? In this case it seems to be doubtful that in practice arming the rebels would be enough to allow them to prevail. It will simply be helping to even t"}, {"rank": 5, "docid": "test-international-gmehwasr-pro04b", "score": 0.7791136503219604, "is_gold": false, "snippet": "Balance in this case would not be a good thing as this would simply mean a much longer continuation of a bloody civil war. The longer the conflict continues the more difficult it is to put Syria back together again when peace finally does arrive."}, {"rank": 6, "docid": "test-international-gmehwasr-con04b", "score": 0.7752346992492676, "is_gold": true, "snippet": "The strategic situation in Syria is nothing like that which meant the US felt it could not withdraw from Vietnam. There is no line of 'dominos' that could be knocked over in a row as a result of a victory by the Syrian government. Far from it, some of Syria's "}, {"rank": 7, "docid": "training-international-mesimhbgs-con03b", "score": 0.7670029997825623, "is_gold": false, "snippet": "The effort to fund and arm the rebels has not shown any result, it’s been over 4 years and yet nothing has solved the problem. Rather the situation has got steadily worse with moderate opposition first losing out to Daesh, and then to Assad since Russian air s"}, {"rank": 8, "docid": "training-law-rgmelhrpwhbw-pro02b", "score": 0.7546824216842651, "is_gold": false, "snippet": "Although it is true that Bashar al-Assad has very strong entrenched powers of control in Syria, there are less risky and damaging ways to undermine this to help support the domestic opposition movements if this is your aim. The crux of this case comes down to "}, {"rank": 9, "docid": "test-international-gmehwasr-con02a", "score": 0.7479963302612305, "is_gold": false, "snippet": "Arming the rebels would be unpopular  Ten years after the Iraq war interventions in the Middle East are no more popular than they were back in 2003. Getting involved in Syria would not be popular no matter how small the commitment. In the United States voters "}, {"rank": 10, "docid": "test-international-gmehwasr-con03b", "score": 0.746641993522644, "is_gold": false, "snippet": "This is a pointless argument; the consequences of inaction are just unknowable. Doing nothing could lead to exactly the same consequences. Alternatively arming the moderates could speed the end to the civil war and the creation of a democratic state."}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-epdlhfcefp-pro01a", "query": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, the EU itself has created new institutional bodies such as the Political and Security Committee, a Military Committee and military staff. The EU has had military envoys in Macedonia and Bosnia-Herzegovina and has committed itself to the creation of a Common Security and Defense Policy with 3-4,000 troops on permanent standby in multilateral ‘battlegroups’ ready for immediate deployment(see Rockwell Schnabel’s article listed below)1. While incremental, these are steps not to be ignored. The Union has also placed that military capacity within the broader context of a security strategy designed to promote international peace, justice and development.  1. Schnabel, Rockwell A., 'U.S. Views on the EU Common Foreign and Security Policy', The Brown Journal of World Affairs, Vol. IX. Issue2., (Winter/Spring 2003) accessed 1/8/11", "gold_docid": "test-international-epdlhfcefp-pro01b", "rank_T": 11, "rank_baseline": 3, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-epdlhfcefp-pro01a", "score": 0.8602287173271179, "is_gold": false, "snippet": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, th"}, {"rank": 2, "docid": "training-international-epdghwcseu-pro02b", "score": 0.7507662773132324, "is_gold": false, "snippet": "We have seen variations in opinion regarding political and economic issues (e.g. monetary union) in the EU. In the far more thorny area of defence policy, the EU member-nations’ interests are even more divergent. For example, the French position on Algeria may"}, {"rank": 3, "docid": "test-politics-oepdlhfcefp-con01b", "score": 0.7416582703590393, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 4, "docid": "test-international-epdlhfcefp-con01b", "score": 0.7416582703590393, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 5, "docid": "test-international-epdlhfcefp-con03a", "score": 0.7381630539894104, "is_gold": false, "snippet": "There have been tests on the EU's ability to create a common foreign policy that it has failed.  The War in Iraq, along with previous notable failures to deal with the breakup of former Yugoslavia, has been an excellent test for the extent to which the EU can "}, {"rank": 6, "docid": "test-politics-oepdlhfcefp-pro02b", "score": 0.7379394173622131, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 7, "docid": "test-international-epdlhfcefp-pro02b", "score": 0.7379394173622131, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 8, "docid": "training-international-epdtwhblew-con01b", "score": 0.7362520098686218, "is_gold": false, "snippet": "The EU simply adds to an alphabet soup of organisations that work on security in Europe. The two which matter, NATO and EUROPOL, both have little to do with the EU and would work just as well with the UK out."}, {"rank": 9, "docid": "training-international-epdghwcseu-pro05b", "score": 0.73589026927948, "is_gold": false, "snippet": "Although there is instability in neighbouring regions, most of Europe is in complete and utter peace. The new force would simply be another layer of defence in a stable continent that simply doesn’t need it. War in Europe is completely inconceivable in the 21s"}, {"rank": 10, "docid": "test-politics-oepdlhfcefp-pro01b", "score": 0.7349036931991577, "is_gold": false, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}], "topK_baseline": [{"rank": 1, "docid": "test-international-epdlhfcefp-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, th"}, {"rank": 2, "docid": "test-politics-oepdlhfcefp-pro01b", "score": 0.8491350412368774, "is_gold": false, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}, {"rank": 3, "docid": "test-international-epdlhfcefp-pro01b", "score": 0.8491350412368774, "is_gold": true, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}, {"rank": 4, "docid": "test-politics-oepdlhfcefp-pro02b", "score": 0.8309175968170166, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 5, "docid": "test-international-epdlhfcefp-pro02b", "score": 0.8309175968170166, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 6, "docid": "test-politics-oepdlhfcefp-con02b", "score": 0.8224905133247375, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 7, "docid": "test-international-epdlhfcefp-con02b", "score": 0.8224905133247375, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 8, "docid": "test-politics-oepdlhfcefp-con01b", "score": 0.8212215900421143, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 9, "docid": "test-international-epdlhfcefp-con01b", "score": 0.8212215900421143, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 10, "docid": "test-international-epdlhfcefp-con03a", "score": 0.8196592330932617, "is_gold": false, "snippet": "There have been tests on the EU's ability to create a common foreign policy that it has failed.  The War in Iraq, along with previous notable failures to deal with the breakup of former Yugoslavia, has been an excellent test for the extent to which the EU can "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-politics-oepdlhfcefp-pro01a", "query": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, the EU itself has created new institutional bodies such as the Political and Security Committee, a Military Committee and military staff. The EU has had military envoys in Macedonia and Bosnia-Herzegovina and has committed itself to the creation of a Common Security and Defense Policy with 3-4,000 troops on permanent standby in multilateral ‘battlegroups’ ready for immediate deployment(see Rockwell Schnabel’s article listed below)1. While incremental, these are steps not to be ignored. The Union has also placed that military capacity within the broader context of a security strategy designed to promote international peace, justice and development.  1. Schnabel, Rockwell A., 'U.S. Views on the EU Common Foreign and Security Policy', The Brown Journal of World Affairs, Vol. IX. Issue2., (Winter/Spring 2003) accessed 1/8/11", "gold_docid": "test-politics-oepdlhfcefp-pro01b", "rank_T": 10, "rank_baseline": 2, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-epdlhfcefp-pro01a", "score": 0.8602287173271179, "is_gold": false, "snippet": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, th"}, {"rank": 2, "docid": "training-international-epdghwcseu-pro02b", "score": 0.7507662773132324, "is_gold": false, "snippet": "We have seen variations in opinion regarding political and economic issues (e.g. monetary union) in the EU. In the far more thorny area of defence policy, the EU member-nations’ interests are even more divergent. For example, the French position on Algeria may"}, {"rank": 3, "docid": "test-politics-oepdlhfcefp-con01b", "score": 0.7416582703590393, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 4, "docid": "test-international-epdlhfcefp-con01b", "score": 0.7416582703590393, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 5, "docid": "test-international-epdlhfcefp-con03a", "score": 0.7381630539894104, "is_gold": false, "snippet": "There have been tests on the EU's ability to create a common foreign policy that it has failed.  The War in Iraq, along with previous notable failures to deal with the breakup of former Yugoslavia, has been an excellent test for the extent to which the EU can "}, {"rank": 6, "docid": "test-politics-oepdlhfcefp-pro02b", "score": 0.7379394173622131, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 7, "docid": "test-international-epdlhfcefp-pro02b", "score": 0.7379394173622131, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 8, "docid": "training-international-epdtwhblew-con01b", "score": 0.7362520098686218, "is_gold": false, "snippet": "The EU simply adds to an alphabet soup of organisations that work on security in Europe. The two which matter, NATO and EUROPOL, both have little to do with the EU and would work just as well with the UK out."}, {"rank": 9, "docid": "training-international-epdghwcseu-pro05b", "score": 0.73589026927948, "is_gold": false, "snippet": "Although there is instability in neighbouring regions, most of Europe is in complete and utter peace. The new force would simply be another layer of defence in a stable continent that simply doesn’t need it. War in Europe is completely inconceivable in the 21s"}, {"rank": 10, "docid": "test-politics-oepdlhfcefp-pro01b", "score": 0.7349036931991577, "is_gold": true, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}], "topK_baseline": [{"rank": 1, "docid": "test-international-epdlhfcefp-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "The EU has already been unifying on multiple fronts, this is just a step in the same direction.  The EU has slowly been building up its own common military framework, with the UK and France leading the effort to pool European military capacity. In addition, th"}, {"rank": 2, "docid": "test-politics-oepdlhfcefp-pro01b", "score": 0.8491350412368774, "is_gold": true, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}, {"rank": 3, "docid": "test-international-epdlhfcefp-pro01b", "score": 0.8491350412368774, "is_gold": false, "snippet": "The very creation of a common military framework has been fraught with disagreement. The UK and France have only been willing to cooperate bilaterally and outside the EU framework, within a set of nationally-framed security interests. Both states are also very"}, {"rank": 4, "docid": "test-politics-oepdlhfcefp-pro02b", "score": 0.8309175968170166, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 5, "docid": "test-international-epdlhfcefp-pro02b", "score": 0.8309175968170166, "is_gold": false, "snippet": "Consultation, collaboration and the attempted creation of a common set of values has not worked and is not likely to work. This language is not much different from what we have heard with every attempt the EU has made to push for further political integration."}, {"rank": 6, "docid": "test-politics-oepdlhfcefp-con02b", "score": 0.8224905133247375, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 7, "docid": "test-international-epdlhfcefp-con02b", "score": 0.8224905133247375, "is_gold": false, "snippet": "Creating a common EU foreign and security policy will in fact be easier than many people suppose, because many of the 21st century’s most important issues in external relations are already part of the ‘normal’ EU policy routine; climate change, development, tr"}, {"rank": 8, "docid": "test-politics-oepdlhfcefp-con01b", "score": 0.8212215900421143, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 9, "docid": "test-international-epdlhfcefp-con01b", "score": 0.8212215900421143, "is_gold": false, "snippet": "One should not forget that a uniting Europe in itself has been a very bold undertaking that has taken several centuries to develop, and is certainly far from being a finished product. It would be unfair to argue that the EU has made no progress in its collabor"}, {"rank": 10, "docid": "test-international-epdlhfcefp-con03a", "score": 0.8196592330932617, "is_gold": false, "snippet": "There have been tests on the EU's ability to create a common foreign policy that it has failed.  The War in Iraq, along with previous notable failures to deal with the breakup of former Yugoslavia, has been an excellent test for the extent to which the EU can "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-digital-freedoms-eifpgdff-con02a", "query": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coordinated responses. One type of crime that has particularly become a problem on the internet is child sexual abuse material: the internet allows for an easy and anonymous distribution method which can even be secured by modern encryption methods. [1]  Governments can help fight this by requiring ISPs and mobile companies to track people’s internet histories, hand over data when requested, and allow police to get information from them without a search warrant, something which has been proposed by the Canadian government. [2] In Australia, the government even proposed mandatory filtering of all internet traffic by ISPs to automatically filter out all child sexual abuse material. [3]  Admittedly, these measures seem drastic – but in cases like these, or similar cases like terrorism, the harm prevented is more important.  [1] ‘Child Pornography on the Rise, Justice Department Reports’. 2010.  [2] ‘Current laws not focused enough to combat child porn online’. 2012.  [3] Mcmenamin, Bernadette, ‘Filters needed to battle child porn’. 2008.", "gold_docid": "test-digital-freedoms-eifpgdff-con02b", "rank_T": 9, "rank_baseline": 2, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con02a", "score": 0.8431384563446045, "is_gold": false, "snippet": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coor"}, {"rank": 2, "docid": "training-digital-freedoms-aihbied-con03b", "score": 0.6690587401390076, "is_gold": false, "snippet": "With any tool there are going to be people who misuse it, yet cases of misuse do not outweigh times when the internet has proven to be an important force for democracy. Internet and SMS have helped to organize almost every uprising in the Middle East and the O"}, {"rank": 3, "docid": "training-international-eptcphbg-con03b", "score": 0.6541376709938049, "is_gold": false, "snippet": "If countries will not act on narrow issues involving privacy freedoms and internet surveillance even when their head of government is on the receiving end then what hope is there for the broader picture? There is no point in proclaiming everyone should follow "}, {"rank": 4, "docid": "training-law-cplghrhwrgo-con02b", "score": 0.6536546945571899, "is_gold": false, "snippet": "It is obvious that warrantless tracking of citizens is not the only way to fight crime. There are other ways which do not negatively impact the citizens to such an extent.  When talking exclusively about protection, the government could have better trained pol"}, {"rank": 5, "docid": "test-international-gsciidffe-con04b", "score": 0.6525901556015015, "is_gold": false, "snippet": "The NATO manual does specifically state “network intrusions, the deletion or destruction of data… computer network exploitation, and data theft do not amount to a non-international armed conflict.” [1] Instead it has to be persistent, and be carried out by org"}, {"rank": 6, "docid": "training-science-ciidffehwa-pro05b", "score": 0.6515076756477356, "is_gold": false, "snippet": "Putting the power to censor the internet, no matter how stringent or specific the guidelines, into the hands of a private organization is misguided. It is the state not individual ISPs who are needed to assess how dangerous a site is, whether it is actually pr"}, {"rank": 7, "docid": "test-science-ciidfaihwc-con02b", "score": 0.6495128870010376, "is_gold": false, "snippet": "The Internet may be a global resource, but if information on it is have a detrimental effect upon a particular country, it certainly is that government’s responsibility and right to tackle it. If it affects their society and the citizens within it, it affects "}, {"rank": 8, "docid": "training-politics-dwdfiphwut-con03b", "score": 0.6415159106254578, "is_gold": false, "snippet": "Cooperation is not a helpful alternative as it really means status quo when we can see that the status quo is not going to reduce cyber-attacks or bring recompense. Rather this is precisely what sanctions are needed for; to encourage states that harbour cyber "}, {"rank": 9, "docid": "test-digital-freedoms-eifpgdff-con02b", "score": 0.6379610896110535, "is_gold": true, "snippet": "Battling hideous crimes shouldn’t lead us to draconian and ineffective policies  Everyone is against child sexual abuse material. But in their drive to battle it, governments might go too far. For example, granting the police the right to search without (full)"}, {"rank": 10, "docid": "training-digital-freedoms-gtdfais-pro03b", "score": 0.6369944214820862, "is_gold": false, "snippet": "Other means can be employed to ensure the safety of the population without disrupting access to the internet, like deploying security forces to make sure protests don’t get out of hand or turn violent. In fact, being able to monitor online activity through soc"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-eifpgdff-con02a", "score": 1.0, "is_gold": false, "snippet": "Internet governance is necessary to combat heinous crimes committed via the internet  The internet is a means of communication – therefore also a means of communication between criminals. And because it is global it creates global crime problems that need coor"}, {"rank": 2, "docid": "test-digital-freedoms-eifpgdff-con02b", "score": 0.7847515940666199, "is_gold": true, "snippet": "Battling hideous crimes shouldn’t lead us to draconian and ineffective policies  Everyone is against child sexual abuse material. But in their drive to battle it, governments might go too far. For example, granting the police the right to search without (full)"}, {"rank": 3, "docid": "test-digital-freedoms-eifpgdff-con01a", "score": 0.7679726481437683, "is_gold": false, "snippet": "Internet regulation is necessary to ensure a safe internet  Citizens, corporations, and public organizations face several security threats when online: critical infrastructure systems can be hacked, like the energy transport system, [1] citizens can fall victi"}, {"rank": 4, "docid": "training-digital-freedoms-aihbied-con03b", "score": 0.765579879283905, "is_gold": false, "snippet": "With any tool there are going to be people who misuse it, yet cases of misuse do not outweigh times when the internet has proven to be an important force for democracy. Internet and SMS have helped to organize almost every uprising in the Middle East and the O"}, {"rank": 5, "docid": "training-free-speech-debate-gfsdifscp-pro03b", "score": 0.7593895792961121, "is_gold": false, "snippet": "It is not true that people cannot manage consequences from their action online. It might only seem so but that is because the issues around personal data have emerged relatively recently, so we are still learning to deal with them. Individuals are learning how"}, {"rank": 6, "docid": "test-science-ciidfaihwc-con02b", "score": 0.7591904997825623, "is_gold": false, "snippet": "The Internet may be a global resource, but if information on it is have a detrimental effect upon a particular country, it certainly is that government’s responsibility and right to tackle it. If it affects their society and the citizens within it, it affects "}, {"rank": 7, "docid": "training-digital-freedoms-gtdfais-con03a", "score": 0.7581948637962341, "is_gold": false, "snippet": "The prevention of atrocities during war and unrest.  In the past, horrific crimes could be committed in war zones without anyone ever knowing about it, or with news of it reaching the international community with a significant time lag, when it was too late to"}, {"rank": 8, "docid": "training-digital-freedoms-fehwufafra-con04b", "score": 0.7563943862915039, "is_gold": false, "snippet": "This implies that without efforts by democracies to ‘undermine’ non democratic regimes the internet would be nice and peaceful and everyone could get on with what they like doing on the internet. Nothing could be further from the truth. There is already a sign"}, {"rank": 9, "docid": "validation-science-ihbrapisbpl-con01a", "score": 0.7532660961151123, "is_gold": false, "snippet": "Internet anonymity allows internet users to engage in illegal activities  The internet is being used for illegal activities. Examples of these are trading and trafficking in child pornography, drug trading and planning and coordinating terrorist activities. [1"}, {"rank": 10, "docid": "training-digital-freedoms-gtdfais-pro03a", "score": 0.752027690410614, "is_gold": false, "snippet": "The internet as a threat to public safety.  The internet can be used as a tool to create an imminent threat to the public. If public officials had information that a massive protest is being organized, which could spiral into violence and endanger the safety o"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-politics-ypppgvhwmv-pro03a", "query": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting will potentially encourage voters to research the candidates' political positions more thoroughly. This may force candidates to be more open and transparent about their positions on many complex and controversial issues. Citizens will be willing to inform themselves even about unpopular policies and burning issues that need to be tackled. Better-informed voters will, therefore, oppose a plan that is unrealistic or would present an unnecessary budget-drain. This means that such a system could produce better political decisions that are not contradicting each other, quite upon the contrary.  1 Peter Tucker, The median Australian voter and the values that influence their vote choice presented by the author at the 3rd European Consortium for Political Research Conference in Budapest, September 10, 2005.", "gold_docid": "test-politics-ypppgvhwmv-pro03b", "rank_T": 12, "rank_baseline": 5, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-politics-ypppgvhwmv-pro03a", "score": 0.8542490601539612, "is_gold": false, "snippet": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting"}, {"rank": 2, "docid": "test-politics-ypppgvhwmv-con01b", "score": 0.7709383964538574, "is_gold": false, "snippet": "As noted elsewhere, forced attendance would lead to increased political awareness, and an abstention option would offer a 'none of the above'/'I don't mind or care' choice instead of people spoiling the ballot.  Because the number of voters would increase, pol"}, {"rank": 3, "docid": "test-politics-ypppgvhwmv-con03b", "score": 0.7536108493804932, "is_gold": false, "snippet": "The benefits obtained from compulsory voting cannot be gained from any of the strategies mentioned by the opposition. Compulsory voting can enhance a sense of community, as everyone is in it together. This can be especially helpful in bringing new people in to"}, {"rank": 4, "docid": "test-politics-ypppgvhwmv-con01a", "score": 0.7349444031715393, "is_gold": false, "snippet": "Persuasion is more effective than coercion  Forcing people into voting when they are disengaged from the politic process will exacerbate this problem; no one likes doing something simply because they have to. The election results from compulsory voting may not"}, {"rank": 5, "docid": "test-politics-ypppgvhwmv-pro02b", "score": 0.7306305766105652, "is_gold": false, "snippet": "This idea is nonsense. Political parties do try and capture the ‘disadvantaged groups’ vote, specifically in order to convince them that voting is in their best interest. As opposed to compulsory voting, a voluntary system in fact encourages political parties "}, {"rank": 6, "docid": "validation-digital-freedoms-gthwaueai-con03b", "score": 0.7277438640594482, "is_gold": false, "snippet": "It is impossible to tackle potential problems in party politics without an input from the electorate. Young people may have the opinion that politics itself is inaccessible, but this will never change if they refuse or fail to vote. A democratic government can"}, {"rank": 7, "docid": "training-politics-viwvfpps-pro01b", "score": 0.7238662242889404, "is_gold": false, "snippet": "Many voters are making an active choice when they decide not to vote, they are either showing that they recognise how little impact their vote will have, or else that they do not believe that it is worth their while spending the time to vote. [1] Finally even "}, {"rank": 8, "docid": "training-politics-pgglgvhciu-pro03b", "score": 0.7170318961143494, "is_gold": false, "snippet": "Most people are apathetic about politics because they find it dull or do not believe that it affects them. This may be regrettable but it is hard to see how increasing the number of votes they are asked to participate in will have a positive effect on this tre"}, {"rank": 9, "docid": "training-politics-pggllgvhwa-pro03b", "score": 0.711809515953064, "is_gold": false, "snippet": "There is no reason to assume that there will be an increase in political engagement. Votes will simply not count in different ways. If there are more coalitions, people could feel their vote doesn’t count even more strongly, as they will see that the parties t"}, {"rank": 10, "docid": "training-politics-pggllgvhwa-pro03a", "score": 0.7020488977432251, "is_gold": false, "snippet": "PR increases political engagement which benefits society.  PR results in more engagement in politics as every vote counts (CPA/Wilton Park conference, ‘How can Parliamentarians best re-engage the public?’). Political participation is good and we should care ab"}], "topK_baseline": [{"rank": 1, "docid": "test-politics-ypppgvhwmv-pro03a", "score": 1.0, "is_gold": false, "snippet": "It will cause more people to become interested in politics  Compulsory voting increases the number of people who cast their vote 1. People who know they will have to vote will take politics more seriously and start to take a more active role. Compulsory voting"}, {"rank": 2, "docid": "test-politics-ypppgvhwmv-con03b", "score": 0.8634380102157593, "is_gold": false, "snippet": "The benefits obtained from compulsory voting cannot be gained from any of the strategies mentioned by the opposition. Compulsory voting can enhance a sense of community, as everyone is in it together. This can be especially helpful in bringing new people in to"}, {"rank": 3, "docid": "test-politics-ypppgvhwmv-con01a", "score": 0.8495507836341858, "is_gold": false, "snippet": "Persuasion is more effective than coercion  Forcing people into voting when they are disengaged from the politic process will exacerbate this problem; no one likes doing something simply because they have to. The election results from compulsory voting may not"}, {"rank": 4, "docid": "test-politics-ypppgvhwmv-con01b", "score": 0.8387579917907715, "is_gold": false, "snippet": "As noted elsewhere, forced attendance would lead to increased political awareness, and an abstention option would offer a 'none of the above'/'I don't mind or care' choice instead of people spoiling the ballot.  Because the number of voters would increase, pol"}, {"rank": 5, "docid": "test-politics-ypppgvhwmv-pro03b", "score": 0.8271800875663757, "is_gold": true, "snippet": "Forcing the population to vote will not stop people expressing their wish not to vote. Tucker notes that in Australia 5% of eligible voters did not caste a valid vote. Most countries that use compulsory voting give voters a legal opportunity to abstain. For ex"}, {"rank": 6, "docid": "test-politics-ypppgvhwmv-pro02b", "score": 0.8138004541397095, "is_gold": false, "snippet": "This idea is nonsense. Political parties do try and capture the ‘disadvantaged groups’ vote, specifically in order to convince them that voting is in their best interest. As opposed to compulsory voting, a voluntary system in fact encourages political parties "}, {"rank": 7, "docid": "test-politics-ypppgvhwmv-pro02a", "score": 0.802696704864502, "is_gold": false, "snippet": "Compulsory voting broadens representation of disadvantaged groups  Voter apathy is highest among the poorest and most excluded sectors of society. As the Institute for Public Policy Research highlight, “the higher the income a citizen enjoys, and the higher th"}, {"rank": 8, "docid": "test-politics-ypppgvhwmv-con03a", "score": 0.7884566187858582, "is_gold": false, "snippet": "There are alternatives that tackle the real causes of voter disengagement  Compulsory voting hides the problem which is causing people to be disengaged from politics; it allows politicians to ignore measures that can tackle the true causes of political disenga"}, {"rank": 9, "docid": "test-politics-ypppgvhwmv-con02b", "score": 0.7874851226806641, "is_gold": false, "snippet": "Because mandatory voting means that no large campaign funds are needed to goad voters to the polls, the role of money in politics will decrease. Compulsory voting will reduce spending such as campaign spending on voter turnout. It can also lead to a reduction "}, {"rank": 10, "docid": "training-politics-pgglgvhciu-pro03b", "score": 0.7862293720245361, "is_gold": false, "snippet": "Most people are apathetic about politics because they find it dull or do not believe that it affects them. This may be regrettable but it is hard to see how increasing the number of votes they are asked to participate in will have a positive effect on this tre"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-international-bmaggiahbl-con03a", "query": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state in East Africa [1] where everyone is accountable and equal before the law.  How can this be without an aggressive free press? Annually, all government officials are cross examined by locals publicly in a forum called national dialogue “Umushyikirano”, to ensure that they meet the needs of citizens and assess their performance[2]. This has given Rwandans courage to express their desires and feel much valued in the process of policy making and engagement. It puts ministers and even the Prime Minister on the spot on individual issues. Restricted press and speech is therefore rendered irrelevant by such programs as people can question authorities and demand justification directly rather than relying on the press.  In Africa, most countries lack transparent government systems and institutions, a factor responsible for continued corruption, poor governance and crime which in turn destroy progress in societies [3], but this is not the case with regard to Rwanda.  [1] Zegabi East Africa news, ‘Transparency International Ranks Rwanda the Least Corrupt Country in East Africa’, 5 December 2013, zegabi.com  [2] Hunt, Swanee ‘Rebuilding Rwanda: Access and Accountability’, inclusivesecurity.org, 30 December 2013  [3] Jones Lang Lasale, ‘Sub-Saharan Africa: A region with opportunities amid transparency challenges’, joneslanglasale.eu", "gold_docid": "test-international-bmaggiahbl-con03b", "rank_T": 16, "rank_baseline": 9, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-international-bmaggiahbl-con03a", "score": 0.8408424258232117, "is_gold": false, "snippet": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state"}, {"rank": 2, "docid": "test-international-bmaggiahbl-con01b", "score": 0.7266175150871277, "is_gold": false, "snippet": "Restricted press and speech also limits political debate and engagement which are crucially needed in adopting fruitful policies[1]. The best policies are those that are rigorously debated and analysed. The current leadership may have acted to check corruption"}, {"rank": 3, "docid": "test-international-bmaggiahbl-pro01b", "score": 0.6741276979446411, "is_gold": false, "snippet": "Rwanda does not limit freedoms of press and speech as such but discourages the use of sensitive articles or speeches that would provoke insecurity in a country still trying to heal from the wounds of genocide. This cannot be therefore considered abusing people"}, {"rank": 4, "docid": "training-politics-gvhbtnd-pro01b", "score": 0.6552317142486572, "is_gold": false, "snippet": "Each country should be free to decide which freedoms are important to it and fit with its own culture rather than having to fit into a western straitjacket in order to be considered ‘democratic’. It is true that press freedoms are a difficult issue but it is n"}, {"rank": 5, "docid": "test-international-bmaggiahbl-con02b", "score": 0.6395620107650757, "is_gold": false, "snippet": "While the government of Rwanda has chosen the economy this does not mean the people agree – simply that the government controls the narrative so giving the impression, or persuading them that they agree.  Restricting free speech and press has increased critics"}, {"rank": 6, "docid": "test-international-bmaggiahbl-pro03b", "score": 0.6357970833778381, "is_gold": false, "snippet": "Many donors have been deeply reluctant to stop or reduce aid, whatever the arguments over eastern Congo[1]. Donors like to see their money have an impact, something that Rwanda’s transformation has provided. There might be concern about freedom of speech and t"}, {"rank": 7, "docid": "validation-law-lgdgtihbd-pro03b", "score": 0.6332513093948364, "is_gold": false, "snippet": "The AIVD example shows exactly that judicial and political control is not enough: the judicial control is control after the fact, so it didn’t prevent the AIVD from listening in to journalists conversations in the first place. Moreover, a regulatory committee "}, {"rank": 8, "docid": "test-law-ralhrilglv-con03b", "score": 0.6283372044563293, "is_gold": false, "snippet": "Kenya does not need or want government by those who hand out illegal title deeds [1] and threaten the freedom of the press [2] as Kenyatta’s government does.  In addition to that, the allegations that the president used a banned occult gang, the Mungiki, in or"}, {"rank": 9, "docid": "test-international-bmaggiahbl-pro02a", "score": 0.6281786561012268, "is_gold": false, "snippet": "Blind obedience to authority  One of the major factors that exacerbated genocide ideology was the “AKAZU” controlled media which made most of the Hutu population wrongfully obey authority and government propaganda of divisionism[1].  This was achieved by procl"}, {"rank": 10, "docid": "test-international-bmaggiahbl-pro01a", "score": 0.6225783228874207, "is_gold": false, "snippet": "Authoritarian leadership  President Kagame though considered a visionary leader has made Rwanda a country based on one man’s ideas. He has silenced critics, opposition and any counter arguments that may not support his opinions through tough rules imposed agai"}], "topK_baseline": [{"rank": 1, "docid": "test-international-bmaggiahbl-con03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "There is accountability without a free press  Freedom of speech and the Press is not the only way of creating accountability in a country – especially a comparatively small one such as Rwanda. Rwanda has been ranked a transparent and is the least corrupt state"}, {"rank": 2, "docid": "test-international-bmaggiahbl-con01b", "score": 0.8178171515464783, "is_gold": false, "snippet": "Restricted press and speech also limits political debate and engagement which are crucially needed in adopting fruitful policies[1]. The best policies are those that are rigorously debated and analysed. The current leadership may have acted to check corruption"}, {"rank": 3, "docid": "test-international-bmaggiahbl-pro01b", "score": 0.7644727230072021, "is_gold": false, "snippet": "Rwanda does not limit freedoms of press and speech as such but discourages the use of sensitive articles or speeches that would provoke insecurity in a country still trying to heal from the wounds of genocide. This cannot be therefore considered abusing people"}, {"rank": 4, "docid": "test-international-bmaggiahbl-con02b", "score": 0.7601484656333923, "is_gold": false, "snippet": "While the government of Rwanda has chosen the economy this does not mean the people agree – simply that the government controls the narrative so giving the impression, or persuading them that they agree.  Restricting free speech and press has increased critics"}, {"rank": 5, "docid": "test-international-bmaggiahbl-pro01a", "score": 0.7546400427818298, "is_gold": false, "snippet": "Authoritarian leadership  President Kagame though considered a visionary leader has made Rwanda a country based on one man’s ideas. He has silenced critics, opposition and any counter arguments that may not support his opinions through tough rules imposed agai"}, {"rank": 6, "docid": "training-politics-gvhbtnd-pro01b", "score": 0.7509779334068298, "is_gold": false, "snippet": "Each country should be free to decide which freedoms are important to it and fit with its own culture rather than having to fit into a western straitjacket in order to be considered ‘democratic’. It is true that press freedoms are a difficult issue but it is n"}, {"rank": 7, "docid": "test-international-bmaggiahbl-con02a", "score": 0.7472900152206421, "is_gold": false, "snippet": "Setting Rwanda's priorities  Rwanda is an emerging democracy healing from the wounds of the horrific past. To achieve the set vision, there should be a priority which in this case is economic development[1].  A large number of Rwandans believe that the governm"}, {"rank": 8, "docid": "test-international-bmaggiahbl-pro02a", "score": 0.741849422454834, "is_gold": false, "snippet": "Blind obedience to authority  One of the major factors that exacerbated genocide ideology was the “AKAZU” controlled media which made most of the Hutu population wrongfully obey authority and government propaganda of divisionism[1].  This was achieved by procl"}, {"rank": 9, "docid": "test-international-bmaggiahbl-con03b", "score": 0.7416564226150513, "is_gold": true, "snippet": "It is a wrong assertion that Rwandans are valued in the process of policy making when their genuine opinions are limited to a certain level. The national dialogue is a three day event and cannot cover the concerns of more than 11 million Rwandans. Moreover whe"}, {"rank": 10, "docid": "test-international-bmaggiahbl-con01a", "score": 0.7371307611465454, "is_gold": false, "snippet": "Focused leadership  Progress in Africa has been hindered by factors like corruption, conflicts and poor infrastructure, all of which are linked to the incompetent or greedy leaders.  Rwanda is a different case, ranked among the best countries with a strong and"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-society-asfhwapg-con02a", "query": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those of conscience.  The Human Genome Project is one of the government funded projects that makes all its research freely and publicly available. They are not driven by profit and offer information on their discoveries for free enabling others to build upon their findings.  The problem with patents is that companies claim ownership without regard towards moral issues. It is purely in the pursuit of their profits that they decide not to allow others to build on their findings and make the process of discovering treatments far more difficult. An example of this is the Myriad company which, whilst holding patents on BRCA 1 &amp; 2, genes connected with breast cancer, prevented the University of Pennsylvania from using a test for these genes which was substantially cheaper than the company’s own screening procedure. 1  Instead of protecting their research investment, companies should have a moral duty to facilitate in any way they can to the development of cheap, available treatments and screenings for diseases which are so dangerous to so many people.  1. Spektor, Michelle, \"Genes Are Still Patentable, Federal Appeals Court Rules\", Science Progress, 17 August 2011,", "gold_docid": "test-society-asfhwapg-con02b", "rank_T": 10, "rank_baseline": 3, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-society-asfhwapg-con02a", "score": 0.8622831702232361, "is_gold": false, "snippet": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those "}, {"rank": 2, "docid": "test-society-asfhwapg-pro02b", "score": 0.7812716960906982, "is_gold": false, "snippet": "In the twenty years of a patent’s duration, any prospective research is carried out in fear of recriminations and law-suits from the patent-holder. Laboratories offering patented genetic tests for research studies have been asked to “cease and desist” unless t"}, {"rank": 3, "docid": "test-society-asfhwapg-pro01b", "score": 0.7571414709091187, "is_gold": false, "snippet": "Of course genes should be treated different from any product or other invention; genes are the very basis for human life and to claim that anyone has the right to be regarded as the ‘owner’ of a particular gene, which we all share in our bodies, shows a venal "}, {"rank": 4, "docid": "test-society-asfhwapg-con01b", "score": 0.7530450820922852, "is_gold": false, "snippet": "Firstly, it is not self-evident, that people have a right to use and possess something, such as medicine that they did not create.So why should people have the right to use a product that someone else discovered through the power of their own cognitive abiliti"}, {"rank": 5, "docid": "test-society-asfhwapg-con03b", "score": 0.7441343069076538, "is_gold": false, "snippet": "We are happy to put a price on our ideas and knowledge, which are as much building blocks of life as our genes. Each individual already sells his ideas and has a price tag so patenting makes no further devaluation than that which is already there.Even if owner"}, {"rank": 6, "docid": "test-health-dhghwapgd-con02b", "score": 0.7395134568214417, "is_gold": false, "snippet": "If firms are afraid their formulae will be stolen, then they should keep them hidden. Otherwise, they should seek to make their new drug public, benefiting everyone so that the most people possible can have access to them. The release of ideas is most bountifu"}, {"rank": 7, "docid": "test-health-dhghwapgd-pro01b", "score": 0.723309338092804, "is_gold": false, "snippet": "There is nothing unjust about the patent system. It protects everyone equally. The nature of democracy is such that people are allowed to express their opinions and to organize to further certain aims. Drug companies have a particular interest in protecting th"}, {"rank": 8, "docid": "test-health-dhghhbampt-con02a", "score": 0.715276837348938, "is_gold": false, "snippet": "The pharmaceutical and medical industries are worth billions of dollars annually. They have an interest in ignoring the efficacy of remedies that are, for the most part, free or considerably cheaper  It’s understandable that the medical establishment has an in"}, {"rank": 9, "docid": "test-society-asfhwapg-con04a", "score": 0.7128288745880127, "is_gold": false, "snippet": "A liability regime not patents.  There are alternatives to the kind of blanket patenting that stifles innovation and drives up prices . The most obvious is to have no patents at all for genes which would result in a free for all but might have the result the p"}, {"rank": 10, "docid": "test-society-asfhwapg-con02b", "score": 0.7105932831764221, "is_gold": true, "snippet": "Patenting in general is creating more possibilities for patients than if there was no patenting and less competition for development. Even if treatments and diagnostics for some diseases are expensive, they are at least there and are beginning to benefit the p"}], "topK_baseline": [{"rank": 1, "docid": "test-society-asfhwapg-con02a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Patenting inhibits research and therapeutics  The prevailing belief is that this is an area of such great importance and potential benefit to mankind, as such there should be no, self-interested impediment to genome research. The only barriers should be those "}, {"rank": 2, "docid": "test-society-asfhwapg-pro02b", "score": 0.8157227635383606, "is_gold": false, "snippet": "In the twenty years of a patent’s duration, any prospective research is carried out in fear of recriminations and law-suits from the patent-holder. Laboratories offering patented genetic tests for research studies have been asked to “cease and desist” unless t"}, {"rank": 3, "docid": "test-society-asfhwapg-con02b", "score": 0.8151764273643494, "is_gold": true, "snippet": "Patenting in general is creating more possibilities for patients than if there was no patenting and less competition for development. Even if treatments and diagnostics for some diseases are expensive, they are at least there and are beginning to benefit the p"}, {"rank": 4, "docid": "test-society-asfhwapg-con03b", "score": 0.8106472492218018, "is_gold": false, "snippet": "We are happy to put a price on our ideas and knowledge, which are as much building blocks of life as our genes. Each individual already sells his ideas and has a price tag so patenting makes no further devaluation than that which is already there.Even if owner"}, {"rank": 5, "docid": "test-society-asfhwapg-con01b", "score": 0.8094020485877991, "is_gold": false, "snippet": "Firstly, it is not self-evident, that people have a right to use and possess something, such as medicine that they did not create.So why should people have the right to use a product that someone else discovered through the power of their own cognitive abiliti"}, {"rank": 6, "docid": "test-society-asfhwapg-pro01a", "score": 0.8001664876937866, "is_gold": false, "snippet": "Genes are intellectual property thus patentable  The patenting office stipulates that a successful patent applicant must have found something in nature, isolated it, and found a way to make something useful with it.The genome research of companies satisfies th"}, {"rank": 7, "docid": "test-society-asfhwapg-pro01b", "score": 0.7914475798606873, "is_gold": false, "snippet": "Of course genes should be treated different from any product or other invention; genes are the very basis for human life and to claim that anyone has the right to be regarded as the ‘owner’ of a particular gene, which we all share in our bodies, shows a venal "}, {"rank": 8, "docid": "test-health-dhghwapgd-con02b", "score": 0.7897857427597046, "is_gold": false, "snippet": "If firms are afraid their formulae will be stolen, then they should keep them hidden. Otherwise, they should seek to make their new drug public, benefiting everyone so that the most people possible can have access to them. The release of ideas is most bountifu"}, {"rank": 9, "docid": "test-society-asfhwapg-con01a", "score": 0.789729654788971, "is_gold": false, "snippet": "Patenting drives up the cost of therapies and renders them unaffordable to the poor  The government and its laws should take care of all their people. Because the state is a construct built by all the people, who all pay taxes to support it, laws should also b"}, {"rank": 10, "docid": "test-health-dhghwapgd-con04a", "score": 0.781156063079834, "is_gold": false, "snippet": "Robust drug patent laws incentivize investment of time and money in developing new products  When a real chance of profit exists in the development of a new product or drug, people and firms put the effort into developing and creating them. The incentive to pr"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-society-simhbrasnba-con03a", "query": "We must practice what we preach  Democratic nations preach the language of freedom, human rights and justice. They encourage those who live under oppression to oppose their rulers and work towards these goals. This is all rendered hollow, and hypocritical if they then refuse to protect individuals who are persecuted for taking the brave and noble step of working to improve their societies. Not only is this a moral failing but practically very harmful too. It is in the interests of democratic nations to spread democracy and peaceful forms of government. If the people of authoritarian nations don't feel they have the support of other, then the incentive for them to risk everything and stand up in the name of freedom is diminished, and so too the best chance of change in such oppressive regimes.", "gold_docid": "test-society-simhbrasnba-con03b", "rank_T": 11, "rank_baseline": 5, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-society-simhbrasnba-con03a", "score": 0.8560997247695923, "is_gold": false, "snippet": "We must practice what we preach  Democratic nations preach the language of freedom, human rights and justice. They encourage those who live under oppression to oppose their rulers and work towards these goals. This is all rendered hollow, and hypocritical if t"}, {"rank": 2, "docid": "test-international-gsciidffe-pro02b", "score": 0.6903162002563477, "is_gold": false, "snippet": "It is not up to outside powers to decide what is and what is not in the interest of any peoples but their own. While those attempting to circumvent censorship may see themselves as promoting some kind of universal human rights in practice they are pushing thei"}, {"rank": 3, "docid": "training-free-speech-debate-ldigrrg-con02b", "score": 0.6856166124343872, "is_gold": false, "snippet": "An objective being difficult does not mean it is not worthwhile pursuing it. In the case of Egypt it may now be a democracy but it is certainly not a tolerant society – it would therefore be wrong for supporters to say job done and stop supporting change. Yes "}, {"rank": 4, "docid": "test-politics-gvhbhlsbr-con03b", "score": 0.6748459935188293, "is_gold": false, "snippet": "The fear of controversy or of an ‘unworkable’ government is not reason to stall reform. If we adopt the stance that a government knows best or if we excuse a government to override the will of its people in the name of the greater good, then we pave the way fo"}, {"rank": 5, "docid": "training-free-speech-debate-ifcidffe-pro02b", "score": 0.6704421043395996, "is_gold": false, "snippet": "A democracy, like any state, owes its first duty to its citizens, and its national interest is therefore in selling this equipment to help business at home. While it is convenient, perhaps even morally right at times, to stand publicly for the universality of "}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-pro02b", "score": 0.6683704257011414, "is_gold": false, "snippet": "Any country’s first duty is to its own citizens, and this includes countries that promote human rights and freedom abroad. It is difficult to see why pronouncements by a country should morally oblige it to act in a particular way. Rhetoric and high minded pron"}, {"rank": 7, "docid": "test-politics-ypppdghwid-pro02b", "score": 0.6668053269386292, "is_gold": false, "snippet": "First, it is not clear whether such a position is topical. Second, it is better to support protesters in this case, rather than taking the lead.  To begin with, it is not clear that assisting individuals in the fight for democracy is a valid interpretation of "}, {"rank": 8, "docid": "training-international-glhrilpws-con03b", "score": 0.664702832698822, "is_gold": false, "snippet": "Most human rights abuses are motivated by ideological factors that are not rationally calculated through a \"cost-benefit-analysis.\" Much of the world's human rights abuses are committed along ethnic or religious lines and thus are not open to incentives and di"}, {"rank": 9, "docid": "test-politics-ypppdghwid-con02a", "score": 0.6629940271377563, "is_gold": false, "snippet": "Unilateral action is burdensome, and dangerous.  POINT  The motion suggests that a particular government is imposing democracy, but in fact it is far better to try and encourage democracy multilaterally. Multilateral assistance, like the UN Democracy Fund whic"}, {"rank": 10, "docid": "training-free-speech-debate-ldigrrg-con03b", "score": 0.6600760221481323, "is_gold": false, "snippet": "It is not about the worth of promoting one thing rather than another. Resources are finite and no country can promote all its values, everywhere, and all the time. Choices need to be made and priorities in foreign policy set. That focus should be on promoting "}], "topK_baseline": [{"rank": 1, "docid": "test-society-simhbrasnba-con03a", "score": 0.9999998807907104, "is_gold": false, "snippet": "We must practice what we preach  Democratic nations preach the language of freedom, human rights and justice. They encourage those who live under oppression to oppose their rulers and work towards these goals. This is all rendered hollow, and hypocritical if t"}, {"rank": 2, "docid": "training-international-glhrilpws-con03b", "score": 0.7964422702789307, "is_gold": false, "snippet": "Most human rights abuses are motivated by ideological factors that are not rationally calculated through a \"cost-benefit-analysis.\" Much of the world's human rights abuses are committed along ethnic or religious lines and thus are not open to incentives and di"}, {"rank": 3, "docid": "test-law-sdiflhrdffe-pro02a", "score": 0.7928067445755005, "is_gold": false, "snippet": "Democracies have an obligation to shield these people and to encourage further dissent  The universality of human rights, of the freedom of speech and of due process is all touted as crucial by the world’s democracies. Democratic countries are frequently vocal"}, {"rank": 4, "docid": "test-law-sdiflhrdffe-con01b", "score": 0.792489230632782, "is_gold": false, "snippet": "All countries, even authoritarian ones, desire to be considered legitimate and valued in the international community. The weight of condemnation that a policy of amnesty creates is one that bears down heavily on repressive regimes and can galvanize them to ref"}, {"rank": 5, "docid": "test-society-simhbrasnba-con03b", "score": 0.792104959487915, "is_gold": true, "snippet": "Democratic nations can support like-minded groups in all manner of other ways, such as funding and training opposition groups, giving them international representation, and by applying pressure to oppressive governments. With individual asylum applicants they "}, {"rank": 6, "docid": "training-free-speech-debate-ifcidffe-pro02b", "score": 0.7913253903388977, "is_gold": false, "snippet": "A democracy, like any state, owes its first duty to its citizens, and its national interest is therefore in selling this equipment to help business at home. While it is convenient, perhaps even morally right at times, to stand publicly for the universality of "}, {"rank": 7, "docid": "test-law-sdiflhrdffe-pro02b", "score": 0.7897694706916809, "is_gold": false, "snippet": "A democracy’s first duty must always be to the citizens that elect it, not to foreign dissidents. Their duty therefore is to be engaging with these regimes to the benefit of their own citizens; through encouraging trade relations for example. Offering amnesty "}, {"rank": 8, "docid": "training-free-speech-debate-ldigrrg-con03b", "score": 0.7882164120674133, "is_gold": false, "snippet": "It is not about the worth of promoting one thing rather than another. Resources are finite and no country can promote all its values, everywhere, and all the time. Choices need to be made and priorities in foreign policy set. That focus should be on promoting "}, {"rank": 9, "docid": "training-digital-freedoms-fehbwdsot-pro02b", "score": 0.786731481552124, "is_gold": false, "snippet": "Any country’s first duty is to its own citizens, and this includes countries that promote human rights and freedom abroad. It is difficult to see why pronouncements by a country should morally oblige it to act in a particular way. Rhetoric and high minded pron"}, {"rank": 10, "docid": "test-politics-ypppdghwid-pro03a", "score": 0.7858926057815552, "is_gold": false, "snippet": "Promoting democracy promotes peace.  By most accounts, there has not been a war between two democracies in the past 200 years. Immanuel Kant argued in Perpetual Peace (1795) that a) democratic governments are more constrained by their people's opposition to wa"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-economy-epehwmrbals-pro04a", "query": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be a way of allocating it. It is not surprising therefore that countries with shared colonial histories tend to dominate aid flows, thus Britain has historically given most aid to countries that were its colonies; in 1960 Malta and Cyprus received most, while India was the biggest recipient for much of the rest of the 20th Century. [1] Further, often countries offering aid, such as the US, the UK, and the EU, require the pre-requisite of democracy or the start of a democratisation process. Therefore, it is justified to add a pre-requisite for better standards of business and labour as it helps implementation, and principally meets the goals of the developmental aid itself. [2]  [1] Provost, Claire, ‘UK aid: where does it o and how has it changed since 1960?’, Datablog guardian.co.uk, 14 April 2011,   [2] Dollar, David and Alesina, Alberto. “Who Gives Foreign Aid to Whom and Why?” Journal of Economic Growth, Volume 5, No. 1(Mar., 2000).", "gold_docid": "test-economy-epehwmrbals-pro04b", "rank_T": 8, "rank_baseline": 2, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-economy-epehwmrbals-pro04a", "score": 0.85335773229599, "is_gold": false, "snippet": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be "}, {"rank": 2, "docid": "training-economy-epiaghwssd-pro02b", "score": 0.7160374522209167, "is_gold": false, "snippet": "It is nonsense to compare aid with the west’s actions during the nineteenth century. Yes the west with aid sometimes wants to encourage its own values but this is a long way from forcing those values on the other state. The IMF may demand certain changes and l"}, {"rank": 3, "docid": "test-international-aghbfcpspr-con03b", "score": 0.6963435411453247, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 4, "docid": "training-health-ssiahrgmhwc-pro03b", "score": 0.6959052085876465, "is_gold": false, "snippet": "The international community has an obligation to help poorer countries, and cannot simply walk away from it over an issue such as this. Exploitation, through imperialism and other means, has been a major feature of Western relations with Africa. From colonial "}, {"rank": 5, "docid": "training-economy-epiaghwssd-pro03a", "score": 0.6891197562217712, "is_gold": false, "snippet": "The west does not know best  It is clear that the donor countries do not know how best to spend the money they give as aid. Instead they want their money spent on the latest development fad whether this is the privatisation of basic services, microcredit, cond"}, {"rank": 6, "docid": "training-economy-fegippghp-pro04b", "score": 0.6888054013252258, "is_gold": false, "snippet": "Resources will only be scarcer without aid; further chaos and corruption will ensue. There would be no need for fighting should resources be shared out equally. If aid is transferred to governments there is surely a centralized method of doing so; aid itself i"}, {"rank": 7, "docid": "training-economy-epiaghwssd-con01b", "score": 0.6847802400588989, "is_gold": false, "snippet": "It does not make sense that India should receive aid simply because it still has poor people. Aid is used to help when the government cannot provide for its own people and India clearly already provides the vast majority of help for its own people and will pro"}, {"rank": 8, "docid": "test-economy-epehwmrbals-pro04b", "score": 0.6813372373580933, "is_gold": true, "snippet": "Strategic interests can be put to risk by such pre-requisites. Donor nations have strategic interests when awarding aid, which ensure that future trade relations are well secured (such as United States and the Middle Eastern oil states). This is why aid goes t"}, {"rank": 9, "docid": "training-international-appgovrsus-pro01b", "score": 0.6795064806938171, "is_gold": false, "snippet": "It is wrong to be expanding the aid budget at a time of economic crisis when the government is dramatically failing to balance its books. The list of things that the Obama administration wants to do with aid are either things that are best left to the military"}, {"rank": 10, "docid": "training-education-udfakhwst-con02b", "score": 0.6762295365333557, "is_gold": false, "snippet": "Wealthy states do feel an obligation to less fortunate countries, as is demonstrated through their frequent use of aid and loans to poorer governments. This is a way to help countries stop being dependent on aid and hand-outs and instead develop their own huma"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-epehwmrbals-pro04a", "score": 1.0, "is_gold": false, "snippet": "Historically the donor of Foreign Aid has always set down pre-requisites  When a donor nation parts with foreign aid for development to a nation, it must always choose who it prefers to give it to as there is a limited pot of money to donate there needs to be "}, {"rank": 2, "docid": "test-economy-epehwmrbals-pro04b", "score": 0.7855496406555176, "is_gold": true, "snippet": "Strategic interests can be put to risk by such pre-requisites. Donor nations have strategic interests when awarding aid, which ensure that future trade relations are well secured (such as United States and the Middle Eastern oil states). This is why aid goes t"}, {"rank": 3, "docid": "training-economy-epiaghwssd-pro02b", "score": 0.7764654755592346, "is_gold": false, "snippet": "It is nonsense to compare aid with the west’s actions during the nineteenth century. Yes the west with aid sometimes wants to encourage its own values but this is a long way from forcing those values on the other state. The IMF may demand certain changes and l"}, {"rank": 4, "docid": "training-economy-epiaghwssd-pro03a", "score": 0.7701785564422607, "is_gold": false, "snippet": "The west does not know best  It is clear that the donor countries do not know how best to spend the money they give as aid. Instead they want their money spent on the latest development fad whether this is the privatisation of basic services, microcredit, cond"}, {"rank": 5, "docid": "test-international-aghbfcpspr-con03b", "score": 0.7698595523834229, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 6, "docid": "training-economy-fegippghp-pro04b", "score": 0.7638905048370361, "is_gold": false, "snippet": "Resources will only be scarcer without aid; further chaos and corruption will ensue. There would be no need for fighting should resources be shared out equally. If aid is transferred to governments there is surely a centralized method of doing so; aid itself i"}, {"rank": 7, "docid": "test-international-aghbfcpspr-con04b", "score": 0.7596766352653503, "is_gold": false, "snippet": "There is a fundamental difference here between colonisation and the modern day; whereas colonial powers were formerly damaging infrastructure [1] and natural resources [2] , in the modern day under reparations they would be helping to preserve such resources a"}, {"rank": 8, "docid": "test-international-aghbfcpspr-pro05a", "score": 0.7571428418159485, "is_gold": false, "snippet": "Reparations demonstrate a true concern for the developing world.  Even alongside the colonial justifications for providing reparations, there are also many other strong reasons why former colonial powers should grant reparations. Former colonial powers tend to"}, {"rank": 9, "docid": "test-international-aghbfcpspr-con01b", "score": 0.7569555044174194, "is_gold": false, "snippet": "Given that many former colonies remain poor (even after so many years), it is very unlikely that these people would have no need for such money. The difference in timescale is irrelevant; what is relevant is that such former colonies have a demonstrated need f"}, {"rank": 10, "docid": "training-economy-epiaghwssd-con04a", "score": 0.7564006447792053, "is_gold": false, "snippet": "Pressure from international donors is essential  Currently the culture of giving in India is not mature enough to enable India to fight poverty on its own. Aid to India therefore provides more than one role. It does not just provide the money and supplies that"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-politics-eppghwgpi-pro03a", "query": "In the event of major abuses of power it should be the public that holds politicians to account.  The obvious benefit to prosecuting politicians is that it punishes – and thereby deters – corruption by politicians. However, this benefit can be achieved through other means. Firstly, many western liberal democracies have one form or another of removing a politician from office in the midst of their term, such as impeachment in the American system or a vote of no confidence against the government in the Westminster system. While defenders of immunity oppose impeachment as contrary to the principles outlined above (because of the effect that it may have on political duties), this is an option that remains in cases of gross misconduct. If the political will cannot be mobilized to remove a sitting politician, they are held accountable by the electorate to whom they must answer in the next election, and who will likely punish blatant misuse of political power. Even if the individual politician has reached a limit on their term of office, or does not seek reelection, they are still held in check by the damage that will be done to their party in the event of major misconduct on their part. Finally, most politicians are significantly concerned about their legacy, which is tarnished significantly by corruption even if they are never held legally accountable for it. While Nixon received a full pardon from his success, [1] his name has become synonymous with criminality and scandal: a fate most politicians wish to avoid.  [1] Ford, Gerald R., Proclamation 4311, 8 September 1974,  [Accessed September 9, 2011]", "gold_docid": "test-politics-eppghwgpi-pro03b", "rank_T": 12, "rank_baseline": 6, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-politics-eppghwgpi-pro03a", "score": 0.8553591370582581, "is_gold": false, "snippet": "In the event of major abuses of power it should be the public that holds politicians to account.  The obvious benefit to prosecuting politicians is that it punishes – and thereby deters – corruption by politicians. However, this benefit can be achieved through"}, {"rank": 2, "docid": "test-politics-eppghwgpi-con01b", "score": 0.7637053728103638, "is_gold": false, "snippet": "See argument above regarding other accountability mechanism. Jeopardizing future electoral success, harming one’s political party, and damage to one’s personal legacy are all meaningful checks on the behavior of politicians. To suggest that, in the absence of "}, {"rank": 3, "docid": "test-politics-eppghwgpi-pro04a", "score": 0.7493098974227905, "is_gold": false, "snippet": "Seeing a politician put on trial hurts the integrity of their office.  It does tremendous damage to the public perception of a given political position to see the holder of that position on trial for criminal acts. Politicians are important role models for the"}, {"rank": 4, "docid": "test-politics-eppghwgpi-con02a", "score": 0.7463691234588623, "is_gold": false, "snippet": "Politicians who commit crimes are likely unfit to serve.  The sort of person who commits an offense has demonstrated irresponsibility and so is unworthy of the public trust. Would any reasonable citizen wanted to be represented by a domestic abuser, or have a "}, {"rank": 5, "docid": "test-politics-eppghwgpi-con04b", "score": 0.7457171678543091, "is_gold": false, "snippet": "The difference between the harm to the office of a politician getting away with a crime and the harm from them being tried for that crime is that the trial is inherently public. Short of widespread corruption – the sort that would probably preclude prosecuting"}, {"rank": 6, "docid": "test-politics-eppghwgpi-con04a", "score": 0.732832133769989, "is_gold": false, "snippet": "Immunity for politicians hurts the image of their office  Far from the worst PR for an office being that a holder of it is on trial, the worst possible public perception of a political institution is that it is wracked with corruption, with it not even theoret"}, {"rank": 7, "docid": "test-politics-eppghwgpi-pro04b", "score": 0.7227587699890137, "is_gold": false, "snippet": "If we don’t want politicians hurting the dignity of the office, there is only one thing we can do: not elect politicians likely to commit crimes! Of course, this is often impossible to tell in advance, but the dilemma remains: a crime has been committed, and t"}, {"rank": 8, "docid": "training-politics-ghbuhsbap-pro03b", "score": 0.7219388484954834, "is_gold": false, "snippet": "Appointers and electors have to think about their reputation more. Unethically and unprofessionally behaved members of the upper house can still be sent away, either by the politicians who appointed or elected them or by independent inquiry. An example of this"}, {"rank": 9, "docid": "test-politics-eppghwgpi-con02b", "score": 0.7185705304145813, "is_gold": false, "snippet": "This is not necessarily true. A politician could be a brilliant diplomat who happens to commit a minor offence such as drink driving; very few indictable offences correlate directly with one’s ability to discharge the mandate of a political office. Historicall"}, {"rank": 10, "docid": "test-politics-eppghwgpi-pro01b", "score": 0.7144524455070496, "is_gold": false, "snippet": "Politicians have to divide their focus anyway. As the examples above concede, being a politician means being pulled in several different directions. Elections are particularly distracting, and in jurisdictions with fixed election cycles like the United States "}], "topK_baseline": [{"rank": 1, "docid": "test-politics-eppghwgpi-pro03a", "score": 1.0, "is_gold": false, "snippet": "In the event of major abuses of power it should be the public that holds politicians to account.  The obvious benefit to prosecuting politicians is that it punishes – and thereby deters – corruption by politicians. However, this benefit can be achieved through"}, {"rank": 2, "docid": "test-politics-eppghwgpi-con04a", "score": 0.8354110717773438, "is_gold": false, "snippet": "Immunity for politicians hurts the image of their office  Far from the worst PR for an office being that a holder of it is on trial, the worst possible public perception of a political institution is that it is wracked with corruption, with it not even theoret"}, {"rank": 3, "docid": "test-politics-eppghwgpi-con05a", "score": 0.818657398223877, "is_gold": false, "snippet": "Immunity creates a perverse incentive to hang on to their office as long as possible.  Prosecutorial immunity brings about a massive side-benefit to being in office. It is easy to get used to a life where minor indiscretions go regularly unpunished, as has hap"}, {"rank": 4, "docid": "test-politics-eppghwgpi-con01b", "score": 0.8151010274887085, "is_gold": false, "snippet": "See argument above regarding other accountability mechanism. Jeopardizing future electoral success, harming one’s political party, and damage to one’s personal legacy are all meaningful checks on the behavior of politicians. To suggest that, in the absence of "}, {"rank": 5, "docid": "test-politics-eppghwgpi-pro04a", "score": 0.8135648965835571, "is_gold": false, "snippet": "Seeing a politician put on trial hurts the integrity of their office.  It does tremendous damage to the public perception of a given political position to see the holder of that position on trial for criminal acts. Politicians are important role models for the"}, {"rank": 6, "docid": "test-politics-eppghwgpi-pro03b", "score": 0.8069480061531067, "is_gold": true, "snippet": "These mechanisms are not immediate enough to put an immediate stop to an aberrant behavior. Impeachment proceedings take months at least; elections may be years away; and reputational damage is even more long-term. Moreover, these punishments are nowhere near "}, {"rank": 7, "docid": "test-politics-eppghwgpi-con02a", "score": 0.8038389086723328, "is_gold": false, "snippet": "Politicians who commit crimes are likely unfit to serve.  The sort of person who commits an offense has demonstrated irresponsibility and so is unworthy of the public trust. Would any reasonable citizen wanted to be represented by a domestic abuser, or have a "}, {"rank": 8, "docid": "test-politics-eppghwgpi-con03a", "score": 0.7984648942947388, "is_gold": false, "snippet": "Immunity for politicians is an unjust double standard  Every victim deserves to have the perpetrator of their suffering answer for their misdeeds. It is unjust that certain offenders would avoid retribution, and certain victims would be denied their day in cou"}, {"rank": 9, "docid": "test-politics-eppghwgpi-con04b", "score": 0.7977327108383179, "is_gold": false, "snippet": "The difference between the harm to the office of a politician getting away with a crime and the harm from them being tried for that crime is that the trial is inherently public. Short of widespread corruption – the sort that would probably preclude prosecuting"}, {"rank": 10, "docid": "test-politics-eppghwgpi-pro05a", "score": 0.7927502989768982, "is_gold": false, "snippet": "Prosecutions of politicians are often motivated by partisan concerns.  As noted above, the political life is steeped in difficult decisions, and some of these are bound to result in choices that are at least potentially illegal. The ability to prosecute politi"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-hrilpgwhwr-pro01a", "query": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it defies belief that the US would approve a strategy of genocide or systematic mass violations of human rights that could attract the jurisdiction of the ICC. Further, the discretion of the Prosecutor is not unchecked. The Statute requires that the approval of three judges sitting in a pre-trial chamber be obtained before an arrest warrant can be issued or proceedings initiated. Moreover, there is no harm to the interests of the US in being subjected to a mere preliminary investigation. In fact, it is preferable that spurious accusations are briefly examined and shown to be baseless, than that these accusations be allowed to raise doubts about the credibility of a State's actions and the impartiality of the Tribunal in question. The US acceptance of the jurisdiction of the Prosecutor of the ICTY is evident ; the US troops forming part of the KFOR peacekeeping force in Kosovo could equally be subject to investigation and prosecution by the ICTY. The US is prepared for its forces to operate under the scrutiny of the ICTY since it reasonably does not expect its members to commit the very crimes they are deployed to prevent.", "gold_docid": "test-law-hrilpgwhwr-pro01b", "rank_T": 12, "rank_baseline": 6, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-law-hrilpgwhwr-pro01a", "score": 0.8496415615081787, "is_gold": false, "snippet": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it"}, {"rank": 2, "docid": "test-law-hrilpgwhwr-con03a", "score": 0.7336336374282837, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 3, "docid": "test-law-hrilpgwhwr-pro03b", "score": 0.7147952318191528, "is_gold": false, "snippet": "The US holds a unique position in the fabric of the protection of international peace and security. Whilst it might be appropriate for other States to consent to the jurisdiction of the ICC, these States do not bear the responsibilities and attendant risks beh"}, {"rank": 4, "docid": "test-law-hrilpgwhwr-con03b", "score": 0.7020823955535889, "is_gold": false, "snippet": "The ICC does not have too much authority, merely the necessary authority to be useful as an institution. It is the very pre-eminence of the US that demands it adhere to the international rule of law, the ICC's existence will not alter that nor lead to charges "}, {"rank": 5, "docid": "validation-law-hrilhbiccfg-con01b", "score": 0.7018856406211853, "is_gold": false, "snippet": "To date, the ICC has empirically only issued warrants against leaders that nations have almost universally agreed upon committed heinous crimes. The existence of the ICC would only deter actions that are so atrocious, they would be comparable to the ones commi"}, {"rank": 6, "docid": "training-law-hrilhwpwc-con03b", "score": 0.6968644857406616, "is_gold": false, "snippet": "Firstly, more prosecutions take place in developing nations because in recent decades more war crimes have been committed in developing nations. Western nations have been equally committed to prosecutions in the former Yugoslavia, in an increasingly prosperous"}, {"rank": 7, "docid": "test-international-amehbuaisji-con03b", "score": 0.6905114650726318, "is_gold": false, "snippet": "The only effect on US freedom of action would be prohibition of clear and significant violations of international law.  If the US stays within the international criminal law, they will not be affected by the ICC. It would be harmful for any state to have speci"}, {"rank": 8, "docid": "test-international-amehbuaisji-pro02b", "score": 0.6903499960899353, "is_gold": false, "snippet": "Independent nations are capable of trying war crimes themselves.  The ICC is an unnecessary intrusion on national sovereignty. It should be up to each state to determine its own legal system as to how criminal matters should be prosecuted.  If the US and Israe"}, {"rank": 9, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.6898866891860962, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 10, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.687052845954895, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrilpgwhwr-pro01a", "score": 1.0000001192092896, "is_gold": false, "snippet": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it"}, {"rank": 2, "docid": "test-law-hrilpgwhwr-con03a", "score": 0.8690752983093262, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.8294300436973572, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 4, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.8262149095535278, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}, {"rank": 5, "docid": "test-law-hrilpgwhwr-pro03b", "score": 0.8173025250434875, "is_gold": false, "snippet": "The US holds a unique position in the fabric of the protection of international peace and security. Whilst it might be appropriate for other States to consent to the jurisdiction of the ICC, these States do not bear the responsibilities and attendant risks beh"}, {"rank": 6, "docid": "test-law-hrilpgwhwr-pro01b", "score": 0.8169907331466675, "is_gold": true, "snippet": "The ICC's ability to prosecute war criminals is both overstated and simplistic. It has no force of its own, and must rely on its member states to hand over criminals wanted for prosecution. This leads to cases like that of Serbia, where wanted war criminals li"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-con03b", "score": 0.8103628754615784, "is_gold": false, "snippet": "The ICC does not have too much authority, merely the necessary authority to be useful as an institution. It is the very pre-eminence of the US that demands it adhere to the international rule of law, the ICC's existence will not alter that nor lead to charges "}, {"rank": 8, "docid": "training-international-alilhbassw-con03b", "score": 0.8088940978050232, "is_gold": false, "snippet": "Independent nations are capable of trying war crimes themselves.  The ICC is an unnecessary intrusion on national sovereignty. It should be up to each state to determine its own legal system as to how criminal matters should be prosecuted.  The principle of co"}, {"rank": 9, "docid": "test-law-hrilpgwhwr-con05a", "score": 0.8070411086082458, "is_gold": false, "snippet": "The ICC fails to prevent atrocities.  The ICC will not deter the commission of war crimes or genocide. The Third Reich augmented the crimes of the Holocaust when it became clear that the Allies would defeat them in Europe. The only expectation of the Nazi lead"}, {"rank": 10, "docid": "training-law-hrilhwpwc-con03b", "score": 0.8033713102340698, "is_gold": false, "snippet": "Firstly, more prosecutions take place in developing nations because in recent decades more war crimes have been committed in developing nations. Western nations have been equally committed to prosecutions in the former Yugoslavia, in an increasingly prosperous"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-law-hrilpgwhwr-con03a", "query": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investigation to the Prosecutor and the Prosecutor also has the power to commence an investigation ex proprio motu. There is no UN Security Council veto over the discretion of the Prosecutor. Moreover, the phantom of political prosecution has already materialised in the preliminary investigation mounted by the Office of the Prosecutor of the ICTY into the NATO bombing of Kosovo and the Federal Republic of Yugoslavia in the course of 'Operation Allied Force'. The Prosecutor chose to investigate a campaign that had been undertaken with clinical precision, that had received the ex post facto support of the Security Council, and that had been directed against a military infrastructure effecting a brutal policy of ethnic cleansing. This grim precedent suggests that a Prosecutor will not hesitate to investigate any other good faith and successful military actions across the globe.", "gold_docid": "test-law-hrilpgwhwr-con03b", "rank_T": 12, "rank_baseline": 6, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-law-hrilpgwhwr-con03a", "score": 0.8476330637931824, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 2, "docid": "validation-law-hrilhbiccfg-con04a", "score": 0.7363815307617188, "is_gold": false, "snippet": "The ICC is not democratic in nature and is likely to be used as a political tool by powerful nations.  Parts of the Rome Statue, such as the clauses relating to the Security Council, make it seem like a tool that will be used by the politically powerful. The S"}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-con04b", "score": 0.721721351146698, "is_gold": false, "snippet": "The ICC is an independent court with enough checks that only pursues the most heinous criminals.  The ICC was designed to pursue the \"future Pol Pots, Saddam Husseins, and Milosevics who terrorize civilians on a massive scale.\" The fear of politically motivate"}, {"rank": 4, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.7172015309333801, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 5, "docid": "test-law-hrilpgwhwr-pro01a", "score": 0.7084930539131165, "is_gold": false, "snippet": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it"}, {"rank": 6, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.70838463306427, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-pro01b", "score": 0.6895632743835449, "is_gold": false, "snippet": "The ICC's ability to prosecute war criminals is both overstated and simplistic. It has no force of its own, and must rely on its member states to hand over criminals wanted for prosecution. This leads to cases like that of Serbia, where wanted war criminals li"}, {"rank": 8, "docid": "test-international-amehbuaisji-pro01b", "score": 0.6872591376304626, "is_gold": false, "snippet": "It took nearly two years for the ICC to launch an investigation into atrocities in the Central African Republic. This has helped defeat the argument that it would be faster than the International Criminal Tribunal for the former Yugoslavia and International Tr"}, {"rank": 9, "docid": "validation-law-hrilppwhb-pro01b", "score": 0.6821432113647461, "is_gold": false, "snippet": "In any conflict, the apportionment of blame for individual crimes committed against civilians to a standard of proof that would be acceptable in a court is extremely difficult, even such a high profile crime as attacks using chemical weapons have been disputed"}, {"rank": 10, "docid": "test-law-cpilhbishioe-con03b", "score": 0.6802896857261658, "is_gold": false, "snippet": "Those arguments are similar ones to those used against the ICC. An ICC police force, comprised of officers from individual state and supervised by an independent authority appointed by a similar mechanism to the judges, would use the existing frameworks in pla"}], "topK_baseline": [{"rank": 1, "docid": "test-law-hrilpgwhwr-con03a", "score": 1.0, "is_gold": false, "snippet": "The ICC has too much authority.  The ICC will lead to political prosecution. American service members and senior military and political strategists will be subject to charges for legitimate military action. Any State has the power to refer an issue for investi"}, {"rank": 2, "docid": "test-law-hrilpgwhwr-pro01a", "score": 0.8690752983093262, "is_gold": false, "snippet": "The ICC allows for the prosecution of war criminals.  Law-abiding states like the United States that have yet to ratify the ICC should have nothing to fear if they behave lawfully. The Prosecutor of the ICC is only concerned with the most grave offences and it"}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-con02a", "score": 0.8365303874015808, "is_gold": false, "snippet": "The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse.  The issues the ICC deals with are inherently subjective, as there is clear disagreement about what counts as a war crime or what the exact definition of genocide is. Th"}, {"rank": 4, "docid": "test-law-hrilpgwhwr-con04a", "score": 0.8335162997245789, "is_gold": false, "snippet": "The novel crime of aggression leads to the prosecution of those seeking to protect human rights.  The likelihood of political prosecution is only augmented by the creation of the novel crime of 'aggression' under the Rome Statute. Any intervention in a State f"}, {"rank": 5, "docid": "validation-law-hrilhbiccfg-con04a", "score": 0.8333190679550171, "is_gold": false, "snippet": "The ICC is not democratic in nature and is likely to be used as a political tool by powerful nations.  Parts of the Rome Statue, such as the clauses relating to the Security Council, make it seem like a tool that will be used by the politically powerful. The S"}, {"rank": 6, "docid": "test-law-hrilpgwhwr-con03b", "score": 0.8227378726005554, "is_gold": true, "snippet": "The ICC does not have too much authority, merely the necessary authority to be useful as an institution. It is the very pre-eminence of the US that demands it adhere to the international rule of law, the ICC's existence will not alter that nor lead to charges "}, {"rank": 7, "docid": "test-law-hrilpgwhwr-pro01b", "score": 0.8066481351852417, "is_gold": false, "snippet": "The ICC's ability to prosecute war criminals is both overstated and simplistic. It has no force of its own, and must rely on its member states to hand over criminals wanted for prosecution. This leads to cases like that of Serbia, where wanted war criminals li"}, {"rank": 8, "docid": "validation-law-hrilhbiccfg-con04b", "score": 0.8049873113632202, "is_gold": false, "snippet": "The ICC is an independent court with enough checks that only pursues the most heinous criminals.  The ICC was designed to pursue the \"future Pol Pots, Saddam Husseins, and Milosevics who terrorize civilians on a massive scale.\" The fear of politically motivate"}, {"rank": 9, "docid": "test-law-hrilpgwhwr-pro03b", "score": 0.8033555150032043, "is_gold": false, "snippet": "The US holds a unique position in the fabric of the protection of international peace and security. Whilst it might be appropriate for other States to consent to the jurisdiction of the ICC, these States do not bear the responsibilities and attendant risks beh"}, {"rank": 10, "docid": "training-international-alilhbibaa-pro03a", "score": 0.8016511797904968, "is_gold": false, "snippet": "ICC is controlled by the Security Council  The ICC can only investigate situations that are referred to it by either the host country, or the Security Council [1] . A power also exists for the prosecutor to seek investigation, though this has as yet only been "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-free-speech-debate-fsaphgiap-con02a", "query": "Rivals could misuse the opportunity  While the leader suffers from an illness, rivals can use the opportunity to ease the leader out of office. A period of illness is a period of vulnerability in which the government is less able to respond to external and internal threats. Not telling the public about the leader's health during an illness helps prevent such attempts. The same is the case with a leader's death; a few days of secrecy allows for smooth succession as the appointed successor has the time to ensure the loyalty of the government, army and other vital institutions. In 2008 when General Lansana Conte of Guinea died power should have been transferred to the president of the National Assembly Aboubacar Sompare with an election within 90 days. Instead a group of junior military officers took advantage of the quick announcement to launch a coup. 1  1 Yusuf, Huma, ‘Military coup follows death of Guinea’s President’, The Christian Science Monitor, 23 December 2008,", "gold_docid": "test-free-speech-debate-fsaphgiap-con02b", "rank_T": 9, "rank_baseline": 3, "overlap@K": 0.8, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con02a", "score": 0.8588464260101318, "is_gold": false, "snippet": "Rivals could misuse the opportunity  While the leader suffers from an illness, rivals can use the opportunity to ease the leader out of office. A period of illness is a period of vulnerability in which the government is less able to respond to external and int"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con03b", "score": 0.7527205348014832, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con03b", "score": 0.7527205348014832, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.7316485047340393, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.7316485047340393, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 6, "docid": "test-politics-cdfsaphgiap-con04b", "score": 0.7226378321647644, "is_gold": false, "snippet": "If the leader in-charge is in illness, to avoid any repudiation, the representative from the other side could meet the leader in order to confirm or even have a video conference with the leader in charge. The leader only needs to set the overall policy, not ne"}, {"rank": 7, "docid": "test-free-speech-debate-fsaphgiap-con04b", "score": 0.7226378321647644, "is_gold": false, "snippet": "If the leader in-charge is in illness, to avoid any repudiation, the representative from the other side could meet the leader in order to confirm or even have a video conference with the leader in charge. The leader only needs to set the overall policy, not ne"}, {"rank": 8, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.7185954451560974, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.7185954451560974, "is_gold": true, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 10, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.7032931447029114, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-con02a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Rivals could misuse the opportunity  While the leader suffers from an illness, rivals can use the opportunity to ease the leader out of office. A period of illness is a period of vulnerability in which the government is less able to respond to external and int"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.8227205276489258, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con02b", "score": 0.8227205276489258, "is_gold": true, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-con03b", "score": 0.8218666911125183, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-con03b", "score": 0.8218666911125183, "is_gold": false, "snippet": "Deputy leaders are appointed and they are well versed with how the leader is managing issues and are capable of taking up the role immediately after the leader resigns or dies. Being open and transparent about a leader being ill simply creates the lack of stab"}, {"rank": 6, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.7979879379272461, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 7, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.7979879379272461, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 8, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.7903643846511841, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-pro03b", "score": 0.7903643846511841, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 10, "docid": "test-free-speech-debate-fsaphgiap-con01a", "score": 0.7742518782615662, "is_gold": false, "snippet": "Denial of privacy to the leaders  The leaders of states deserve privacy in exactly the same way as anyone else. Just like their citizens leaders want and deserve privacy and it would be unfair for everyone to know about their health. Leaders may suffer from di"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
{"qid": "test-philosophy-apessghwba-pro02a", "query": "Animal research necessitates significant harm to the animals involved  Animal research, by its very nature necessitates harm to the animals. Even if they are not made to suffer as part of the experiment, the vast majority of animals used, must be killed at the conclusion of the experiment. With 115 million animals being used in the status quo this is no small issue. Even if we were to vastly reduce animal experimentation, releasing domesticated animals into the wild, would be a death sentence, and it hardly seems realistic to think that many behaviourally abnormal animals, often mice or rats, might be readily moveable into the pet trade. [1] It is prima fasciae obvious, that it is not in the interest of the animals involved to be killed, or harmed to such an extent that such killing might seem merciful. Even if the opposition counterargument, that animals lack the capacity to truly suffer, is believed, research should none the less be banned in order to prevent the death of millions of animals.  [1] European Commission, 1997. Euthanasia of experimental animals. Luxembourg: Office for official publications", "gold_docid": "test-philosophy-apessghwba-pro02b", "rank_T": 13, "rank_baseline": 7, "overlap@K": 0.8, "topK_T": [{"rank": 1, "docid": "test-philosophy-apessghwba-pro02a", "score": 0.8432837724685669, "is_gold": false, "snippet": "Animal research necessitates significant harm to the animals involved  Animal research, by its very nature necessitates harm to the animals. Even if they are not made to suffer as part of the experiment, the vast majority of animals used, must be killed at the"}, {"rank": 2, "docid": "test-environment-assgbatj-pro02a", "score": 0.7866026163101196, "is_gold": false, "snippet": "Animal research causes severe harm to the animals involved  The point of animal research is that animals are harmed. Even if they don’t suffer in the experiment, almost all are killed afterwards. With 115 million animals used a year this is a big problem. Rele"}, {"rank": 3, "docid": "test-philosophy-apessghwba-con05a", "score": 0.7761912941932678, "is_gold": false, "snippet": "Animals involved in animal research are mostly well treated.  The vast majority of animals used in research are not subjected to suffering. Where there may be pain, they are given painkillers, and when they are euthanized it is done humanely. [1] They are look"}, {"rank": 4, "docid": "test-environment-assgbatj-con05a", "score": 0.7482826709747314, "is_gold": false, "snippet": "Research animals are well treated  Animals used in research generally don’t suffer. While they may be in pain, they are generally given pain killers, and when they are put down this is done humanely. [16] They are looked after, as healthy animals mean better e"}, {"rank": 5, "docid": "test-philosophy-apessghwba-pro05b", "score": 0.7285199761390686, "is_gold": false, "snippet": "We do not have to justify cock fighting and other acts of animal cruelty as morally permissible. These are different acts to animal research in an important respect. It is not the intention of the researchers to harm the animals, but rather to produce high qua"}, {"rank": 6, "docid": "test-environment-assgbatj-con04a", "score": 0.7243314385414124, "is_gold": false, "snippet": "Animal research is only used when it’s needed  EU member states and the US have laws to stop animals being used for research if there is any alternative. The 3Rs principles are commonly used. Animal testing is being Refined for better results and less sufferin"}, {"rank": 7, "docid": "test-science-eassgbatj-con01b", "score": 0.7243176102638245, "is_gold": false, "snippet": "To argue that “the ends justify the means” isn’t enough. We don’t know how much animals suffer, as they can’t talk to us. We therefore don’t know how aware they are of themselves. In order to stop a moral harm on animals we don’t understand, we shouldn’t do an"}, {"rank": 8, "docid": "test-environment-assgbatj-con01b", "score": 0.7243176102638245, "is_gold": false, "snippet": "To argue that “the ends justify the means” isn’t enough. We don’t know how much animals suffer, as they can’t talk to us. We therefore don’t know how aware they are of themselves. In order to stop a moral harm on animals we don’t understand, we shouldn’t do an"}, {"rank": 9, "docid": "test-science-eassgbatj-con05b", "score": 0.7232539057731628, "is_gold": false, "snippet": "Just because an animal is treated well as it is brought up doesn’t stop the very real suffering during testing. Stricter rules and painkillers don’t help as the lack of suffering cannot be guaranteed – if we knew what would happen, we wouldn’t do the experimen"}, {"rank": 10, "docid": "test-environment-assgbatj-con05b", "score": 0.7232539057731628, "is_gold": false, "snippet": "Just because an animal is treated well as it is brought up doesn’t stop the very real suffering during testing. Stricter rules and painkillers don’t help as the lack of suffering cannot be guaranteed – if we knew what would happen, we wouldn’t do the experimen"}], "topK_baseline": [{"rank": 1, "docid": "test-philosophy-apessghwba-pro02a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Animal research necessitates significant harm to the animals involved  Animal research, by its very nature necessitates harm to the animals. Even if they are not made to suffer as part of the experiment, the vast majority of animals used, must be killed at the"}, {"rank": 2, "docid": "test-environment-assgbatj-pro02a", "score": 0.8890089988708496, "is_gold": false, "snippet": "Animal research causes severe harm to the animals involved  The point of animal research is that animals are harmed. Even if they don’t suffer in the experiment, almost all are killed afterwards. With 115 million animals used a year this is a big problem. Rele"}, {"rank": 3, "docid": "test-philosophy-apessghwba-con05a", "score": 0.8672063946723938, "is_gold": false, "snippet": "Animals involved in animal research are mostly well treated.  The vast majority of animals used in research are not subjected to suffering. Where there may be pain, they are given painkillers, and when they are euthanized it is done humanely. [1] They are look"}, {"rank": 4, "docid": "test-science-eassgbatj-con01b", "score": 0.8346513509750366, "is_gold": false, "snippet": "To argue that “the ends justify the means” isn’t enough. We don’t know how much animals suffer, as they can’t talk to us. We therefore don’t know how aware they are of themselves. In order to stop a moral harm on animals we don’t understand, we shouldn’t do an"}, {"rank": 5, "docid": "test-environment-assgbatj-con01b", "score": 0.8346513509750366, "is_gold": false, "snippet": "To argue that “the ends justify the means” isn’t enough. We don’t know how much animals suffer, as they can’t talk to us. We therefore don’t know how aware they are of themselves. In order to stop a moral harm on animals we don’t understand, we shouldn’t do an"}, {"rank": 6, "docid": "test-philosophy-apessghwba-con01b", "score": 0.8251267075538635, "is_gold": false, "snippet": "To argue that the ends justify the means does not justify research upon animals. Firstly we do not know the extent to which animals are capable of holding interests or experiencing suffering, as they are unable to communicate with us. Our shared similarities g"}, {"rank": 7, "docid": "test-philosophy-apessghwba-pro02b", "score": 0.8187689781188965, "is_gold": true, "snippet": "Firstly, due to our larger and more sophisticated brains, one would expect the average human to have a great many more interests than any animal, for those interests to be more complex and interconnected, and for there to be a greater capacity for reflection a"}, {"rank": 8, "docid": "test-science-eassgbatj-con05b", "score": 0.8132244944572449, "is_gold": false, "snippet": "Just because an animal is treated well as it is brought up doesn’t stop the very real suffering during testing. Stricter rules and painkillers don’t help as the lack of suffering cannot be guaranteed – if we knew what would happen, we wouldn’t do the experimen"}, {"rank": 9, "docid": "test-environment-assgbatj-con05b", "score": 0.8132244944572449, "is_gold": false, "snippet": "Just because an animal is treated well as it is brought up doesn’t stop the very real suffering during testing. Stricter rules and painkillers don’t help as the lack of suffering cannot be guaranteed – if we knew what would happen, we wouldn’t do the experimen"}, {"rank": 10, "docid": "test-philosophy-apessghwba-pro05b", "score": 0.8126624822616577, "is_gold": false, "snippet": "We do not have to justify cock fighting and other acts of animal cruelty as morally permissible. These are different acts to animal research in an important respect. It is not the intention of the researchers to harm the animals, but rather to produce high qua"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/cos/arguana/isolate/bge/linear/lr3e-5_ep1_fbFalse_temp0.02_bs128_scale1.0_dropout0.1/20260225-185733/model"}}
