{"qid": "test-education-pshhghwpba0-con03a", "query": "A school breakfast for all is a greater cost on schools  Everything costs. Providing free school to all breakfasts will cost the government money for ingredients, cafeteria staff, administration, even possibly new facilities. In the USA the Breakfast Program costs $3.3 billion to provide free or reduced price breakfasts to 10.1 million students. [1] There is a limited total amount of money so the cost will mean there is something else the government will not be able to do. This proposal may mean, for example, that the government cannot afford to hire more teachers to reduce class sizes.  [1] Food and Nutrition Service, ‘The School Breakfast Program’, September 2013", "gold_docid": "test-education-pshhghwpba0-con03b", "rank_T": 7, "rank_baseline": 140, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-education-pshhghwpba0-con03a", "score": 0.6282277703285217, "is_gold": false, "snippet": "A school breakfast for all is a greater cost on schools  Everything costs. Providing free school to all breakfasts will cost the government money for ingredients, cafeteria staff, administration, even possibly new facilities. In the USA the Breakfast Program c"}, {"rank": 2, "docid": "validation-education-sthwiyrs-pro07b", "score": 0.6117786765098572, "is_gold": false, "snippet": "Year-round schooling will probably mean increased administrative costs, as well as ensuring that overheads such as catering, heating and security have to be paid year-round rather than for just part of the year, as at present. [1]  Education funding in many co"}, {"rank": 3, "docid": "training-economy-epeeghbpw-pro02b", "score": 0.5960264801979065, "is_gold": false, "snippet": "If school is so expensive, than shouldn't the government be subsidizing school costs instead of forcing parents to send kids to school when they can't afford the books and clothes? It is also unfair to assume that parents on welfare on neglectful and do not va"}, {"rank": 4, "docid": "test-education-egtuscpih-pro04b", "score": 0.5556907653808594, "is_gold": false, "snippet": "It is questionable whether universities would be able to substantially cut administrative costs and facilities. They will have to spend substantially more on IT support for running courses, as well as adapting courses for the online format. Then it is likely t"}, {"rank": 5, "docid": "test-health-hgwhwbjfs-pro03b", "score": 0.5429414510726929, "is_gold": false, "snippet": "Again, if this is in fact true, then the incentives are already in place for better choices both on the side of students as well as schools.  What the government should do is through subsidizing healthier meals and educational campaigns help both of them make "}, {"rank": 6, "docid": "validation-education-sthwiyrs-con02b", "score": 0.5331377387046814, "is_gold": false, "snippet": "Year-round schooling will increase costs in some areas but more than offset these with efficiency savings in other areas (see argument 7, above). It makes no sense for buildings to sit idle for a third of the year.  As for the argument about air-conditioning, "}, {"rank": 7, "docid": "test-education-pshhghwpba0-con03b", "score": 0.5294978618621826, "is_gold": true, "snippet": "The upfront cost will be paid back. In the future there will be less health care costs. And there will be a more highly educated and skilled population which will mean more economic growth and tax for the government."}, {"rank": 8, "docid": "test-education-pshhghwpba0-pro02b", "score": 0.5249533653259277, "is_gold": false, "snippet": "Schools already have enough pressures just to educate their students, they do not need additional pressure from having to ensure their nutrition as well. In the UK kitchen improvements cost £200 million and many local councils found they needed to take money f"}, {"rank": 9, "docid": "test-education-pteuhwfphe-con01b", "score": 0.5191196203231812, "is_gold": false, "snippet": "In the long term a graduate tax would save the state money by shifting the burden of costs to the main beneficiaries of higher education. It would also help to make the costs of expanding access to higher education more predictable and controllable, improving "}, {"rank": 10, "docid": "test-health-hgwhwbjfs-con03a", "score": 0.5190579295158386, "is_gold": false, "snippet": "“Junk food” sales are an important source of funding for schools.  An important issue to consider in this topic is the constellation of incentives that actually got us to the place where we are at today.  With the environment designed to incentivize improving "}], "topK_baseline": [{"rank": 1, "docid": "test-education-pshhghwpba0-con03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "A school breakfast for all is a greater cost on schools  Everything costs. Providing free school to all breakfasts will cost the government money for ingredients, cafeteria staff, administration, even possibly new facilities. In the USA the Breakfast Program c"}, {"rank": 2, "docid": "test-education-pshhghwpba0-pro01a", "score": 0.8016974329948425, "is_gold": false, "snippet": "A school breakfast gives all students an equal start to the day  All children should have equal opportunities, a breakfast for all helps provide this. With schools providing breakfast for everyone the start to the day will be the same for all. No one will star"}, {"rank": 3, "docid": "training-economy-epeeghbpw-pro02b", "score": 0.7925256490707397, "is_gold": false, "snippet": "If school is so expensive, than shouldn't the government be subsidizing school costs instead of forcing parents to send kids to school when they can't afford the books and clothes? It is also unfair to assume that parents on welfare on neglectful and do not va"}, {"rank": 4, "docid": "training-economy-epeeghbpw-con01a", "score": 0.7760281562805176, "is_gold": false, "snippet": "There should be rewards for success in school, versus punishment for failure to attend.  This problem could be addressed by subsidizing school supplies or rewarding good attendance records with additional cash. Cutting benefits will only hurt the children we a"}, {"rank": 5, "docid": "test-education-pshhghwpba0-pro04b", "score": 0.7423484921455383, "is_gold": false, "snippet": "There is no need for education about a healthy diet to be combined with free breakfasts for all. The teaching can be done separately just as effectively. Teaching at the same time as, or immediately before or after will simply mean students are concentrating o"}, {"rank": 6, "docid": "test-education-pshhghwpba0-pro04a", "score": 0.7420340180397034, "is_gold": false, "snippet": "Breakfast teaches about health  Children need to learn about how good nutrition keeps them healthy. Providing a school breakfast means that the meal can be an educational experience and have teaching alongside. This education will ensure that when these childr"}, {"rank": 7, "docid": "test-education-pshhghwpba0-pro02b", "score": 0.7396770119667053, "is_gold": false, "snippet": "Schools already have enough pressures just to educate their students, they do not need additional pressure from having to ensure their nutrition as well. In the UK kitchen improvements cost £200 million and many local councils found they needed to take money f"}, {"rank": 8, "docid": "test-education-pshhghwpba0-con01b", "score": 0.7364431619644165, "is_gold": false, "snippet": "The split in responsibility under this proposal is clear; school provides breakfast, parents other meals. This split ensures that even if the parent is shirking their responsibility the child will receive some nutrition."}, {"rank": 9, "docid": "test-health-hgwhwbjfs-pro03b", "score": 0.7339171171188354, "is_gold": false, "snippet": "Again, if this is in fact true, then the incentives are already in place for better choices both on the side of students as well as schools.  What the government should do is through subsidizing healthier meals and educational campaigns help both of them make "}, {"rank": 10, "docid": "test-education-pshhghwpba0-con02a", "score": 0.733312726020813, "is_gold": false, "snippet": "Government should focus on the most needy  A primary responsibility of the government is for reducing inequality and ensuring that everyone has a basic living standard. A basic living standard includes food. As a result providing breakfasts should be for those"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-phwmfri-con03a", "query": "Creates the perception that fines are like taxes, rather than a punishment  If we detach fines from the crimes committed, people are more likely to see fines as unrelated to justice. Rather, they will see fines as another mechanism by which the government makes money, this will be especially the case if as in New Zealand the money goes into government coffers without being hypothecated.1  This is similar to the way in which some people in the UK see speed cameras as less about preventing speeding, and more about getting money from motorists with one poll showing 49% of people believe they are primarily about revenue raising.2  This is harmful because it decreases the probability of people who deem the fine ‘worth it’ nevertheless abstaining from the criminal act.  1 ‘Frequently Asked Questions’, New Zealand Police,   2 ‘Drivers conflicted over cameras’, IAM Driving Road Safety, 11 August 2010,", "gold_docid": "test-law-phwmfri-con03b", "rank_T": 4, "rank_baseline": 111, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-law-phwmfri-con03a", "score": 0.6839239597320557, "is_gold": false, "snippet": "Creates the perception that fines are like taxes, rather than a punishment  If we detach fines from the crimes committed, people are more likely to see fines as unrelated to justice. Rather, they will see fines as another mechanism by which the government make"}, {"rank": 2, "docid": "test-law-phwmfri-pro02b", "score": 0.6071223616600037, "is_gold": false, "snippet": "This motion will have no impact on that problem. Fines must be set at a low percentage of income so that the people earning the least do not find themselves going without essentials (a fine for speeding that caused you not to be able to heat your house in wint"}, {"rank": 3, "docid": "test-law-phwmfri-con02b", "score": 0.5813441276550293, "is_gold": false, "snippet": "Only a small number of people will act like this. Some people, though rich, are nevertheless capable of seeing beyond self-interest, and will consider the fine to be fair.  This small harm is therefore easily outweighed by the improved perceptions of the justi"}, {"rank": 4, "docid": "test-law-phwmfri-con03b", "score": 0.554278552532196, "is_gold": true, "snippet": "Given, particularly, that it is those with the most money who are most likely to deem the fine ‘worth it’, this would be mitigated by the increased deterrent: the rich will now face substantially greater penalties."}, {"rank": 5, "docid": "test-law-phwmfri-con01b", "score": 0.5149918794631958, "is_gold": false, "snippet": "Whilst it is true that a crime ought to be proportionate to the severity of the crime committed, there is no reason why that must be the only factor. This motion does not remove the proportionality about which you are concerned, but merely adds an additional f"}, {"rank": 6, "docid": "test-law-phwmfri-con01a", "score": 0.5108928084373474, "is_gold": false, "snippet": "A flat rate is more just  A fine ought to be proportionate to the severity of the crime committed, not the income of the offender. It is fundamental that the justice system should treat all offenders equally; if two people commit the same crime in the same cir"}, {"rank": 7, "docid": "test-law-phwmfri-pro01b", "score": 0.47465115785598755, "is_gold": false, "snippet": "Even if a fine is made proportional to income, you will not get the equality of impact you desire. This is because the impact is not proportional simply to income, but must take into account a number of other factors. For example, someone supporting a family w"}, {"rank": 8, "docid": "test-politics-ypppgvhwmv-con02b", "score": 0.4717346429824829, "is_gold": false, "snippet": "Because mandatory voting means that no large campaign funds are needed to goad voters to the polls, the role of money in politics will decrease. Compulsory voting will reduce spending such as campaign spending on voter turnout. It can also lead to a reduction "}, {"rank": 9, "docid": "training-law-cpshbsdcc-con01b", "score": 0.4574013948440552, "is_gold": false, "snippet": "While the figures demonstrated in this argument clearly illustrate that these large scale crimes are more often committed by those who are not suffering from social deprivation, tax evasion constitutes a small percentage of the world wide crime rate, and thus "}, {"rank": 10, "docid": "test-law-phwmfri-pro03b", "score": 0.4509935677051544, "is_gold": false, "snippet": "Whilst this may well appease some sections of society, it comes at the cost of resentment from the rich.  This resentment will be magnified by media response: some newspapers and news outlets will choose to report this as an attack on the rich.  The problem is"}], "topK_baseline": [{"rank": 1, "docid": "test-law-phwmfri-con03a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Creates the perception that fines are like taxes, rather than a punishment  If we detach fines from the crimes committed, people are more likely to see fines as unrelated to justice. Rather, they will see fines as another mechanism by which the government make"}, {"rank": 2, "docid": "test-law-phwmfri-pro03a", "score": 0.8145483136177063, "is_gold": false, "snippet": "Creates the perception that the rich are not immune to the consequences of their actions  Fines that are not proportionate to income may create the perception that the rich are immune to the consequences of their actions. This is because people see those earni"}, {"rank": 3, "docid": "test-law-phwmfri-pro02a", "score": 0.7970235347747803, "is_gold": false, "snippet": "The rich are now also deterred  Another purpose of fines is to provide a deterrent. If fines are applied at one rate regardless of income, they must be low enough not to be un-payable for those who do not earn much money. Consequently, they are set so low that"}, {"rank": 4, "docid": "test-law-phwmfri-con02b", "score": 0.7886946201324463, "is_gold": false, "snippet": "Only a small number of people will act like this. Some people, though rich, are nevertheless capable of seeing beyond self-interest, and will consider the fine to be fair.  This small harm is therefore easily outweighed by the improved perceptions of the justi"}, {"rank": 5, "docid": "test-law-phwmfri-con01a", "score": 0.7693761587142944, "is_gold": false, "snippet": "A flat rate is more just  A fine ought to be proportionate to the severity of the crime committed, not the income of the offender. It is fundamental that the justice system should treat all offenders equally; if two people commit the same crime in the same cir"}, {"rank": 6, "docid": "test-law-phwmfri-pro02b", "score": 0.7638967633247375, "is_gold": false, "snippet": "This motion will have no impact on that problem. Fines must be set at a low percentage of income so that the people earning the least do not find themselves going without essentials (a fine for speeding that caused you not to be able to heat your house in wint"}, {"rank": 7, "docid": "test-law-phwmfri-con01b", "score": 0.7596079111099243, "is_gold": false, "snippet": "Whilst it is true that a crime ought to be proportionate to the severity of the crime committed, there is no reason why that must be the only factor. This motion does not remove the proportionality about which you are concerned, but merely adds an additional f"}, {"rank": 8, "docid": "test-politics-ypppgvhwmv-con02a", "score": 0.7590121030807495, "is_gold": false, "snippet": "Policing and financing the system is unmanageable  If a large proportion of the population decided not to vote it would be impossible to make every non-voter pay the fine. For example, if just 10% of the UK voters failed to do so the government would have to c"}, {"rank": 9, "docid": "test-law-phwmfri-pro01a", "score": 0.7537922859191895, "is_gold": false, "snippet": "Rich and poor now face equality of impact of punishment  The purpose of a fine is to ensure that the offender faces the consequences of their actions. The extent to which a financial penalty feels like a negative consequence is relative to the amount of income"}, {"rank": 10, "docid": "training-law-cpphwlpvo-pro04b", "score": 0.74993896484375, "is_gold": false, "snippet": "It is unrealistic to expect the police to act as the sole deterrent to criminal behaviour. The majority of police work concerns the detection rather than the prevention of crime. Only a massive and unfeasible expansion of police numbers and powers could provid"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-gvhbhlsbr-pro01a", "query": "The House of Lords is out of touch with the electorate.  The 19th century US President Abraham Lincoln stated that democracy should be ‘Government of the people, by the people, for the people’ [1] Therefore peers who sit in the house based on noble birth right or their membership of the Church of England, that is itself largely ignored by the people, do not represent the people of Britain.  [1] A' Short Definition of Democracy’, Democracy-building.info, 2005, viewed on 1 June 2011", "gold_docid": "test-politics-gvhbhlsbr-pro01b", "rank_T": 3, "rank_baseline": 75, "overlap@K": 0.3, "topK_T": [{"rank": 1, "docid": "test-politics-gvhbhlsbr-pro01a", "score": 0.8306624293327332, "is_gold": false, "snippet": "The House of Lords is out of touch with the electorate.  The 19th century US President Abraham Lincoln stated that democracy should be ‘Government of the people, by the people, for the people’ [1] Therefore peers who sit in the house based on noble birth right"}, {"rank": 2, "docid": "test-politics-gvhbhlsbr-pro04b", "score": 0.6732685565948486, "is_gold": false, "snippet": "Although the House of Lords may not be a true expression of ‘democracy’, it has a positive function in the governing of the country and is based in a tradition and heritage that the people of Britain should not try and abandon. One could argue in return that t"}, {"rank": 3, "docid": "test-politics-gvhbhlsbr-pro01b", "score": 0.5721715092658997, "is_gold": true, "snippet": "The House of Lords may not be representative of the British population but instead they represent an array of educated experts who can give informed advice on Government policy."}, {"rank": 4, "docid": "test-politics-gvhbhlsbr-con04b", "score": 0.5379434823989868, "is_gold": false, "snippet": "The AV campaign cannot be compared to reform to the House of Lords, furthermore one should not mistake a misinformed public due to political spin, with apathy. Often voters express that they are apathetic because they feel that they can’t change anything, that"}, {"rank": 5, "docid": "test-politics-gvhbhlsbr-pro02b", "score": 0.5351161360740662, "is_gold": false, "snippet": "The accusation that the House of Lords is inherently conservative is an unjust accusation, as proven by their siding with the people on unpopular government policies such as student tuition fees and the 42 days detention. Today no party has a majority in the C"}, {"rank": 6, "docid": "test-politics-gvhbhlsbr-con01a", "score": 0.502526044845581, "is_gold": false, "snippet": "The House of Lords allows a number of experts to influence government policy.  While the members of the House of Lords may represent a small section of society, they also include expert peers including lawyers, scientists, businesspeople, academics, doctors an"}, {"rank": 7, "docid": "training-philosophy-pgppghba-pro03b", "score": 0.4969691336154938, "is_gold": false, "snippet": "Democracies are not perfect but they are better than the other options.  Whilst democracies are not perfect they are the best way we have of aggregating the interests of society. People might not always get what they want but this is inevitable where there are"}, {"rank": 8, "docid": "test-international-epvhwhranet-pro03b", "score": 0.4892618954181671, "is_gold": false, "snippet": "Democracy itself is the delegating of decision making to elected officials and this is exactly what has taken place in the government's decision to not hold referendums but pass changes through national parliaments. Referenda undermines democracy by negating t"}, {"rank": 9, "docid": "test-international-epglghbni-pro02b", "score": 0.4888933598995209, "is_gold": false, "snippet": "An attempt at a plebiscite in 1921/22 under the specter of a war of independence and civil war would have been fraught with danger and even more open to intimidation than the House of Commons.  It would be undemocratic to relinquish Northern Ireland today, bec"}, {"rank": 10, "docid": "test-international-epvhwhranet-con01b", "score": 0.4879264235496521, "is_gold": false, "snippet": "The lack of referendums in the making of past decisions is not reason enough to neglect democracy in the present. Decisions that were made by past governments should be made accountable by present governments, because voting has been denied in the past gives e"}], "topK_baseline": [{"rank": 1, "docid": "test-politics-gvhbhlsbr-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "The House of Lords is out of touch with the electorate.  The 19th century US President Abraham Lincoln stated that democracy should be ‘Government of the people, by the people, for the people’ [1] Therefore peers who sit in the house based on noble birth right"}, {"rank": 2, "docid": "test-politics-gvhbhlsbr-pro04b", "score": 0.8865029215812683, "is_gold": false, "snippet": "Although the House of Lords may not be a true expression of ‘democracy’, it has a positive function in the governing of the country and is based in a tradition and heritage that the people of Britain should not try and abandon. One could argue in return that t"}, {"rank": 3, "docid": "test-politics-gvhbhlsbr-pro02a", "score": 0.8102887868881226, "is_gold": false, "snippet": "The House of Lords has an inbuilt conservative majority.  The traditional provenance of the House of Lords translates to an in-built Conservative majority. Even so called Liberal and Labour peers are usually conservative in their opinions. They represent a soc"}, {"rank": 4, "docid": "test-politics-gvhbhlsbr-con02b", "score": 0.8099566698074341, "is_gold": false, "snippet": "The House of Lords could be elected on a longer term basis than the House of Commons – ten years for example. Furthermore elections could be staggered during this period so the House of Lords would never simply be a ‘mirror’. Furthermore the House of Lords sho"}, {"rank": 5, "docid": "training-philosophy-pgppghba-pro03a", "score": 0.8022781610488892, "is_gold": false, "snippet": "States are never truly representative of the people.  Even if we ignore all of the totalitarian regimes in the world, democracies do not truly represent the people. Politicians all too often promise progressive changes and then fail to deliver, for example Oba"}, {"rank": 6, "docid": "test-politics-gvhbhlsbr-pro04a", "score": 0.7812367081642151, "is_gold": false, "snippet": "The current House of Lords is undemocratic  The House of Lords is undemocratic. Currently the members of the House of Lords consist of hereditary peers, senior members of the Church of England and those appointed by political parties. Whether or not there is a"}, {"rank": 7, "docid": "validation-religion-cshbcesbsb-pro01b", "score": 0.780607283115387, "is_gold": false, "snippet": "The Church does not have enough of an involvement in UK politics for the objectives of the Church of England to have any impact upon how the country is run. The UK government is still run in an entirely democratic way. While the Church is consulted in certain "}, {"rank": 8, "docid": "training-international-alhrpsgmhb-con01b", "score": 0.7800410389900208, "is_gold": false, "snippet": "Democracy is not just about enabling a tyranny of the majority. It is about enabling everyone have a say in running the country and about protecting the rights of those minority viewpoints. Simply accepting that the majority is always right is the path to popu"}, {"rank": 9, "docid": "test-politics-gvhbhlsbr-con04a", "score": 0.7769156098365784, "is_gold": false, "snippet": "The public is apathetic to reform.  Whether or not reform of the House of Lords should be a top priority in the current economic climate is debateable, let alone whether or not a coalition government would be able to initiate and drive through such measures. A"}, {"rank": 10, "docid": "test-politics-gvhbhlsbr-con01a", "score": 0.7768957018852234, "is_gold": false, "snippet": "The House of Lords allows a number of experts to influence government policy.  While the members of the House of Lords may represent a small section of society, they also include expert peers including lawyers, scientists, businesspeople, academics, doctors an"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-free-speech-debate-nshbbsbfb-pro04a", "query": "It is simply impractical for a major international broadcaster to hand out powers of veto to small sectional interests.  The BBC would quickly be left with a content either devoid of interest or of content were it to allow such a veto to become normative. Especially were it, as appears to be the case here, to offer such a veto to people who didn’t watch the programme.  As a result, although some of the responsibility for avoiding offence lies with the broadcaster at least an equal share must lie with the viewer. Even at the more basic level of ‘will I like this’, responsibility lies with both parties. The BBC undertakes to provide a diverse range of programming so that there is a reasonable chance that the overwhelming majority should be able to find something of interest but does so on the assumption that people will watch what they find interesting.  Likewise, it is reasonable to assume that people will not go out of their way to watch things that they already expect to find offensive.", "gold_docid": "test-free-speech-debate-nshbbsbfb-pro04b", "rank_T": 5, "rank_baseline": 45, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-nshbbsbfb-pro04a", "score": 0.7899937629699707, "is_gold": false, "snippet": "It is simply impractical for a major international broadcaster to hand out powers of veto to small sectional interests.  The BBC would quickly be left with a content either devoid of interest or of content were it to allow such a veto to become normative. Espe"}, {"rank": 2, "docid": "test-free-speech-debate-nshbbsbfb-con03b", "score": 0.5904473066329956, "is_gold": false, "snippet": "The BBC may be unusual but it is designed to fulfill particular functions. The very reason for its existence is to provide a platform for the free expression of a wide range of views, tailored to a wide range of viewers. Within that context, it cannot be expec"}, {"rank": 3, "docid": "test-free-speech-debate-nshbbsbfb-con02b", "score": 0.4993886947631836, "is_gold": false, "snippet": "In the same way that the BBC is routinely criticised from the political Right for its Left-wing bias and from the Left for a supposed favouritism to the Right, maintaining balance in any sphere of life is difficult. Freedom of speech demands that such a balanc"}, {"rank": 4, "docid": "test-free-speech-debate-nshbbsbfb-pro03b", "score": 0.4980979561805725, "is_gold": false, "snippet": "It is wrong to suggest that the BBC has any duty on account of its relative funding freedom to give a platform to controversial works of art. On the contrary the BBC has a higher obligation to viewers not to offend them because they are also licence payers. Hi"}, {"rank": 5, "docid": "test-free-speech-debate-nshbbsbfb-pro04b", "score": 0.49576711654663086, "is_gold": true, "snippet": "There is clearly a different threshold between the questions “do I like soap operas?” and “do I appreciate having my beliefs excoriated on national TV?” The difficulty here is that many who took offence saw the programme as a direct attack on themselves person"}, {"rank": 6, "docid": "training-culture-mthspsb-pro02b", "score": 0.48422783613204956, "is_gold": false, "snippet": "PSBs are a thing of the past. People no longer sit around the Television together. Commercial broadcasters provide more cultural freedom and choice for people. The idea of TV bringing a nation together no longer holds any merit in fragmented globalizing media "}, {"rank": 7, "docid": "test-free-speech-debate-nshbbsbfb-con03a", "score": 0.4726458787918091, "is_gold": false, "snippet": "Why should those who foot the bill have chunks of airtime from which they are, effectively, excluded.  How can it be okay for a broadcaster, funded by a compulsory levy on anyone who owns a television, to willingly produce programmes they know will cause offen"}, {"rank": 8, "docid": "validation-international-ehwlavpiems-pro01b", "score": 0.45806777477264404, "is_gold": false, "snippet": "This is not completely true. The EU’s very economically successful pre-crisis state suggests that many of the decisions adopted by the EU are not “diluted to the point of being ineffective” and that in fact, EU works quite well. Although there are stark differ"}, {"rank": 9, "docid": "training-politics-pgglgvhciu-pro01b", "score": 0.4524150788784027, "is_gold": false, "snippet": "The public already has an effective veto on legislation, and retains the ultimate power over a politician’s career through its vote at general elections. When governments break their promises, or govern contrary to the preferences of their voters, they are pun"}, {"rank": 10, "docid": "test-international-amehbuaisji-pro03b", "score": 0.4518474340438843, "is_gold": false, "snippet": "Just because there is widespread public support for a thing or measure does not mean that it should automatically be the case. The issue should be debated on its own merits, rather than resting on a potentially ill-informed public. Ratification of treaties is "}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-nshbbsbfb-pro04a", "score": 1.0000001192092896, "is_gold": false, "snippet": "It is simply impractical for a major international broadcaster to hand out powers of veto to small sectional interests.  The BBC would quickly be left with a content either devoid of interest or of content were it to allow such a veto to become normative. Espe"}, {"rank": 2, "docid": "test-free-speech-debate-nshbbsbfb-con03a", "score": 0.8473502993583679, "is_gold": false, "snippet": "Why should those who foot the bill have chunks of airtime from which they are, effectively, excluded.  How can it be okay for a broadcaster, funded by a compulsory levy on anyone who owns a television, to willingly produce programmes they know will cause offen"}, {"rank": 3, "docid": "test-free-speech-debate-nshbbsbfb-con03b", "score": 0.8386520147323608, "is_gold": false, "snippet": "The BBC may be unusual but it is designed to fulfill particular functions. The very reason for its existence is to provide a platform for the free expression of a wide range of views, tailored to a wide range of viewers. Within that context, it cannot be expec"}, {"rank": 4, "docid": "test-free-speech-debate-nshbbsbfb-pro03b", "score": 0.8234788179397583, "is_gold": false, "snippet": "It is wrong to suggest that the BBC has any duty on account of its relative funding freedom to give a platform to controversial works of art. On the contrary the BBC has a higher obligation to viewers not to offend them because they are also licence payers. Hi"}, {"rank": 5, "docid": "test-free-speech-debate-nshbbsbfb-pro03a", "score": 0.8223884105682373, "is_gold": false, "snippet": "There is a duty for a broadcaster that is not dependent on either commercial or state funding to give a platform to controversial works of art.  The BBC is in an unusual position, simply because of its funding structure, to promote new or challenging works of "}, {"rank": 6, "docid": "test-free-speech-debate-nshbbsbfb-con02a", "score": 0.7991964817047119, "is_gold": false, "snippet": "Tens of thousands of licence fee payers objected to this, ultimately they are the BBC’s key stakeholder and that view is worthy of respect.  As an institution, the BBC may like to position itself as a global media brand but that doesn’t alter the fact that it "}, {"rank": 7, "docid": "test-free-speech-debate-nshbbsbfb-pro02a", "score": 0.7981964945793152, "is_gold": false, "snippet": "Many people find the views expressed by much of the church offensive, those views are given airtime, a public service broadcaster should provide a level playing field for ideas.  The role of a public service broadcaster, especially one of the stature of the BB"}, {"rank": 8, "docid": "test-free-speech-debate-nshbbsbfb-con02b", "score": 0.7951129078865051, "is_gold": false, "snippet": "In the same way that the BBC is routinely criticised from the political Right for its Left-wing bias and from the Left for a supposed favouritism to the Right, maintaining balance in any sphere of life is difficult. Freedom of speech demands that such a balanc"}, {"rank": 9, "docid": "test-free-speech-debate-nshbbsbfb-pro01a", "score": 0.7943317294120789, "is_gold": false, "snippet": "This was a piece of art, advertised and described as such, those likely to be offended were quite welcome not to watch it.  The allegation made by those who objected to the airing of this show was that it was blasphemous. There were also objections to the grap"}, {"rank": 10, "docid": "test-free-speech-debate-nshbbsbfb-pro01b", "score": 0.7875273823738098, "is_gold": false, "snippet": "As Proposition suggest, the broadcast had been widely discussed in the media before the event and there had been reviews of the stage performance as well as coverage of the subsequent awards. It cannot have come as a huge surprise that this would attract atten"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-amehbuaisji-pro03a", "query": "The American people support ICC membership.  In a democracy the voice of the people should carry weight in determining how the country acts internationally. According to a 2005 poll carried out by the Chicago Council on foreign relations 69% of the US population are in favour of US participation in the ICC. This clearly shows that the US people are unconvinced by the arguments on the theorized drawbacks of the International Criminal Court and are happy for it to be ratified.", "gold_docid": "test-international-amehbuaisji-pro03b", "rank_T": 10, "rank_baseline": 43, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-international-amehbuaisji-pro03a", "score": 0.8154398202896118, "is_gold": false, "snippet": "The American people support ICC membership.  In a democracy the voice of the people should carry weight in determining how the country acts internationally. According to a 2005 poll carried out by the Chicago Council on foreign relations 69% of the US populati"}, {"rank": 2, "docid": "training-law-ilhwpoa9apus-pro02b", "score": 0.5713695883750916, "is_gold": false, "snippet": "While they undermine the court, they are an inevitable quid pro quo of part of diplomatic relations with the US, the last remaining superpower. While impunity is not ideal, it is better than not signing and taking part in international criminal justice at all."}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-pro05b", "score": 0.5519438982009888, "is_gold": false, "snippet": "Promoting the ICC will only further split the global community by allowing the court to become a political tool.  The US Department of State published a report explaining that one of the reasons it opposes ratification of the Rome Statute is because it would c"}, {"rank": 4, "docid": "training-law-ilphbined-con03b", "score": 0.5446452498435974, "is_gold": false, "snippet": "Many of those 122 States Parties have repeatedly shown their reluctance to co-operate with the ICC. Among the African Union states, only Botswana has shown its complete commitment to the Rome Statute. It appears that even South Africa may ultimately be more su"}, {"rank": 5, "docid": "training-international-eptcphbg-con02b", "score": 0.5125224590301514, "is_gold": false, "snippet": "There is a big difference between justice not being done because the United States refuses to cooperate and justice not being done because German prosecutors could not get the evidence to bring charges. If the former there is at least a chance of a trial, poss"}, {"rank": 6, "docid": "training-law-hrilhwpwc-con03b", "score": 0.49450093507766724, "is_gold": false, "snippet": "Firstly, more prosecutions take place in developing nations because in recent decades more war crimes have been committed in developing nations. Western nations have been equally committed to prosecutions in the former Yugoslavia, in an increasingly prosperous"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-con04b", "score": 0.47674447298049927, "is_gold": false, "snippet": "The crime of aggression is not remarkably novel. Intervening in the domestic affairs of a sovereign State is contrary to norms of conventional and customary law. The UN Charter prohibits both the unauthorised use of force against another State and any interven"}, {"rank": 8, "docid": "validation-free-speech-debate-bphwpbsas-pro04b", "score": 0.4727482795715332, "is_gold": false, "snippet": "Popular support is not reason enough to deny people their constitutionally protected rights. The framers of the Constitution were wary of popular opinion, having a justifiable fear that the majority might try to circumscribe the rights of the minority. This is"}, {"rank": 9, "docid": "training-law-ilphbined-con01b", "score": 0.46103549003601074, "is_gold": false, "snippet": "The actions by Columbia and Sri Lanka do not alter the fact that, as noted earlier, the recruitment of child soldiers in Africa and elsewhere is still endemic in 2013.  And while the Lord’s Resistance Army and its leader Joseph Kony have indeed been muted, tha"}, {"rank": 10, "docid": "test-international-amehbuaisji-pro03b", "score": 0.4604823589324951, "is_gold": true, "snippet": "Just because there is widespread public support for a thing or measure does not mean that it should automatically be the case. The issue should be debated on its own merits, rather than resting on a potentially ill-informed public. Ratification of treaties is "}], "topK_baseline": [{"rank": 1, "docid": "test-international-amehbuaisji-pro03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "The American people support ICC membership.  In a democracy the voice of the people should carry weight in determining how the country acts internationally. According to a 2005 poll carried out by the Chicago Council on foreign relations 69% of the US populati"}, {"rank": 2, "docid": "training-law-ilhwpoa9apus-pro02b", "score": 0.8052293062210083, "is_gold": false, "snippet": "While they undermine the court, they are an inevitable quid pro quo of part of diplomatic relations with the US, the last remaining superpower. While impunity is not ideal, it is better than not signing and taking part in international criminal justice at all."}, {"rank": 3, "docid": "validation-law-hrilhbiccfg-pro05b", "score": 0.8041577935218811, "is_gold": false, "snippet": "Promoting the ICC will only further split the global community by allowing the court to become a political tool.  The US Department of State published a report explaining that one of the reasons it opposes ratification of the Rome Statute is because it would c"}, {"rank": 4, "docid": "training-law-ilphbined-con03b", "score": 0.7998408079147339, "is_gold": false, "snippet": "Many of those 122 States Parties have repeatedly shown their reluctance to co-operate with the ICC. Among the African Union states, only Botswana has shown its complete commitment to the Rome Statute. It appears that even South Africa may ultimately be more su"}, {"rank": 5, "docid": "test-law-hrilpgwhwr-con03b", "score": 0.7933061122894287, "is_gold": false, "snippet": "The ICC does not have too much authority, merely the necessary authority to be useful as an institution. It is the very pre-eminence of the US that demands it adhere to the international rule of law, the ICC's existence will not alter that nor lead to charges "}, {"rank": 6, "docid": "validation-law-hrilhbiccfg-pro05a", "score": 0.7822892069816589, "is_gold": false, "snippet": "Efforts to strengthen the ICC will promote global cooperation, norms against crimes, and international stability.  There is a growing global consensus that crimes against humanity need to be punished, as demonstrated by the tribunals to address the crimes of Y"}, {"rank": 7, "docid": "test-law-hrilpgwhwr-pro03b", "score": 0.7820841073989868, "is_gold": false, "snippet": "The US holds a unique position in the fabric of the protection of international peace and security. Whilst it might be appropriate for other States to consent to the jurisdiction of the ICC, these States do not bear the responsibilities and attendant risks beh"}, {"rank": 8, "docid": "test-international-amehbuaisji-con03b", "score": 0.7752591371536255, "is_gold": false, "snippet": "The only effect on US freedom of action would be prohibition of clear and significant violations of international law.  If the US stays within the international criminal law, they will not be affected by the ICC. It would be harmful for any state to have speci"}, {"rank": 9, "docid": "test-law-hrilpgwhwr-con01b", "score": 0.7727048397064209, "is_gold": false, "snippet": "The budget of the ICC is not particularly excessive and can be maintained without US finance. The withholding of US funds from the UN budget is a familiar tactic for expressing disapproval. In 1998, the total US arrears on assessed contributions that had been "}, {"rank": 10, "docid": "test-international-amehbuaisji-pro01b", "score": 0.7706828713417053, "is_gold": false, "snippet": "It took nearly two years for the ICC to launch an investigation into atrocities in the Central African Republic. This has helped defeat the argument that it would be faster than the International Criminal Tribunal for the former Yugoslavia and International Tr"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-environment-opecewiahw-con03a", "query": "Dams displace communities  Dams result in the filling of a large reservoir behind the dam because it has raised the level of the water in the case of the Grand Inga it would create a reservoir 15km long. This is not particularly big but the construction would also displace communities. The previous Inga dams also displaced people. Inga I and II were built 30 and 40 years ago, yet the displaced are still in a shabby prefabricated town called Camp Kinshasa awaiting compensation. [1] Are they likely to do better this time around?  [1] Sanyanga, Ruto, ‘Will Congo Benefit from Grand Inga Dam’, International Policy Digest, 29 June 2013,", "gold_docid": "test-environment-opecewiahw-con03b", "rank_T": 9, "rank_baseline": 41, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-environment-opecewiahw-con03a", "score": 0.6091266870498657, "is_gold": false, "snippet": "Dams displace communities  Dams result in the filling of a large reservoir behind the dam because it has raised the level of the water in the case of the Grand Inga it would create a reservoir 15km long. This is not particularly big but the construction would "}, {"rank": 2, "docid": "training-environment-cegwhwbhd-con03b", "score": 0.5786958336830139, "is_gold": false, "snippet": "Hydroelectric dams don’t destroy communities, governments do. Building dams only violates human rights if the governments building them do so. That’s why we never heard of large-scale human rights violations when the Hoover Dam in the United States was built. "}, {"rank": 3, "docid": "test-environment-opecewiahw-pro02b", "score": 0.5413479804992676, "is_gold": false, "snippet": "While it is clear that such an immense project will have an impact we have little idea what that impact might be. Will the builders be local? Will the suppliers be local? It is likely that the benefit will go elsewhere just as the electricity will go to South "}, {"rank": 4, "docid": "test-environment-opecewiahw-pro04b", "score": 0.47849076986312866, "is_gold": false, "snippet": "There is currently not enough traffic to justify such a large addition to the project. If it were worthwhile then it could be done without the need for building an immense dam."}, {"rank": 5, "docid": "training-environment-cegwhwbhd-con03a", "score": 0.46942397952079773, "is_gold": false, "snippet": "Hydroelectric dams destroy communities  What applies to the environment, also applies to the human communities. Building dams often involves relocating people and removing them from their ancestral homelands. For example, China’s Three Gorges Dam involved relo"}, {"rank": 6, "docid": "training-environment-pwshwdotsc-con03b", "score": 0.44909632205963135, "is_gold": false, "snippet": "Out of town shopping centres do not damage local communities, they strengthen them. Shopping is easier, more convenient and more accessible than before, leaving more time for community activities. Furthermore, they act as hubs for community cohesion, teenagers"}, {"rank": 7, "docid": "validation-international-alhrhbushdmd-pro04b", "score": 0.43305742740631104, "is_gold": false, "snippet": "There was and continues to be a compelling case for a humanitarian response to the crises, but this does not suggest that military intervention would have solved the situation.  Military intervention and the collapse of the Sudanese state would have quite poss"}, {"rank": 8, "docid": "training-environment-pwshwdotsc-pro02b", "score": 0.43101438879966736, "is_gold": false, "snippet": "Out of town centres distort urban growth patterns. Because they are not organic growth, out of town centres often warp local infrastructure provision. So, while (for example) they may have good access roads built, there will be fewer amenities built at the sam"}, {"rank": 9, "docid": "test-environment-opecewiahw-con03b", "score": 0.4304894208908081, "is_gold": true, "snippet": "Yes they are. Big international donors like the World Bank who are supporting the project will ensure that there is compensation for those displaced and that they get good accommodation. In a budget of up to $80billion the cost of compensation and relocation i"}, {"rank": 10, "docid": "training-environment-cephwcear-con02b", "score": 0.4260697364807129, "is_gold": false, "snippet": "To start with, let’s not believe the line that local communities see this as an unadulterated good – they have very real concerns about the impact on their qualities of life. [1] It’s also untrue that workers elsewhere in the world see this as purely beneficia"}], "topK_baseline": [{"rank": 1, "docid": "test-environment-opecewiahw-con03a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Dams displace communities  Dams result in the filling of a large reservoir behind the dam because it has raised the level of the water in the case of the Grand Inga it would create a reservoir 15km long. This is not particularly big but the construction would "}, {"rank": 2, "docid": "training-environment-cegwhwbhd-con03a", "score": 0.7804905772209167, "is_gold": false, "snippet": "Hydroelectric dams destroy communities  What applies to the environment, also applies to the human communities. Building dams often involves relocating people and removing them from their ancestral homelands. For example, China’s Three Gorges Dam involved relo"}, {"rank": 3, "docid": "training-environment-cegwhwbhd-con03b", "score": 0.7539501786231995, "is_gold": false, "snippet": "Hydroelectric dams don’t destroy communities, governments do. Building dams only violates human rights if the governments building them do so. That’s why we never heard of large-scale human rights violations when the Hoover Dam in the United States was built. "}, {"rank": 4, "docid": "test-environment-opecewiahw-con02a", "score": 0.7381151914596558, "is_gold": false, "snippet": "A dam would damage the environment  Dams due to their generation of renewable electricity are usually seen as environmentally friendly but such mega projects are rarely without consequences. The Grand Inga would lower the oxygen content of the lower course of "}, {"rank": 5, "docid": "test-environment-opecewiahw-pro02b", "score": 0.7377819418907166, "is_gold": false, "snippet": "While it is clear that such an immense project will have an impact we have little idea what that impact might be. Will the builders be local? Will the suppliers be local? It is likely that the benefit will go elsewhere just as the electricity will go to South "}, {"rank": 6, "docid": "test-environment-opecewiahw-pro04b", "score": 0.7376874089241028, "is_gold": false, "snippet": "There is currently not enough traffic to justify such a large addition to the project. If it were worthwhile then it could be done without the need for building an immense dam."}, {"rank": 7, "docid": "test-environment-opecewiahw-pro03b", "score": 0.7298644185066223, "is_gold": false, "snippet": "In the short to medium term during the decades the dam is being built investment will surely be concentrated in one place in this vast country; in the west where the dam is, not the east where the conflicts are. Later there is little guarantee that the governm"}, {"rank": 8, "docid": "training-environment-cegwhwbhd-pro03b", "score": 0.7239288091659546, "is_gold": false, "snippet": "As well as benefits hydroelectric dams have added dangers. Dams increase the risk of earthquakes, because the weight of the water-reservoir impacts the Earth’s crust underneath. [1] Moreover, big dams run the risk of bursting, causing massive damage in their w"}, {"rank": 9, "docid": "test-environment-opecewiahw-con01a", "score": 0.7224205136299133, "is_gold": false, "snippet": "Such a big project is beyond DRC’s capacity  The Grand Inga dam project is huge while it means huge potential benefits it just makes it more difficult for the country to manage. Transparency international ranks DRC as 160th out of 176 in terms of corruption [1"}, {"rank": 10, "docid": "test-environment-opecewiahw-pro04a", "score": 0.7187689542770386, "is_gold": false, "snippet": "A dam could make the Congo more usable  While the Congo is mostly navigable it is only usable internally. The rapids cut the middle Congo off from the sea. The building of the dams could be combined with canalisation and locks to enable international goods to "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-economy-epegiahsc-con04a", "query": "FTAA is bad for labour in developed countries.  Liberalizing the labour market across the entirety of the Americas would be a severe blow to workers in the US and Canada. It would put them in direct competition with workers from countries where the average salary is much lower than in the US, who would be willing to work for a fraction of what a US or Canadian worker currently makes. In order to stay competitive in such a market, they would have to accept lower salaries and a cut in benefits. This would reverse decades of progress in the direction of better protections for workers and workers’ rights, as well as lead to higher unemployment levels in developed countries [1] . This has occurred as a result of previous free trade agreements in the Americas for example the North American Free Trade Area (NAFTA) after it was implemented resulted in the displacement of 682,000 US jobs [2] this then gives employers a chance to reduce working conditions as there is surplus labor.  [1] Suroweicki, James. “The Free-Trade Paradox.” The New Yorker. 26 May 2008.   [2] Scott, Robert E., “Heading South: U.S.-Mexico trade and job displacement after NAFTA”, Economic Policy Institute, 3 May 2011,", "gold_docid": "test-economy-epegiahsc-con04b", "rank_T": 5, "rank_baseline": 27, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-economy-epegiahsc-con04a", "score": 0.6354126930236816, "is_gold": false, "snippet": "FTAA is bad for labour in developed countries.  Liberalizing the labour market across the entirety of the Americas would be a severe blow to workers in the US and Canada. It would put them in direct competition with workers from countries where the average sal"}, {"rank": 2, "docid": "training-economy-epiahbnhba-pro02b", "score": 0.599979043006897, "is_gold": false, "snippet": "NAFTA's harmful effects on American industry outweigh its benefits. Americans are not helped by lower prices if they lose their job and have no money. Furthermore, evidence shows the American jobs lost through NAFTA were largely high-wage manufacturing jobs, t"}, {"rank": 3, "docid": "training-economy-epiahbnhba-con01b", "score": 0.5868789553642273, "is_gold": false, "snippet": "The loss of US production jobs is part of a greater global trend; NAFTA is not responsible for this change. Mexico and Canada are responsible for only one-fifth of the growth in the US trade deficit. The rapid acceleration of technological communication has ma"}, {"rank": 4, "docid": "training-economy-epiahbnhba-con05b", "score": 0.5649466514587402, "is_gold": false, "snippet": "NAFTA has reduced the cost of production. In a free trade economy, workers only have the upper hand in bargaining if there is a labor shortage. NAFTA does not deprive workers of something they are entitled to; if a company saves money by relocating production,"}, {"rank": 5, "docid": "test-economy-epegiahsc-con04b", "score": 0.5591961145401001, "is_gold": true, "snippet": "Employers will always pay a premium for workers who have the necessary education, technical and language skills that are needed to do the jobs that insure the companies’ financial success. Such workers would be primarily sourced from developed countries, which"}, {"rank": 6, "docid": "training-economy-bepeghbnmw-con04b", "score": 0.5499570369720459, "is_gold": false, "snippet": "Businesses are concerned with their bottom line. They will pay workers as little as possible in order to maximize profits. Certainly in some businesses employers require highly skilled workers for which they will be willing to pay competitive wages. However, t"}, {"rank": 7, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.5489578247070312, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 8, "docid": "test-politics-pgsimhwoia-pro03b", "score": 0.5363999009132385, "is_gold": false, "snippet": "Migrants also benefit developed countries albeit in a slightly different way. Migrants, often even those who are highly educated, provide a cheap workforce doing the jobs that native workers don't want to do. This is particularly the case in agriculture in dev"}, {"rank": 9, "docid": "training-economy-epiahbnhba-pro01b", "score": 0.5316125154495239, "is_gold": false, "snippet": "While Canada has experienced some economic benefits due to NAFTA, these benefits do not outweigh the harms for North America overall. Furthermore, as the Con discusses below, Canada has struggled to reconcile its environmental regulations with NAFTA, thereby h"}, {"rank": 10, "docid": "training-international-gsimhbnws-con04b", "score": 0.5310727953910828, "is_gold": false, "snippet": "The effect of migration on unemployment is actually positive: it provides cheap labor for receiving countries, and lowers the supply of labor in source countries where employers can often not afford to pay sufficient wages to their workers. The claim that immi"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-epegiahsc-con04a", "score": 0.9999998807907104, "is_gold": false, "snippet": "FTAA is bad for labour in developed countries.  Liberalizing the labour market across the entirety of the Americas would be a severe blow to workers in the US and Canada. It would put them in direct competition with workers from countries where the average sal"}, {"rank": 2, "docid": "test-economy-epegiahsc-con01a", "score": 0.832612931728363, "is_gold": false, "snippet": "The FTAA is bad for industries in developing nations.  This agreement would put farmers and workers in some of the world’s most impoverished nations in direct competition with some of the richest companies in the developed world. FTAA would have small, domesti"}, {"rank": 3, "docid": "test-economy-epehwmrbals-pro05a", "score": 0.8281121253967285, "is_gold": false, "snippet": "When developing countries employ poor labour standards, other countries follow the example in order to be competitive  As long as developing nations constantly keep employing poor labour standards, it will keep putting a strain on the global economy. This is b"}, {"rank": 4, "docid": "training-economy-epiahbnhba-pro02b", "score": 0.8151445984840393, "is_gold": false, "snippet": "NAFTA's harmful effects on American industry outweigh its benefits. Americans are not helped by lower prices if they lose their job and have no money. Furthermore, evidence shows the American jobs lost through NAFTA were largely high-wage manufacturing jobs, t"}, {"rank": 5, "docid": "training-economy-epiahbnhba-con05a", "score": 0.8091228008270264, "is_gold": false, "snippet": "NAFTA has reduced workers' bargaining power.  In reducing barriers to imports and exports, NAFTA has shifted bargaining power in favor of producers, who can more easily relocate factories if workers in an area are too demanding. This allows more exploitation o"}, {"rank": 6, "docid": "test-economy-epegiahsc-con03a", "score": 0.8066821098327637, "is_gold": false, "snippet": "FTAA is bad for the environment.  Free trade creates a \"race to the bottom\", whereby developing countries lower their labor and environmental standards in an effort to attract foreign investment. Developed countries, which may have higher standards, are then f"}, {"rank": 7, "docid": "training-economy-feghbgft-con03a", "score": 0.7930213809013367, "is_gold": false, "snippet": "It is just to protect industry and jobs.  When countries dump their products in other markets without barriers, they undercut the ability for local industries to compete. If those local industries try to compete, large foreign or multinational companies can us"}, {"rank": 8, "docid": "training-economy-epiahbnhba-con05b", "score": 0.7930183410644531, "is_gold": false, "snippet": "NAFTA has reduced the cost of production. In a free trade economy, workers only have the upper hand in bargaining if there is a labor shortage. NAFTA does not deprive workers of something they are entitled to; if a company saves money by relocating production,"}, {"rank": 9, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.7918248772621155, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 10, "docid": "training-economy-epiahbnhba-con01b", "score": 0.7898476123809814, "is_gold": false, "snippet": "The loss of US production jobs is part of a greater global trend; NAFTA is not responsible for this change. Mexico and Canada are responsible for only one-fifth of the growth in the US trade deficit. The rapid acceleration of technological communication has ma"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-siacphbnt-pro04a", "query": "Changing education systems and democracy.  Technology has enabled access to e-books and resources for students and teachers [1] . Such changes have enabled improved efficiency in teaching, with the availability of up-to-date resources and awareness of relevant theories. Furthermore, the ease by which students are able to access multiple resources and buy books online is expanding their intellectual curiosity and library.  In addition to raising new students, technology can be seen as a tool for democracy. Technology provides a tool for government accountability, transparency in information, and for good governance. Organisations, such as Ushahidi (Crowdmapping) following Kenya’s 2007 post-election violence; and mySociety which updates citizens on parliamentary proceedings in South Africa, show how technology is feeding democratisation for youths [2] .  [1] See further readings: Turcano, 2013.  [2] See further readings: Treisman, 2013; Usahidi, 2013.", "gold_docid": "test-international-siacphbnt-pro04b", "rank_T": 3, "rank_baseline": 24, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-international-siacphbnt-pro04a", "score": 0.7219387292861938, "is_gold": false, "snippet": "Changing education systems and democracy.  Technology has enabled access to e-books and resources for students and teachers [1] . Such changes have enabled improved efficiency in teaching, with the availability of up-to-date resources and awareness of relevant"}, {"rank": 2, "docid": "test-science-nsihwbtiss-con01b", "score": 0.5660768747329712, "is_gold": false, "snippet": "Even if this were a great educational tool, some kids may not have access to it. Poverty or a parent’s life style choice might leave kids without access to a computer or the internet, preventing them from joining into such online discussions. This might make t"}, {"rank": 3, "docid": "test-international-siacphbnt-pro04b", "score": 0.5601699352264404, "is_gold": true, "snippet": "Despite programs distributing technology into schools does the availability of technology provides future benefits? Having a tablet does not ensure teachers are well-trained to assist and guide the children. Without proper oversight it might prove more of a di"}, {"rank": 4, "docid": "validation-digital-freedoms-gthwaueai-con02b", "score": 0.535758376121521, "is_gold": false, "snippet": "Computer literacy is constantly on the rise [1] [2] . In state-run secondary schools, children are provided with information and technology classes which helps to bridge any existing divide [3] , and there are discussions about extending these lessons to prima"}, {"rank": 5, "docid": "training-international-epvhwav1ep-pro04b", "score": 0.5289084911346436, "is_gold": false, "snippet": "While lowering the European Parliament voting age may provide an incentive to link in civic or political studies there is no guarantee that this will actually happen. There is also no reason why it should not happen already; there should not need to be an elec"}, {"rank": 6, "docid": "training-digital-freedoms-aihbied-pro02b", "score": 0.5200998783111572, "is_gold": false, "snippet": "To use such websites governments already need to be committed to democracy. Promoting democracy in already-democratic countries is irrelevant. Countries that are not democratic, and seek to maintain autocratic rule will not be impacted by the availability of t"}, {"rank": 7, "docid": "test-education-udfakusma-pro01b", "score": 0.5049598813056946, "is_gold": false, "snippet": "Making these academic materials available to the general public does not mean they are useful to anyone. Many of the materials universities produce are not useful unless the reader has attended the relevant lectures. Rather than simply putting those lectures t"}, {"rank": 8, "docid": "validation-digital-freedoms-gthwaueai-pro02b", "score": 0.49295905232429504, "is_gold": false, "snippet": "Our political situation is not as dire as this point makes it seem; it is easy to manipulate statistics between voting and reality televisions by discounting the fact that many people who vote in television shows vote multiple times – often as many as ten [1] "}, {"rank": 9, "docid": "training-digital-freedoms-gtdfais-con02b", "score": 0.4921034574508667, "is_gold": false, "snippet": "Democratic change can come about in a variety of ways. Violent public protests are only one such way, and probably the least desirable one. And now, with access to social media nearly universally available, such protests can be organized faster, on a larger, m"}, {"rank": 10, "docid": "training-philosophy-pphsipd-con03b", "score": 0.488563597202301, "is_gold": false, "snippet": "The more experience of participatory democracy the people have, the better they will get at it. In particular, common wisdom will learn from past mistakes. Whilst the Californian example cited is true, it is also true that in 2000, just six years after the “Th"}], "topK_baseline": [{"rank": 1, "docid": "test-international-siacphbnt-pro04a", "score": 1.0, "is_gold": false, "snippet": "Changing education systems and democracy.  Technology has enabled access to e-books and resources for students and teachers [1] . Such changes have enabled improved efficiency in teaching, with the availability of up-to-date resources and awareness of relevant"}, {"rank": 2, "docid": "validation-digital-freedoms-gthwaueai-con02b", "score": 0.791059136390686, "is_gold": false, "snippet": "Computer literacy is constantly on the rise [1] [2] . In state-run secondary schools, children are provided with information and technology classes which helps to bridge any existing divide [3] , and there are discussions about extending these lessons to prima"}, {"rank": 3, "docid": "training-digital-freedoms-aihbied-pro02a", "score": 0.7693368196487427, "is_gold": false, "snippet": "Websites can strengthen democratic institutions.  The promotion of democracy is not only about forming new democracies; strengthening existing democratic institutions around the globe. To do so, transparency and government-citizen communication is necessary. B"}, {"rank": 4, "docid": "test-international-siacphbnt-con03b", "score": 0.752716600894928, "is_gold": false, "snippet": "Technology is enhancing security, not threatening it. Measures are being implemented to ensure cyber-security and further technology is creating new, local, initiatives for security on the ground. Ushahidi Crowdmapping - an interactive, collective, mapping too"}, {"rank": 5, "docid": "training-digital-freedoms-aihbied-pro02b", "score": 0.7504507303237915, "is_gold": false, "snippet": "To use such websites governments already need to be committed to democracy. Promoting democracy in already-democratic countries is irrelevant. Countries that are not democratic, and seek to maintain autocratic rule will not be impacted by the availability of t"}, {"rank": 6, "docid": "test-education-udfakusma-pro01b", "score": 0.7464751601219177, "is_gold": false, "snippet": "Making these academic materials available to the general public does not mean they are useful to anyone. Many of the materials universities produce are not useful unless the reader has attended the relevant lectures. Rather than simply putting those lectures t"}, {"rank": 7, "docid": "validation-digital-freedoms-gthwaueai-pro02a", "score": 0.7457363605499268, "is_gold": false, "snippet": "Modernisation  In modern, developed countries, many people spend both work and leisure time on the internet or using electronic devices [1] [2] [3] [4] . Our traditional voting systems, with polling stations and paper slips, is out of line with how many of the"}, {"rank": 8, "docid": "test-international-siacphbnt-con02b", "score": 0.7442929148674011, "is_gold": false, "snippet": "The technological revolution across Africa is broad, ranging from mobile technology to internet connectivity. The availability of mobiles has broadened who can use technology - being more inclusive to multiple socio-economic groups.  Internet.org [1] has been "}, {"rank": 9, "docid": "training-digital-freedoms-aihbied-con03b", "score": 0.7427091598510742, "is_gold": false, "snippet": "With any tool there are going to be people who misuse it, yet cases of misuse do not outweigh times when the internet has proven to be an important force for democracy. Internet and SMS have helped to organize almost every uprising in the Middle East and the O"}, {"rank": 10, "docid": "training-politics-pgglgvhciu-pro02b", "score": 0.7425281405448914, "is_gold": false, "snippet": "Most developed nations are representative democracies, in which we elect people to represent us and make decisions on our behalf. We retain the ultimate control over these representatives at the ballot box, and if we disagree with the decisions they have made "}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-health-hpehwadvoee-con05a", "query": "Doctors should not be asked to take the moral burden of people who want to commit suicide  It is not fair to ask doctors who have committed their lives to preserving health to act as an instrument of killing a person. The doctor will then have to live with the doubt as to whether the act of assisting in the donation was just or not. In other words, if the person who wanted to die for another did not do so voluntarily, the act of killing him or her is morally wrong and the doctor becomes complicit. In order to carry out this scheme, the individual moral autonomy of doctors will be violated. [1]  [1] Tremblay, Joe. “Organ Donation Euthanasia: A Growing Epidemic.” Catholic News Agency, (2013).", "gold_docid": "test-health-hpehwadvoee-con05b", "rank_T": 7, "rank_baseline": 27, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-health-dhpelhbass-con04b", "score": 0.6671586036682129, "is_gold": false, "snippet": "However, the idea that we should not kill is not absolute, even for those with religious beliefs — killing in war or self-defence is justified by most. We already let people die because they are allowed to refuse treatment which could save their life, and this"}, {"rank": 2, "docid": "test-health-hpehwadvoee-con05a", "score": 0.6365754008293152, "is_gold": false, "snippet": "Doctors should not be asked to take the moral burden of people who want to commit suicide  It is not fair to ask doctors who have committed their lives to preserving health to act as an instrument of killing a person. The doctor will then have to live with the"}, {"rank": 3, "docid": "test-law-lgplhbssbco-con03b", "score": 0.618799090385437, "is_gold": false, "snippet": "The fact of suffering is what makes it impossible to consider suicide a legitimate choice. Someone under the duress of intense pain and/or discomfort is not going to be able to make a fully voluntary and informed choice to end their life."}, {"rank": 4, "docid": "test-health-hpehwadvoee-con02b", "score": 0.6150510311126709, "is_gold": false, "snippet": "Firstly, this case is about emergencies. Consent is important, but it cannot be compared to the importance of saving a life. Secondly, the person whose consent matters is the donor who is making the sacrifice. The recipient can be expected to want to live, eve"}, {"rank": 5, "docid": "test-health-dhpelhbass-con02b", "score": 0.6015351414680481, "is_gold": false, "snippet": "Society recognises that suicide is unfortunate but acceptable in some circumstances – those who end their own lives are not seen as evil. It seems odd that it is a crime to assist a non-crime. The illegality of assisted suicide is therefore particularly cruel "}, {"rank": 6, "docid": "test-philosophy-elhbrd-con04b", "score": 0.5981026291847229, "is_gold": false, "snippet": "Obviously nobody is going to compel doctors or others in the medical profession to undertake a procedure of which they do not approve. Indeed doctors are routinely required to give independent advice - so that a patient is aware of the available options - with"}, {"rank": 7, "docid": "test-health-hpehwadvoee-con05b", "score": 0.5972005128860474, "is_gold": true, "snippet": "This is easily solved. Similarly to doctors who assist in cases of abortion or even executions doctors must have the option of opting out. However, once it is proven that this model is ethically good, it is likely that there are doctors who will realise the po"}, {"rank": 8, "docid": "training-law-rgmelhrpwhbw-pro01b", "score": 0.5924772620201111, "is_gold": false, "snippet": "Even if we do have an obligation to end mass suffering and indiscriminate killing, invasion is not the way to do so. Western intervention will inevitably increase the collateral damage by escalating the conflict into a full-scale war. Moreover, there is no gua"}, {"rank": 9, "docid": "test-health-dhpelhbass-pro01b", "score": 0.5922532081604004, "is_gold": false, "snippet": "There is no comparison between the right to life and other rights. When you choose to remain silent, you may change your mind at a later date; when you choose to die, you have no such second chance. Arguments from pro-life groups suggest that nearly ninety-fiv"}, {"rank": 10, "docid": "test-philosophy-elhbrd-con04a", "score": 0.5909413695335388, "is_gold": false, "snippet": "The death of one individual has implications for others, which by definition, do not affect the suicide herself.  Even setting aside the religious concerns of many in this situation [i] , there are solid secular reasons for accepting the sanctity of life. Firs"}], "topK_baseline": [{"rank": 1, "docid": "test-health-hpehwadvoee-con05a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Doctors should not be asked to take the moral burden of people who want to commit suicide  It is not fair to ask doctors who have committed their lives to preserving health to act as an instrument of killing a person. The doctor will then have to live with the"}, {"rank": 2, "docid": "test-health-dhpelhbass-con04b", "score": 0.8296215534210205, "is_gold": false, "snippet": "However, the idea that we should not kill is not absolute, even for those with religious beliefs — killing in war or self-defence is justified by most. We already let people die because they are allowed to refuse treatment which could save their life, and this"}, {"rank": 3, "docid": "test-health-dhpelhbass-con01a", "score": 0.8264565467834473, "is_gold": false, "snippet": "It is vital that a doctor's role not be confused  The guiding principle of medical ethics is to do no harm: a physician must not be involved in deliberately harming their patient. Without this principle, the medical profession would lose a great deal of trust;"}, {"rank": 4, "docid": "test-health-hpehwadvoee-con04a", "score": 0.813137948513031, "is_gold": false, "snippet": "The role of society is to save lives not to assist in suicide  The purpose of society, the health sector and more specifically the doctors is to preserve health, not to be damaging health or even assisting in the ending of a life even if voluntarily. As part o"}, {"rank": 5, "docid": "test-health-dhpelhbass-con02a", "score": 0.8126457929611206, "is_gold": false, "snippet": "If someone is threatening to kill themselves it is your moral duty to try to stop them  Those who commit suicide are not evil, and those who attempt to take their own lives are not prosecuted. However, it is your moral duty to try and prevent people from commi"}, {"rank": 6, "docid": "test-health-hpehwadvoee-con01a", "score": 0.8079209923744202, "is_gold": false, "snippet": "Self-preservation is our primary moral duty  Many people, especially those who belong to religious groups believe that we have a duty to preserve our own lives. They would argue that suicide is never justified, even if the reasons might appear to be good. It i"}, {"rank": 7, "docid": "test-philosophy-elhbrd-con04a", "score": 0.8057237863540649, "is_gold": false, "snippet": "The death of one individual has implications for others, which by definition, do not affect the suicide herself.  Even setting aside the religious concerns of many in this situation [i] , there are solid secular reasons for accepting the sanctity of life. Firs"}, {"rank": 8, "docid": "test-health-dhpelhbass-pro01b", "score": 0.7971362471580505, "is_gold": false, "snippet": "There is no comparison between the right to life and other rights. When you choose to remain silent, you may change your mind at a later date; when you choose to die, you have no such second chance. Arguments from pro-life groups suggest that nearly ninety-fiv"}, {"rank": 9, "docid": "test-health-hpehwadvoee-con02b", "score": 0.7900405526161194, "is_gold": false, "snippet": "Firstly, this case is about emergencies. Consent is important, but it cannot be compared to the importance of saving a life. Secondly, the person whose consent matters is the donor who is making the sacrifice. The recipient can be expected to want to live, eve"}, {"rank": 10, "docid": "test-health-hpehwadvoee-pro05b", "score": 0.7898383140563965, "is_gold": false, "snippet": "It is cynical to encourage people commit suicide to bring the media’s attention to an issue. If there is too little attention, the problem lies with the media and needs to be solved by changing the media. It is not the responsibility of vulnerable relatives to"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-aglhrilhb-pro02a", "query": "The only just method  Prosecuting offenders is the only way to get a just outcome when there have been horrific crimes committed. At a most principled level, those who commit a crime ought to be held accountable for their actions even if they are powerful or it damages the chances of peace because the powerful must be shown not to be above the law. Even where the law did not exist, or the leaders were in control of the law, international norms provide a standard for what actions merit prosecution, and judiciaries have been very good at convicting those who committed atrocities[1]. Having those who committed crimes convicted by law courts helps prevent those affected by atrocities holding grudges and put the past behind them so aiding the healing process [2].  [1] Moore, John J Jr ‘Problems With Forgiveness’ 43 Stanford Law Review 733, February 1991  [2] abc news, ‘Dallas Holocaust survivors welcome prosecution of former Nazi guard’, wfaa.com, 20 August 2010,", "gold_docid": "test-international-aglhrilhb-pro02b", "rank_T": 5, "rank_baseline": 24, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-international-aglhrilhb-pro02a", "score": 0.7879700660705566, "is_gold": false, "snippet": "The only just method  Prosecuting offenders is the only way to get a just outcome when there have been horrific crimes committed. At a most principled level, those who commit a crime ought to be held accountable for their actions even if they are powerful or i"}, {"rank": 2, "docid": "training-law-hrilhwpwc-pro01b", "score": 0.6010201573371887, "is_gold": false, "snippet": "The very scale of war crimes means that courts are inadequate vehicles for prevention or punishment. To achieve the international community’s goal of “never again” other methods, like sanctions, diplomatic engagement and the appropriate use of military deterre"}, {"rank": 3, "docid": "training-international-alhrilphbp-con03b", "score": 0.5808457136154175, "is_gold": false, "snippet": "Justice is not easy. However, it needs to be done – for its own ends, and for a lasting peace. In cases where there are a huge number of perpetrators then the obvious approach is to offer an amnesty to those who committed smaller crimes while prosecuting those"}, {"rank": 4, "docid": "training-law-hrilhwpwc-pro02b", "score": 0.5634534358978271, "is_gold": false, "snippet": "It is doubtful whether genocide such as this is based on rational calculations. For instance, the diversion of resources into the ‘Final Solution’ was a major reason why Hitler lost the war. In the same way, war criminals are unlikely to be deterred by legal t"}, {"rank": 5, "docid": "test-international-aglhrilhb-pro02b", "score": 0.5506176352500916, "is_gold": true, "snippet": "Most often, prosecutions that occur are not just with only the losing side being prosecuted for their crimes. The Nuremburg trials prosecuted Nazi’s for offences they committed, but none of the Allied forces were ever brought for trial; Curtis LeMay who comman"}, {"rank": 6, "docid": "training-international-alhrilphbp-pro02b", "score": 0.5466101765632629, "is_gold": false, "snippet": "While distasteful, sometimes cutting deals with perpetrators is necessary to bring a quick end to the human suffering that conflicts cause [1] .  In advocating prosecutions, justice can simply ignore victims. Atrocities are more than likely to have been commit"}, {"rank": 7, "docid": "training-law-hrilhwsyh-pro01b", "score": 0.538076639175415, "is_gold": false, "snippet": "Simply committing murder, or imprisonment, or persecution is not enough to make a crime a crime against humanity. It must be “widespread or systematic”. A great many states are involved in individual killings or unjust imprisonments so there has to be a thresh"}, {"rank": 8, "docid": "training-international-alhrilphbp-con01b", "score": 0.53607177734375, "is_gold": false, "snippet": "Argentina did not prosecute for a long time after the collapse of the junta [1] , a 1986 law, commonly known as the Full Stop Law (also known by its number, Law 23492), prohibited prosecution of those involved in the dirty war which resulted in up to 30,000 de"}, {"rank": 9, "docid": "training-law-hrilhwpwc-con02b", "score": 0.5341278314590454, "is_gold": false, "snippet": "In most instances, victims support the progress of prosecutions and are willing to testify. If many people in the society had connections to criminal regimes then that has to be acknowledged and addressed through official means. If not, the tensions will still"}, {"rank": 10, "docid": "training-law-hrilhwpwc-con01b", "score": 0.5336658954620361, "is_gold": false, "snippet": "Proving the commission of crimes on this scale beyond reasonable doubt must take a great deal of time and expertise. The end is so important that the cost must be borne. The successes at Nuremburg and the ICTY convictions prove that it is possible to bring war"}], "topK_baseline": [{"rank": 1, "docid": "test-international-aglhrilhb-pro02a", "score": 0.9999998807907104, "is_gold": false, "snippet": "The only just method  Prosecuting offenders is the only way to get a just outcome when there have been horrific crimes committed. At a most principled level, those who commit a crime ought to be held accountable for their actions even if they are powerful or i"}, {"rank": 2, "docid": "training-international-alhrilphbp-pro02b", "score": 0.8128150105476379, "is_gold": false, "snippet": "While distasteful, sometimes cutting deals with perpetrators is necessary to bring a quick end to the human suffering that conflicts cause [1] .  In advocating prosecutions, justice can simply ignore victims. Atrocities are more than likely to have been commit"}, {"rank": 3, "docid": "test-international-aglhrilhb-pro01a", "score": 0.8065585494041443, "is_gold": false, "snippet": "Prosecutions are needed for victims  Prosecutions are the only way for victims to see those who caused pain against them brought to justice. The alternative of some kind of reconciliation often leaves those who perpetrated crimes able to retain power as has ha"}, {"rank": 4, "docid": "training-international-alhrilphbp-pro02a", "score": 0.8013082146644592, "is_gold": false, "snippet": "Accountability  It is a fundamental principle of morality that individuals should be held responsible for their crimes – that is the reason why we, as societies, have criminal law.  Prosecuting people – holding them responsible for their crimes – is a moral im"}, {"rank": 5, "docid": "training-international-alhrilphbp-con03b", "score": 0.8007256388664246, "is_gold": false, "snippet": "Justice is not easy. However, it needs to be done – for its own ends, and for a lasting peace. In cases where there are a huge number of perpetrators then the obvious approach is to offer an amnesty to those who committed smaller crimes while prosecuting those"}, {"rank": 6, "docid": "validation-law-hrilhbiccfg-pro03a", "score": 0.7988674640655518, "is_gold": false, "snippet": "The ICC will prosecute leaders who commit the most severe crimes and give them their due.  The only way to ensure that leaders get what they deserve is to establish a free-standing, independent court that holds people accountable. The ICC acts as a permanent i"}, {"rank": 7, "docid": "training-law-hrilhwsyh-pro01b", "score": 0.791566789150238, "is_gold": false, "snippet": "Simply committing murder, or imprisonment, or persecution is not enough to make a crime a crime against humanity. It must be “widespread or systematic”. A great many states are involved in individual killings or unjust imprisonments so there has to be a thresh"}, {"rank": 8, "docid": "training-law-hrilhwpwc-pro01a", "score": 0.79026198387146, "is_gold": false, "snippet": "War criminals need to be prosecuted in order to provide justice.  In the instances of small-scale crime we accept that if a community condemns a person’s action, our sense of justice demands that they be punished. However, it is often the case that those who c"}, {"rank": 9, "docid": "validation-law-hrilhbiccfg-pro04b", "score": 0.7869528532028198, "is_gold": false, "snippet": "The ICC actually fails to account for the individual nature of crimes and is not the best solution for a \"globalizing world\" because it promotes retribution at the expense of peace.  Sometimes, amnesty and reconciliation are better than pursuing retribution an"}, {"rank": 10, "docid": "validation-law-hrilhbiccfg-pro01a", "score": 0.7867497205734253, "is_gold": false, "snippet": "The ICC is the best way to prosecute serious crimes because of its permanence; individual tribunals are not enough.  The ICC is uniquely beneficial because of its intention to be a permanent force that will always hold people accountable, instead of slowly rea"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-economy-epehwmrbals-con01a", "query": "Universal standards of labour and business are not suited to the race for development  Developing countries are in a race to develop their economies. The prioritisation of countries that are not currently developed is different to the priorities of developed countries as a result of their circumstances and they must be allowed to temporarily push back standards of labour and business until they achieve a level playing field with the rest of the world. This is because economic development is a necessary precondition for many of the kinds of labour standards enjoyed in the west. For there to be high labour standards there clearly needs to be employment to have those standards. Undeveloped countries are reliant upon cheap, flexible, labour to work in factories to create economic growth as happened in China. In such cases the comparative advantage is through their cheap labour. If there had been high levels of government imposed labour standards and working conditions then multinational firms would never have located their factories in the country as the cost of running them would have been too high. [1] Malaysia for example has struggled to contain activity from the Malaysian Trades Union Congress to prevent their jobs moving to China [2] as the competition does not have labour standards so helping keep employment cheap. [3]  [1] Fang, Cai, and Wang, Dewen, ‘Employment growth, labour scarcity and the nature of China’s trade expansion’,  , p.145, 154  [2] Rasiah, Rajah, ‘The Competitive Impact of China on Southeast Asia’s Labor Markets’, Development Research Series, Research Center on Development and International Relations, Working Paper No.114, 2002,  P.32  [3] Bildner, Eli, ‘China’s Uneven Labor Revolution’, The Atlantic, 11 January 2013,", "gold_docid": "test-economy-epehwmrbals-con01b", "rank_T": 7, "rank_baseline": 24, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.633944571018219, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 2, "docid": "test-economy-epehwmrbals-con01a", "score": 0.6211423277854919, "is_gold": false, "snippet": "Universal standards of labour and business are not suited to the race for development  Developing countries are in a race to develop their economies. The prioritisation of countries that are not currently developed is different to the priorities of developed c"}, {"rank": 3, "docid": "test-economy-epehwmrbals-con02a", "score": 0.5399650931358337, "is_gold": false, "snippet": "There is nothing wrong with individualised standards. It is the question on implementing them better and not raising standards  The chances that these international labour standards are even relevant to these developing nations are low. For example, India need"}, {"rank": 4, "docid": "test-economy-bepahbtsnrt-pro03b", "score": 0.5362242460250854, "is_gold": false, "snippet": "The majority of modern economic industries have to face overseas competition. Tunisia, like its North African neighbours, was convinced in the 1990s to emplace neo-liberal reforms in return for increased lending from the World Bank and other lenders. These ref"}, {"rank": 5, "docid": "training-economy-feghbgft-con02b", "score": 0.5324467420578003, "is_gold": false, "snippet": "Sweatshops are unfortunate, but free trade can benefit from cheap labor without relying on exploiting workers. Economically, cheap labor is a step in the right direction for poor countries and their people. Making 60 cents an hour in a factory that exports goo"}, {"rank": 6, "docid": "training-international-seighweo-con03b", "score": 0.5285696387290955, "is_gold": false, "snippet": "It must be remembered that the offshore manufacturing and service sectors are relatively young. Workers have not yet had the opportunity to develop coherent collective bargaining strategies. It takes time for those involved in an industry to learn how to act a"}, {"rank": 7, "docid": "test-economy-epehwmrbals-con01b", "score": 0.5224511623382568, "is_gold": true, "snippet": "Achieving development at the cost of principles of development is not acceptable. The means by which you achieve development is equally important, and will remain integral in the principles and priorities of a nation once it achieves developed status. The road"}, {"rank": 8, "docid": "test-economy-epehwmrbals-con04b", "score": 0.5181688070297241, "is_gold": false, "snippet": "It is irrelevant that some western countries do not always meet the highest labour standards; does it matter that Germany does not have a national minimum wage when there are minimum wages for each sector? These are countries where one labour standard can be s"}, {"rank": 9, "docid": "training-international-seighweo-pro02b", "score": 0.5174202919006348, "is_gold": false, "snippet": "The educational policies of developing states should not be tailored to the needs of businesses in the developing world. Arguably, cross border trade in commodities and products is as important for nations in the developing world as partnerships with wealthy c"}, {"rank": 10, "docid": "training-international-seighweo-pro03b", "score": 0.5147393941879272, "is_gold": false, "snippet": "Side proposition’s description of the economic processes underlying off shore outsourcing is overly optimistic, and makes claims about educational and industrial development in the first world that are highly contestable.  By shifting production and support se"}], "topK_baseline": [{"rank": 1, "docid": "test-economy-epehwmrbals-con01a", "score": 1.0, "is_gold": false, "snippet": "Universal standards of labour and business are not suited to the race for development  Developing countries are in a race to develop their economies. The prioritisation of countries that are not currently developed is different to the priorities of developed c"}, {"rank": 2, "docid": "test-economy-epehwmrbals-pro02b", "score": 0.8757240772247314, "is_gold": false, "snippet": "Developing nations are plagued with corruption as well as desperate economic situations and are often in competition with each other in exporting whether that is manufacturing for slightly richer countries of South East Asia or natural resources in Africa.  In"}, {"rank": 3, "docid": "test-economy-epehwmrbals-pro05a", "score": 0.8599634170532227, "is_gold": false, "snippet": "When developing countries employ poor labour standards, other countries follow the example in order to be competitive  As long as developing nations constantly keep employing poor labour standards, it will keep putting a strain on the global economy. This is b"}, {"rank": 4, "docid": "test-economy-epehwmrbals-con03a", "score": 0.8344577550888062, "is_gold": false, "snippet": "Development has many facets of which pure economic growth is a priority, especially in the context of a developing nation  It is a nation’s own sovereign decision to decide its own standards and pace itself. It is a sovereign right of self-determination of a n"}, {"rank": 5, "docid": "test-economy-epehwmrbals-con02a", "score": 0.8244077563285828, "is_gold": false, "snippet": "There is nothing wrong with individualised standards. It is the question on implementing them better and not raising standards  The chances that these international labour standards are even relevant to these developing nations are low. For example, India need"}, {"rank": 6, "docid": "test-economy-epehwmrbals-con04b", "score": 0.8054852485656738, "is_gold": false, "snippet": "It is irrelevant that some western countries do not always meet the highest labour standards; does it matter that Germany does not have a national minimum wage when there are minimum wages for each sector? These are countries where one labour standard can be s"}, {"rank": 7, "docid": "test-economy-epehwmrbals-pro02a", "score": 0.8051369786262512, "is_gold": false, "snippet": "International labour and business standards go hand in hand with development standards and will de facto increase implementation levels  What are international labour and business standards? They are globally acceptable methods of doing business and employing "}, {"rank": 8, "docid": "test-economy-epehwmrbals-pro03a", "score": 0.7978270053863525, "is_gold": false, "snippet": "Increasing a standard, even if not as high as the donor would want, increases the standard of the present situation  Increasing the required standard of business and labour will result in increases to the current standard labour and business standards even bef"}, {"rank": 9, "docid": "test-economy-epehwmrbals-con04a", "score": 0.7863263487815857, "is_gold": false, "snippet": "There is uneven implementation of labour standards even in western countries  Western countries often do embrace high levels of labour standards or do not follow their labour regulations. Germany for example has no minimum wage [1] while the USA has no legal o"}, {"rank": 10, "docid": "training-economy-feghbgft-con03a", "score": 0.7820957899093628, "is_gold": false, "snippet": "It is just to protect industry and jobs.  When countries dump their products in other markets without barriers, they undercut the ability for local industries to compete. If those local industries try to compete, large foreign or multinational companies can us"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-free-speech-debate-ldhwbmclg-con01a", "query": "Violent imagery can serve different purposes.  Calls for a ban on music that references or glorifies violence are frequently based on an overly simplistic understanding of contemporary and popular musical genres. It is instructive that the loudest voices of protest raised against violent content in hip hop and rock music are, overwhelmingly, white, middle class, middle-aged newspaper columnists. Any ban created under these circumstances would reduce the diversity and depth of popular musical genres, by preventing musicians from commenting- in any way- on violent events.  Banning particular musical tracks due only to the fact that they discuss violent acts would be damaging to the creative industries and would not reflect methods currently used to classify and restrict content appearing in other media. Criminal acts are punished when an act results in a damaging outcome and because that act is performed with a particular dishonest or malicious intention. Generally, someone cannot be found guilty of murder if they did not intend to kill their victim. Similarly, it is unusual for films or videogames to be censored or banned because they happen to depict violent acts. The intention that underlies the use of graphic images or words must also be examined. As BBC director general Mark Thompson noted when discussing the controversial religious content of Jerry Springer: The Opera with freespeechdebate.com  “… Jerry Springer I saw without feeling that it was offensive to me because the intention of the piece was so clearly a satire about an American talk show host and his world rather than the religious figures as such.”  Classification boards will look at the context in which an offensive act is shown. The violence of war is portrayed vividly in Saving Private Ryan, but the film has not been banned on this basis. Private Ryan portrays violence and suffering in order to remind us of the inhumanity that pervaded the Second World War. It uses violence to make a didactic point, to move its audience to sympathy and disgust. If a film were to use images of extreme violence or suffering as a form of entertainment, inviting the audience to take pleasure in brutality, a classification board would try to restrict or censor its content.  Comparably, “violent” music can use brutal language and themes to make moving and engaging observations about the world. Violent music does not automatically glorify violence, nor does it cause its audience to see violence as something that is glamorous.  Listened to out of context, without any attempt to critically analyse the imagery of the song and the intentions of the artists, it is easy to condemn many acclaimed examples of popular music as containing violent lyrics. By giving into the populist pressure that is represented and generated by newspaper columnists and talk show hosts, we risk creating a chilling effect, not only on mainstream hip hop culture, but on any other musical form that dares to discuss themes that fall outside narrowly and arbitrarily defined limits of social acceptability.", "gold_docid": "test-free-speech-debate-ldhwbmclg-con01b", "rank_T": 9, "rank_baseline": 26, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "training-culture-amcghbmgvaw-con01b", "score": 0.6105017066001892, "is_gold": false, "snippet": "None of these arguments pose a significant problem. While setting criteria may be difficult and there will always be cases where it is a matter of interpretation this is not a reason not to create a strict and detailed set of criteria. There could be an appeal"}, {"rank": 2, "docid": "test-free-speech-debate-ldhwbmclg-con01a", "score": 0.5775834321975708, "is_gold": false, "snippet": "Violent imagery can serve different purposes.  Calls for a ban on music that references or glorifies violence are frequently based on an overly simplistic understanding of contemporary and popular musical genres. It is instructive that the loudest voices of pr"}, {"rank": 3, "docid": "test-free-speech-debate-ldhwbmclg-pro02b", "score": 0.5712107419967651, "is_gold": false, "snippet": "It is usually the task of movie classification organisations such as the MPAA and the British Board of Film Certification to judge whether the content of a film should be cut or altered. In most cases these groups will be politically independent, but may be po"}, {"rank": 4, "docid": "training-culture-amcghbmgvaw-con03b", "score": 0.5649612545967102, "is_gold": false, "snippet": "However, while freedom of expression is definitely an important concept to consider, such freedoms can only go so far. When it comes to language that promotes violence then freedom of expression is no longer sufficient reason not to ban something as a physical"}, {"rank": 5, "docid": "test-society-mmcpsgfhbf-pro04b", "score": 0.5559912323951721, "is_gold": false, "snippet": "We live in a society in which no judge will recognise “I saw it on the TV” as a valid excuse for a crime. We allow people to watch violent films believing they will be able to distinguish between pornography and reality. For cases such as Ted Bundy, clearly is"}, {"rank": 6, "docid": "training-culture-amcghbmgvaw-con02b", "score": 0.5552998185157776, "is_gold": false, "snippet": "To ban music that encourages violence against women would be done with the intention of protecting women; if it is necessary to paint them as the victims of violence that they are, that is a small price to pay. Furthermore, bans on child pornography would not "}, {"rank": 7, "docid": "training-culture-amcghbmgvaw-pro02b", "score": 0.5525700449943542, "is_gold": false, "snippet": "Violence towards women is a common and world-wide phenomenon, occurring on every continent and throughout history. Therefore it seems crazy to suggest that levels of domestic violence are related to this small sub-culture of music that depicts violence towards"}, {"rank": 8, "docid": "training-culture-amcghbmgvaw-con04b", "score": 0.5344128608703613, "is_gold": false, "snippet": "No 'slippery slope' situation exists. It would be clear that the ban only applies to music that glorifies violence. This is not a justification that could be infinitely expanded to cover more and more music and art. It could not be considered a precedent to ba"}, {"rank": 9, "docid": "test-free-speech-debate-ldhwbmclg-con01b", "score": 0.530971884727478, "is_gold": true, "snippet": "Hip hop is a diverse genre. The quote that opened this discussion is taken from a song by the English surrealist rapper Scroobius Pip. His albums cover themes entirely different from those found in “gangsta” rap. Similarly, artists such as MIA, Optimus Rhyme a"}, {"rank": 10, "docid": "test-free-speech-debate-ldhwbmclg-con02b", "score": 0.52614825963974, "is_gold": false, "snippet": "Modern policy making does not rely on the force of law to bring about social change. This is an archaic approach to addressing the harms and deficiencies that might appear in communities.  We can reasonably assume that any ban on violent lyrics will be linked "}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-ldhwbmclg-con01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Violent imagery can serve different purposes.  Calls for a ban on music that references or glorifies violence are frequently based on an overly simplistic understanding of contemporary and popular musical genres. It is instructive that the loudest voices of pr"}, {"rank": 2, "docid": "training-culture-amcghbmgvaw-con01a", "score": 0.8513461947441101, "is_gold": false, "snippet": "It would be highly impractical to ban this music glorifying violence.  There are many reasons it would be impractical to ban certain types of music: First, who would choose what music counts as inappropriate and on what criteria? This would include concerns su"}, {"rank": 3, "docid": "training-culture-amcghbmgvaw-con04a", "score": 0.8422881364822388, "is_gold": false, "snippet": "The 'Slippery-Slope' Argument  Banning music that glorifies violence is at risk of the 'slippery-slope' of censorship, which occurs on two levels. Firstly that while music depicting violence towards women may be banned for the best intentions, this censorship "}, {"rank": 4, "docid": "training-culture-amcghbmgvaw-con02b", "score": 0.8393900394439697, "is_gold": false, "snippet": "To ban music that encourages violence against women would be done with the intention of protecting women; if it is necessary to paint them as the victims of violence that they are, that is a small price to pay. Furthermore, bans on child pornography would not "}, {"rank": 5, "docid": "training-culture-amcghbmgvaw-con03a", "score": 0.8384429216384888, "is_gold": false, "snippet": "To ban music that encourages violence against women would be done with the intention of protecting women; if it is necessary to paint them as the victims of violence that they are, that is a small price to pay. Furthermore, bans on child pornography would  Man"}, {"rank": 6, "docid": "test-free-speech-debate-ldhwbmclg-pro02b", "score": 0.8350503444671631, "is_gold": false, "snippet": "It is usually the task of movie classification organisations such as the MPAA and the British Board of Film Certification to judge whether the content of a film should be cut or altered. In most cases these groups will be politically independent, but may be po"}, {"rank": 7, "docid": "training-culture-amcghbmgvaw-con01b", "score": 0.8191636204719543, "is_gold": false, "snippet": "None of these arguments pose a significant problem. While setting criteria may be difficult and there will always be cases where it is a matter of interpretation this is not a reason not to create a strict and detailed set of criteria. There could be an appeal"}, {"rank": 8, "docid": "training-culture-amcghbmgvaw-con04b", "score": 0.8111726641654968, "is_gold": false, "snippet": "No 'slippery slope' situation exists. It would be clear that the ban only applies to music that glorifies violence. This is not a justification that could be infinitely expanded to cover more and more music and art. It could not be considered a precedent to ba"}, {"rank": 9, "docid": "training-culture-amcghbmgvaw-pro04b", "score": 0.8039935827255249, "is_gold": false, "snippet": "The music is not the reason for the lack of respect for women; rather it is a much broader problem that cannot be prevented simply by targeting music. Within the part of that culture that is music the problem is not that music depicting violence toward women p"}, {"rank": 10, "docid": "test-free-speech-debate-ldhwbmclg-pro01a", "score": 0.8033379316329956, "is_gold": false, "snippet": "Classification, not censorship  We should expect fans of an art form that is subjected to public criticism and vilification to leap to its defence. Some of these aficionados- whether the medium in question is cinema, fine art or pop music- make the case for th"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-education-xeegshwfeu-pro03a", "query": "Increasing parents' freedom of choice  Different parents have different values and priorities, and it is entirely legitimate for them to wish to pass these on to their children. The state does not know any better than them with which values the ideal life can be lived.  Further, children are individuals who respond in very different ways to different styles of teaching. Parents know their children better than central government possibly could, and so are the best placed to decide what sort of school their child should go to. Currently, there is very little state provision for non-mainstream styles of learning, whereas in the private sector there is a big incentive for educational innovation.", "gold_docid": "test-education-xeegshwfeu-pro03b", "rank_T": 9, "rank_baseline": 26, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "validation-education-eggrhwbfs-con01b", "score": 0.6133580803871155, "is_gold": false, "snippet": "This is not the government’s responsibility. The government does not have a responsibility to educate a child within the exact parameters that their parents dictate. If this were true, then each individual set of parents would be allowed to pick and choose wha"}, {"rank": 2, "docid": "test-education-xeegshwfeu-con03b", "score": 0.600161075592041, "is_gold": false, "snippet": "Most government goals that are pushed forwards in schools are also valued by the parents: consequently, even under a free market they would be taught in schools. Further, if the majority of parents do not want such things taught in schools, then they should no"}, {"rank": 3, "docid": "test-education-xeegshwfeu-pro03a", "score": 0.5875555276870728, "is_gold": false, "snippet": "Increasing parents' freedom of choice  Different parents have different values and priorities, and it is entirely legitimate for them to wish to pass these on to their children. The state does not know any better than them with which values the ideal life can "}, {"rank": 4, "docid": "test-education-xeegshwfeu-con01b", "score": 0.5674859285354614, "is_gold": false, "snippet": "It is currently the case that some children, with unfortunate home circumstances, don’t get optimal educational provision as a result of their parents’ failure. However, there are many parents who are able to make good decisions on behalf of their children, an"}, {"rank": 5, "docid": "training-economy-epeeghbpw-con02b", "score": 0.5563541650772095, "is_gold": false, "snippet": "If families have incentives to send their children to school, and raise their children with a value of education, stressing the need for them to go to school they are more likely to finish high school and lift themselves out of these environments. The reason w"}, {"rank": 6, "docid": "training-health-hgwsytpsctpf-pro02b", "score": 0.5535840392112732, "is_gold": false, "snippet": "If a parent gives into pressure from a young child so easily, even when she knows it’s the wrong thing to do, then she has bigger parenting problems to worry about than the presence of toys in fast food meals. The government cannot possibly step in to eliminat"}, {"rank": 7, "docid": "test-health-hgwhwbjfs-pro02b", "score": 0.5471236705780029, "is_gold": false, "snippet": "Given all the responsibilities our society has transferred from parents onto schools and educators in the 21st century, is it really sensible to include caring for nutritional choices to this already bloated and unmanageable list?  We need to ask ourselves, is"}, {"rank": 8, "docid": "training-philosophy-lsgsgfhbpsb-pro03b", "score": 0.546560525894165, "is_gold": false, "snippet": "Freedom of choice is an important principle generally, but it should not be granted at the expense of unconditional love for one’s children. The pre-selection of gender ‘is a threat to the core value of parenthood that is usually expressed by the commitment to"}, {"rank": 9, "docid": "test-education-xeegshwfeu-pro03b", "score": 0.5388128161430359, "is_gold": true, "snippet": "Variety within the education system is not always a good thing. National curricula exist to facilitate transfer between schools and comparisons of different pupils and schools, as well as enforcing basic standards.  Thus, not only might variety lead to some su"}, {"rank": 10, "docid": "training-politics-vhwlva1-con01b", "score": 0.5269380211830139, "is_gold": false, "snippet": "This is an odd idea; should parents not be voting for themselves not their children? If they are voting for their children rather than themselves are they not themselves disenfranchised? The fact is that children and their parents have different interests on a"}], "topK_baseline": [{"rank": 1, "docid": "test-education-xeegshwfeu-pro03a", "score": 0.9999998807907104, "is_gold": false, "snippet": "Increasing parents' freedom of choice  Different parents have different values and priorities, and it is entirely legitimate for them to wish to pass these on to their children. The state does not know any better than them with which values the ideal life can "}, {"rank": 2, "docid": "validation-education-eggrhwbfs-con01b", "score": 0.8237107396125793, "is_gold": false, "snippet": "This is not the government’s responsibility. The government does not have a responsibility to educate a child within the exact parameters that their parents dictate. If this were true, then each individual set of parents would be allowed to pick and choose wha"}, {"rank": 3, "docid": "validation-education-eggrhwbfs-con01a", "score": 0.8202029466629028, "is_gold": false, "snippet": "Parents have a right to ensure their child is brought up with the values they consider important.  Parents send their children to school so that they can be properly educated. For many parents, this education includes proper moral codes and values. Sending the"}, {"rank": 4, "docid": "test-education-xeegshwfeu-con01b", "score": 0.8163653016090393, "is_gold": false, "snippet": "It is currently the case that some children, with unfortunate home circumstances, don’t get optimal educational provision as a result of their parents’ failure. However, there are many parents who are able to make good decisions on behalf of their children, an"}, {"rank": 5, "docid": "test-education-xeegshwfeu-con03b", "score": 0.8134187459945679, "is_gold": false, "snippet": "Most government goals that are pushed forwards in schools are also valued by the parents: consequently, even under a free market they would be taught in schools. Further, if the majority of parents do not want such things taught in schools, then they should no"}, {"rank": 6, "docid": "validation-philosophy-ehbidachsb-pro03b", "score": 0.8071426749229431, "is_gold": false, "snippet": "We fully accept that children are treated differently in the eyes of the law. However, the very fact that proposition allows for that exceptionalism must require them to acknowledge that the role of the parent is given a status different from any other in soci"}, {"rank": 7, "docid": "training-education-shbpshrpe-pro01a", "score": 0.8037185668945312, "is_gold": false, "snippet": "People should have free choice about how they spend their money  People should be allowed to spend their money as they wish. If parents choose to spend money on their children’s advancement over something else they could buy then it is there decision to make. "}, {"rank": 8, "docid": "training-education-uhwecpuu-con01b", "score": 0.8012269139289856, "is_gold": false, "snippet": "Allowing market forces to control educational opportunity is as legitimate at university level as it is at school level. Parents wanting the best for their children should be allowed to spend the resources that they have accumulated in any way that they like, "}, {"rank": 9, "docid": "validation-education-shwmsems-pro03b", "score": 0.8001067638397217, "is_gold": false, "snippet": "Parents know their children better than anyone. They know what s/he is like, and in what environment s/he will grow up and often live. The state is not infallible and its decisions are not purely objective. When children are not adequately mature for sex educa"}, {"rank": 10, "docid": "training-health-hgwsytpsctpf-pro02b", "score": 0.7993087768554688, "is_gold": false, "snippet": "If a parent gives into pressure from a young child so easily, even when she knows it’s the wrong thing to do, then she has bigger parenting problems to worry about than the presence of toys in fast food meals. The government cannot possibly step in to eliminat"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-tahglcphsld-pro03a", "query": "Drugs are safer when legal  Currently in the UK, purity of illegal Amphetamine is normally under 5%, and some tablets sold as ecstasy contain no MDMA at all. Instead, drugs are adulterated (“cut”) with substances from chalk and talcum powder to completely different drugs. [1]  At least when drugs are legalised the state can regulate their sale to make sure that they are clean and not cut with other dangerous substances. This will minimise the risk to users.  [1] Drugscope, ‘How Pure Are Street Drugs?’, updated January 2005,", "gold_docid": "test-law-tahglcphsld-pro03b", "rank_T": 3, "rank_baseline": 18, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-law-tahglcphsld-pro03a", "score": 0.6471664905548096, "is_gold": false, "snippet": "Drugs are safer when legal  Currently in the UK, purity of illegal Amphetamine is normally under 5%, and some tablets sold as ecstasy contain no MDMA at all. Instead, drugs are adulterated (“cut”) with substances from chalk and talcum powder to completely diff"}, {"rank": 2, "docid": "test-law-thgglcplgphw-con02b", "score": 0.5497496128082275, "is_gold": false, "snippet": "With no other narcotic drug are the components parts of that drug banned in of themselves. For example, the raw component parts of crystal meth are not banned. These components are a variety of household cleaning compounds. [1] It is wrong therefore to suggest"}, {"rank": 3, "docid": "test-law-tahglcphsld-pro03b", "score": 0.5467178821563721, "is_gold": true, "snippet": "Part of the reason that drugs are illegal is because of the health ramifications, which exist even if a drug is pure.  To give a brief summary of some health harms that come from unadulterated drugs:  “Cocaine can cause such long-term problems as tremors, seiz"}, {"rank": 4, "docid": "test-law-tahglcphsld-pro02b", "score": 0.5018707513809204, "is_gold": false, "snippet": "Prohibition may not be working in the UK but that does not mean that prohibition is not working everywhere. In the US, the Drug Enforcement Agency states that “Overall drug use in the United States is down by more than a third since the late 1970s. That’s 9.5 "}, {"rank": 5, "docid": "test-law-tahglcphsld-con02b", "score": 0.49743252992630005, "is_gold": false, "snippet": "When drugs are illegal, this does not stop people from using them. A Canadian report on the matter concluded, \"The licit or illicit status of substances has little impact on their use.\" [1] In addition, even though drugs are illegal, it is not hard to access t"}, {"rank": 6, "docid": "training-health-ahghtrpcas-con02b", "score": 0.49598804116249084, "is_gold": false, "snippet": "Ultimately there is a clear difference between the medical use of a drug, the banning of which is both harming patients and is against the wishes of many societies and allowing a free-for-all. As a society we regulate the use of other products to ensure that t"}, {"rank": 7, "docid": "training-health-ahwba-con02b", "score": 0.48297664523124695, "is_gold": false, "snippet": "In any single law, that prohibits substances there is going to be the danger of a black market. In Canada, a black market for alcohol developed despite the legal status of alcohol (it was due to high taxation). The Association of Canadian Distillers actually e"}, {"rank": 8, "docid": "training-health-ahghtrpcas-pro02b", "score": 0.4755822420120239, "is_gold": false, "snippet": "Of course all drugs can be abused but introducing one into the system full in the knowledge that it will be abused is an entirely different matter. On the basis of the balance of probabilities, the moment any government says that cannabis is safe to use and, m"}, {"rank": 9, "docid": "training-health-ahgshbcsbl-pro03b", "score": 0.47482460737228394, "is_gold": false, "snippet": "Legalizing cannabis would not stop the criminals who currently sell it from continuing to commit crimes. They could simply diversify their activities. Many of them would already be dealing other drugs or involved in other criminal activities. The legalization "}, {"rank": 10, "docid": "test-law-tahglcphsld-pro06b", "score": 0.46700558066368103, "is_gold": false, "snippet": "Perhaps alcohol and tobacco should also be illegal. However, one of the reasons why alcohol ranks so badly in such studies is because of its legality; if other drugs were legal, we would see their usage go up and therefore the negative social effects they prod"}], "topK_baseline": [{"rank": 1, "docid": "test-law-tahglcphsld-pro03a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Drugs are safer when legal  Currently in the UK, purity of illegal Amphetamine is normally under 5%, and some tablets sold as ecstasy contain no MDMA at all. Instead, drugs are adulterated (“cut”) with substances from chalk and talcum powder to completely diff"}, {"rank": 2, "docid": "test-law-tahglcphsld-con01a", "score": 0.834149956703186, "is_gold": false, "snippet": "Drugs are dangerous, and the governement should discourage its use  The government has a responsibility to protect its citizens; if a substance will do people and society significant harm, then that substance should be banned. There is no such thing as a safe "}, {"rank": 3, "docid": "test-law-thgglcplgphw-con02b", "score": 0.7982834577560425, "is_gold": false, "snippet": "With no other narcotic drug are the components parts of that drug banned in of themselves. For example, the raw component parts of crystal meth are not banned. These components are a variety of household cleaning compounds. [1] It is wrong therefore to suggest"}, {"rank": 4, "docid": "test-law-tahglcphsld-pro02b", "score": 0.7631046175956726, "is_gold": false, "snippet": "Prohibition may not be working in the UK but that does not mean that prohibition is not working everywhere. In the US, the Drug Enforcement Agency states that “Overall drug use in the United States is down by more than a third since the late 1970s. That’s 9.5 "}, {"rank": 5, "docid": "test-law-tahglcphsld-con02a", "score": 0.7555733323097229, "is_gold": false, "snippet": "More people will take drugs if they are legal  Considering that drug use has so many negative consequences, it would be disastrous to have it increase. However, the free availability of drugs once they are legal will make it far easier for individuals to buy a"}, {"rank": 6, "docid": "test-law-tahglcphsld-con02b", "score": 0.7514030337333679, "is_gold": false, "snippet": "When drugs are illegal, this does not stop people from using them. A Canadian report on the matter concluded, \"The licit or illicit status of substances has little impact on their use.\" [1] In addition, even though drugs are illegal, it is not hard to access t"}, {"rank": 7, "docid": "test-law-tahglcphsld-pro02a", "score": 0.7479090690612793, "is_gold": false, "snippet": "Prohibition does not work; instead, it glamorizes drugs  Those who want to use drugs will take them whether they are legal or not – and more are doing so than ever before. In 1970 there was something like 1,000 problematic drug users in the UK, now there are o"}, {"rank": 8, "docid": "test-law-tahglcphsld-pro06a", "score": 0.7463820576667786, "is_gold": false, "snippet": "The law is hypocritical  In most countries where drugs are illegal, tobacco and alcohol, which arguably have equally devastating consequences in society, are legal. In a UK study, alcohol was shown to have the worst effects of any drug, yet the current law rec"}, {"rank": 9, "docid": "test-law-tahglcphsld-pro05b", "score": 0.7450779676437378, "is_gold": false, "snippet": "Whether legal or illegal, drugs will still be a source of income for warlords and terrorist groups. Instead of starving them off, the dealers become more competitive and lower their prices. The only way to stop these people using drugs as a source of income is"}, {"rank": 10, "docid": "test-law-tahglcphsld-con03a", "score": 0.7446389198303223, "is_gold": false, "snippet": "Drugs will either be too cheap or too expensive  Low prices for drugs will hugely increase consumption of drugs, amongst all groups - addicts, previously casual users, and those who were not previously users. If drug provision is strictly regulated, an illegal"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-digital-freedoms-aihbiahr-con02a", "query": "Internet access is a commodity not a human right.  If a human right is inherent and inalienable then if something is to be a human right it has to be freely available for all rather than being much more available to those who are rich. The internet however is a commodity. We are charged for access to it and can be cut off for not paying our bills. We are charged more to be able to download more, in effect to have greater access to this human right. There has never been any suggestion that the equally great media advances of TV and telephones are technologies worthy of being considered a human right. As with the internet these increased the ability to express opinions to a wide audience, they helped democratise news and making it much more international. They meant that human rights violations could be much more easily told to the world in much the same way the internet does.", "gold_docid": "test-digital-freedoms-aihbiahr-con02b", "rank_T": 9, "rank_baseline": 24, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-digital-freedoms-aihbiahr-con02a", "score": 0.8118252158164978, "is_gold": false, "snippet": "Internet access is a commodity not a human right.  If a human right is inherent and inalienable then if something is to be a human right it has to be freely available for all rather than being much more available to those who are rich. The internet however is "}, {"rank": 2, "docid": "test-digital-freedoms-aihbiahr-con04a", "score": 0.7153079509735107, "is_gold": false, "snippet": "Internet access cannot be a human right when it is not available to all.  If human rights are inalienable and inherent in humans then no technology can be a human right as not everyone can ever expect access all of the time. Certainly at the moment huge swathe"}, {"rank": 3, "docid": "training-digital-freedoms-dfaihbssp-pro01b", "score": 0.6249490976333618, "is_gold": false, "snippet": "Internet access is not a fundamental right. It is a useful enabler of rights. But that is not reason to guarantee it to all, any more than states owed every citizen access to a printing press a few centuries ago. Even were it a right, internet access could be "}, {"rank": 4, "docid": "training-digital-freedoms-gtdfais-pro01b", "score": 0.6108362674713135, "is_gold": false, "snippet": "In July 2012, The United Nations Human Rights Council endorsed a resolution upholding the principle of freedom of expression and information on the internet. In a special report, it also “called upon all states to ensure that Internet access is maintained at a"}, {"rank": 5, "docid": "test-digital-freedoms-aihbiahr-pro02b", "score": 0.5969287753105164, "is_gold": false, "snippet": "The freedom of speech does not mean that there is a right to reach as broad an audience as possible. It does not mean there is a fundamental right to access the internet or any other individual medium of communication. If indeed there is some kind of ‘gap’ in "}, {"rank": 6, "docid": "test-digital-freedoms-aihbiahr-pro03b", "score": 0.5902739763259888, "is_gold": false, "snippet": "This is taking the freedom of expression too far. A freedom to impart information does not mean the freedom to impart it through whatever medium the individual wishes simply through a method of communication. It is also taking it too far to consider that the g"}, {"rank": 7, "docid": "test-digital-freedoms-aihbiahr-con04b", "score": 0.549015998840332, "is_gold": false, "snippet": "Human rights are as much aspirational as they are fact. When the universal declaration of human rights came out the majority of people in the world did not have “the right to take part in the government of his country, directly or through freely chosen represe"}, {"rank": 8, "docid": "training-international-glhrilpws-con02b", "score": 0.5463791489601135, "is_gold": false, "snippet": "Although there are some subjective elements of rights, there is generally a consensus amongst most people that fundamental human rights, such as being alive, are universally good. Although we should not impede sovereignty for subjective things, genocide, ethni"}, {"rank": 9, "docid": "test-digital-freedoms-aihbiahr-con02b", "score": 0.5406104326248169, "is_gold": true, "snippet": "Being a human right does not prevent commoditization going alongside this. Everyone has a right to own property, as enshrined in the universal declaration of human rights, but it is accepted that property is also valuable in a commercial sense. Or more general"}, {"rank": 10, "docid": "training-digital-freedoms-fehwiwcb-pro02b", "score": 0.5386322140693665, "is_gold": false, "snippet": "Western states, like all states, owe their primary responsibility to their own citizens, not those in a distant land claiming to be striving for common notions of rights. It is difficult for Western states to ascertain the actual motivations of the body of ris"}], "topK_baseline": [{"rank": 1, "docid": "test-digital-freedoms-aihbiahr-con02a", "score": 1.000000238418579, "is_gold": false, "snippet": "Internet access is a commodity not a human right.  If a human right is inherent and inalienable then if something is to be a human right it has to be freely available for all rather than being much more available to those who are rich. The internet however is "}, {"rank": 2, "docid": "test-digital-freedoms-aihbiahr-con04a", "score": 0.9038620591163635, "is_gold": false, "snippet": "Internet access cannot be a human right when it is not available to all.  If human rights are inalienable and inherent in humans then no technology can be a human right as not everyone can ever expect access all of the time. Certainly at the moment huge swathe"}, {"rank": 3, "docid": "test-digital-freedoms-aihbiahr-pro02b", "score": 0.8594002723693848, "is_gold": false, "snippet": "The freedom of speech does not mean that there is a right to reach as broad an audience as possible. It does not mean there is a fundamental right to access the internet or any other individual medium of communication. If indeed there is some kind of ‘gap’ in "}, {"rank": 4, "docid": "training-digital-freedoms-dfaihbssp-pro01b", "score": 0.8572564125061035, "is_gold": false, "snippet": "Internet access is not a fundamental right. It is a useful enabler of rights. But that is not reason to guarantee it to all, any more than states owed every citizen access to a printing press a few centuries ago. Even were it a right, internet access could be "}, {"rank": 5, "docid": "training-digital-freedoms-gtdfais-pro01b", "score": 0.8472925424575806, "is_gold": false, "snippet": "In July 2012, The United Nations Human Rights Council endorsed a resolution upholding the principle of freedom of expression and information on the internet. In a special report, it also “called upon all states to ensure that Internet access is maintained at a"}, {"rank": 6, "docid": "test-digital-freedoms-aihbiahr-con03a", "score": 0.8389447331428528, "is_gold": false, "snippet": "Internet access is an enabler of rights not a right in itself.  The internet is an enabler and so has little value on its own. [1] No one would consider the internet a human right if there was no content or information on the internet, what good would be a rig"}, {"rank": 7, "docid": "test-digital-freedoms-aihbiahr-con04b", "score": 0.8352881669998169, "is_gold": false, "snippet": "Human rights are as much aspirational as they are fact. When the universal declaration of human rights came out the majority of people in the world did not have “the right to take part in the government of his country, directly or through freely chosen represe"}, {"rank": 8, "docid": "test-digital-freedoms-aihbiahr-pro01b", "score": 0.8344245553016663, "is_gold": false, "snippet": "Creating a human right specifically for internet access is an example of ‘human rights inflation’ where by every group wants their issue to be a human right and as a result human rights that are not necessary or are too specific begin to devalue the whole conc"}, {"rank": 9, "docid": "test-digital-freedoms-aihbiahr-con03b", "score": 0.8307175040245056, "is_gold": false, "snippet": "The conduit to access information is just as important as the information itself. There is little point in the information if we are cut off from the flows of that information and are unable to access it. [1] Having immense libraries may be an alternative meth"}, {"rank": 10, "docid": "test-digital-freedoms-aihbiahr-pro02a", "score": 0.8304769992828369, "is_gold": false, "snippet": "The right to internet access fills a gap in traditional human rights.  In our traditional human rights there is a hole when it comes to a right to receive and be able to seek out information. Almost everyone would consider freedom of speech and freedom of expr"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-philosophy-elhbrd-con04a", "query": "The death of one individual has implications for others, which by definition, do not affect the suicide herself.  Even setting aside the religious concerns of many in this situation [i] , there are solid secular reasons for accepting the sanctity of life. First among them is the impact it has on the survivors. The relative who does not want a loved one to take their own life, or to die in the case of euthanasia. It is simply untrue that others are not affect by the death of the individual – someone needs to support that person emotionally and someone has to administer the injection. Because of the ties of love involved for relatives, they are, in effect, left with no choice but to agree regardless of their own views, the law should respect their position as well.  It further gives protection to doctors and others who would be involved in the procedure. Campaigners are keen to stress that doctors should be involved in the process whilst ignoring that, pretty much whenever they’re asked doctors say they have no desire to have any part of it [ii] . Indeed it would be against the Hippocratic oath which while it is no longer always taken still sums up the duties of a doctor which includes doing no harm and includes \"And I will not give a drug that is deadly to anyone if asked, nor will I suggest the way to such a counsel.\" So ruling out euthanasia. [iii] Presumably, the very case that is so keen on the voluntary principle would also observe this compelling rejection by a group critical to the plan.  [i] Joint letter to the Telegraph. The terminally ill need care and protection – not help in committing suicide. The Most Rev Rowan Williams, Archbishop of Canterbury. The Most Rev Vincent Nichols, Archbishop of Westminster. Sir Jonathan Sacks, Chief Rabbi.  [ii] Ella Pickover. Doctors Reject Assisted Suicide. The Independent. 28 June 2012 .  [iii] Sokol, Dr Daniel, ‘A guide to the Hippocratic Oath’, BBC News, 26 October 2008 ,", "gold_docid": "test-philosophy-elhbrd-con04b", "rank_T": 2, "rank_baseline": 16, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-philosophy-elhbrd-con04a", "score": 0.753676176071167, "is_gold": false, "snippet": "The death of one individual has implications for others, which by definition, do not affect the suicide herself.  Even setting aside the religious concerns of many in this situation [i] , there are solid secular reasons for accepting the sanctity of life. Firs"}, {"rank": 2, "docid": "test-philosophy-elhbrd-con04b", "score": 0.6397935748100281, "is_gold": true, "snippet": "Obviously nobody is going to compel doctors or others in the medical profession to undertake a procedure of which they do not approve. Indeed doctors are routinely required to give independent advice - so that a patient is aware of the available options - with"}, {"rank": 3, "docid": "test-health-dhpelhbass-pro03b", "score": 0.6392852663993835, "is_gold": false, "snippet": "Demanding that family take part in such a decision can be an unbearable burden: many may resent a loved one’s decision to die, and would be either emotionally scared or estranged by the prospect of being in any way involved with their death. Assisted suicide a"}, {"rank": 4, "docid": "test-law-lgplhbssbco-con03b", "score": 0.6005732417106628, "is_gold": false, "snippet": "The fact of suffering is what makes it impossible to consider suicide a legitimate choice. Someone under the duress of intense pain and/or discomfort is not going to be able to make a fully voluntary and informed choice to end their life."}, {"rank": 5, "docid": "test-law-lgplhbssbco-pro01b", "score": 0.5965575575828552, "is_gold": false, "snippet": "The question whether or not human life is \"sacred\" should not intrude on the issue of suicide legislation because no clear proof is possible one way or the other. We respect human rights because we value the liberty and autonomy of individuals; we want to be a"}, {"rank": 6, "docid": "test-health-dhpelhbass-con04b", "score": 0.5901523232460022, "is_gold": false, "snippet": "However, the idea that we should not kill is not absolute, even for those with religious beliefs — killing in war or self-defence is justified by most. We already let people die because they are allowed to refuse treatment which could save their life, and this"}, {"rank": 7, "docid": "test-health-hpehwadvoee-pro05b", "score": 0.5789832472801208, "is_gold": false, "snippet": "It is cynical to encourage people commit suicide to bring the media’s attention to an issue. If there is too little attention, the problem lies with the media and needs to be solved by changing the media. It is not the responsibility of vulnerable relatives to"}, {"rank": 8, "docid": "test-health-dhpelhbass-con03b", "score": 0.5783860683441162, "is_gold": false, "snippet": "Were the disposal of human life so much reserved as the peculiar province of the almighty, that it were an encroachment on his right for men to dispose of their own life, it would be equally criminal to act for the preservation of life as for its destruction' "}, {"rank": 9, "docid": "test-health-dhpelhbass-pro01b", "score": 0.5781995058059692, "is_gold": false, "snippet": "There is no comparison between the right to life and other rights. When you choose to remain silent, you may change your mind at a later date; when you choose to die, you have no such second chance. Arguments from pro-life groups suggest that nearly ninety-fiv"}, {"rank": 10, "docid": "test-health-hpehwadvoee-con02b", "score": 0.5729811191558838, "is_gold": false, "snippet": "Firstly, this case is about emergencies. Consent is important, but it cannot be compared to the importance of saving a life. Secondly, the person whose consent matters is the donor who is making the sacrifice. The recipient can be expected to want to live, eve"}], "topK_baseline": [{"rank": 1, "docid": "test-philosophy-elhbrd-con04a", "score": 0.9999999403953552, "is_gold": false, "snippet": "The death of one individual has implications for others, which by definition, do not affect the suicide herself.  Even setting aside the religious concerns of many in this situation [i] , there are solid secular reasons for accepting the sanctity of life. Firs"}, {"rank": 2, "docid": "test-philosophy-elhbrd-pro03a", "score": 0.8337352871894836, "is_gold": false, "snippet": "The decision to die is a deeply personal one - it is no business of the state.  Ultimately, the decision to die is a personal one, it may affect others but, clearly it has the greatest impact on the person who decides to die.  Clearly those who remain behind w"}, {"rank": 3, "docid": "test-health-hpehwadvoee-con01a", "score": 0.8099039793014526, "is_gold": false, "snippet": "Self-preservation is our primary moral duty  Many people, especially those who belong to religious groups believe that we have a duty to preserve our own lives. They would argue that suicide is never justified, even if the reasons might appear to be good. It i"}, {"rank": 4, "docid": "test-law-lgplhbssbco-pro02b", "score": 0.8098439574241638, "is_gold": false, "snippet": "This is only an objection to particular cases of suicide; it cannot be made into a general case because some suicides really do only affect the individual – those in which there is no extended family or friendship group. And that an act is, on occasion, selfis"}, {"rank": 5, "docid": "test-health-hpehwadvoee-con05a", "score": 0.8057237863540649, "is_gold": false, "snippet": "Doctors should not be asked to take the moral burden of people who want to commit suicide  It is not fair to ask doctors who have committed their lives to preserving health to act as an instrument of killing a person. The doctor will then have to live with the"}, {"rank": 6, "docid": "test-health-dhpelhbass-pro03b", "score": 0.8028579950332642, "is_gold": false, "snippet": "Demanding that family take part in such a decision can be an unbearable burden: many may resent a loved one’s decision to die, and would be either emotionally scared or estranged by the prospect of being in any way involved with their death. Assisted suicide a"}, {"rank": 7, "docid": "test-health-dhpelhbass-con01a", "score": 0.8026488423347473, "is_gold": false, "snippet": "It is vital that a doctor's role not be confused  The guiding principle of medical ethics is to do no harm: a physician must not be involved in deliberately harming their patient. Without this principle, the medical profession would lose a great deal of trust;"}, {"rank": 8, "docid": "test-law-lgplhbssbco-pro01b", "score": 0.8009918928146362, "is_gold": false, "snippet": "The question whether or not human life is \"sacred\" should not intrude on the issue of suicide legislation because no clear proof is possible one way or the other. We respect human rights because we value the liberty and autonomy of individuals; we want to be a"}, {"rank": 9, "docid": "validation-philosophy-ehbidachsb-pro01a", "score": 0.7974623441696167, "is_gold": false, "snippet": "The right to live to regret  The primary duty placed on doctors, by society and themselves, is the preservation of life. In pursuing this goal they use not only medicines and scalpels but, first and foremost, their judgement. In many countries practising medic"}, {"rank": 10, "docid": "test-health-hpehwadvoee-pro05b", "score": 0.7966967821121216, "is_gold": false, "snippet": "It is cynical to encourage people commit suicide to bring the media’s attention to an issue. If there is too little attention, the problem lies with the media and needs to be solved by changing the media. It is not the responsibility of vulnerable relatives to"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-culture-mthbah-pro05a", "query": "Advertisements tell children that they should have everything they want.  Advertising gives the impression, especially to children, that they can and should have everything they want. This makes people too interested in material things. People are becoming more selfish and obsessed with their possessions, and losing their values of patience, hard work, moderation and the importance of non-material things like family and friends. This harms their relationships and their personal development, which has serious effects for society as a whole.", "gold_docid": "test-culture-mthbah-pro05b", "rank_T": 3, "rank_baseline": 17, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-culture-mthbah-pro05a", "score": 0.7861223220825195, "is_gold": false, "snippet": "Advertisements tell children that they should have everything they want.  Advertising gives the impression, especially to children, that they can and should have everything they want. This makes people too interested in material things. People are becoming mor"}, {"rank": 2, "docid": "test-culture-mthbah-con03b", "score": 0.5758566856384277, "is_gold": false, "snippet": "Advertisers don't have the good of society in mind when they do their work - they only care about making profit. This means that they regularly advertise unhealthy or harmful things. Fast food adverts are a large part of the reason so many children are obese. "}, {"rank": 3, "docid": "test-culture-mthbah-pro05b", "score": 0.5590847730636597, "is_gold": true, "snippet": "Our society is built around the idea that companies produce things that people want, and this is what makes us prosperous. If consumers suddenly stopped wanting to buy so many products then what happens to the people whose job it is to make them? The economy w"}, {"rank": 4, "docid": "test-culture-mthbah-pro02b", "score": 0.5443388223648071, "is_gold": false, "snippet": "People are unhappy because they can't have everything, not because they are given too much choice and find it stressful. In fact, advertisements play a crucial role in ensuring that what money people have, they spend on the most appropriate product for themsel"}, {"rank": 5, "docid": "training-health-mthwhwbpd-con01b", "score": 0.541350245475769, "is_gold": false, "snippet": "It's simply not true to say that people automatically take their adverts with a pinch of salt. Research in the US suggests that 1 in five young adults trust advertising to always tell the truth and a clear majority think it does “most of the time” [1] , as thi"}, {"rank": 6, "docid": "training-health-hgwsytpsctpf-pro01b", "score": 0.5309286713600159, "is_gold": false, "snippet": "Children may have a strong preference for a certain type of meal over another, but young kids don’t buy their own food. Parents do. And if kids might not understand that fast food is bad for them, their parents should. If a child is eating too much fast food, "}, {"rank": 7, "docid": "training-philosophy-lsfhwnhc-con04b", "score": 0.5281978845596313, "is_gold": false, "snippet": "Having children can be counterproductive in achieving a desirable society. First of all, having children is by no means necessary for possessing all those valuable traits. All of them can be developed though other experiences as well. Secondly, having kids may"}, {"rank": 8, "docid": "training-law-cpshbsdcc-con02b", "score": 0.5274945497512817, "is_gold": false, "snippet": "This opposition argument two is not as clear cut as it seems. While it is true that society encourages us to value material goods, and that this encourages crime, it is also clear that this effects those from socially deprived areas much more than those from s"}, {"rank": 9, "docid": "test-culture-mthbah-pro01b", "score": 0.5227749943733215, "is_gold": false, "snippet": "Though there are a great many advertisements in everyday life, there are not so many that they can't simply be ignored. Advertisements attempt to get you to buy a product, if you're not interested, then don't buy the product. For every person who finds all the"}, {"rank": 10, "docid": "validation-science-cpecshmpj-con02b", "score": 0.5221351385116577, "is_gold": false, "snippet": "Something being a luxury does not mean it is not something everyone should have. The effect on the planet is minimal and can be reduced if we recycle any phones that we are going to throw away. It would certainly best for the planet if we did not keep buying u"}], "topK_baseline": [{"rank": 1, "docid": "test-culture-mthbah-pro05a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Advertisements tell children that they should have everything they want.  Advertising gives the impression, especially to children, that they can and should have everything they want. This makes people too interested in material things. People are becoming mor"}, {"rank": 2, "docid": "test-culture-mthbah-pro04a", "score": 0.8110756278038025, "is_gold": false, "snippet": "Advertisements try to make people feel bad about not having the product  Many adverts do more than just advertising products. Some try to make people feel inferior if they don't have the product, or if they have something which the product would change. Percep"}, {"rank": 3, "docid": "test-culture-mthbah-con03b", "score": 0.803255558013916, "is_gold": false, "snippet": "Advertisers don't have the good of society in mind when they do their work - they only care about making profit. This means that they regularly advertise unhealthy or harmful things. Fast food adverts are a large part of the reason so many children are obese. "}, {"rank": 4, "docid": "test-culture-mthbah-con02a", "score": 0.8031220436096191, "is_gold": false, "snippet": "Advertising helps us choose between different goods.  Advertising has a positive role to play in modern society, helping us choose between competing goods. Many adverts are drawing our attention to products with new features, for example more powerful computer"}, {"rank": 5, "docid": "test-culture-mthbah-pro01b", "score": 0.7978833913803101, "is_gold": false, "snippet": "Though there are a great many advertisements in everyday life, there are not so many that they can't simply be ignored. Advertisements attempt to get you to buy a product, if you're not interested, then don't buy the product. For every person who finds all the"}, {"rank": 6, "docid": "test-culture-mthbah-pro02b", "score": 0.7814328074455261, "is_gold": false, "snippet": "People are unhappy because they can't have everything, not because they are given too much choice and find it stressful. In fact, advertisements play a crucial role in ensuring that what money people have, they spend on the most appropriate product for themsel"}, {"rank": 7, "docid": "validation-science-cpecshmpj-con02a", "score": 0.7752162218093872, "is_gold": false, "snippet": "We should not be encouraging interest in material things  Mobile phones are a part of a desire to keep up with fashion and friends. We all want the biggest and the best. Mobile phone companies know this and regularly bring out flashy new models that are immedi"}, {"rank": 8, "docid": "test-culture-mmctghwbsa-pro03a", "score": 0.7721426486968994, "is_gold": false, "snippet": "Since advertising is pervasive in mediated messages, it has the power to influence social attitudes.  Adverts occupy more public space than ever before in history. Due to technology, public space is global and ads can been seen around the world, in 2009 the UK"}, {"rank": 9, "docid": "training-health-hgwsytpsctpf-pro01a", "score": 0.7702136635780334, "is_gold": false, "snippet": "Marketing aimed at children should be subject to strict regulations.  Unlike adults, children are not able to make healthy decisions for themselves. They don’t understand what calories, sodium content, or saturated fats are. They are unable to comprehend the l"}, {"rank": 10, "docid": "test-culture-mthbah-pro02a", "score": 0.7687277793884277, "is_gold": false, "snippet": "People are given too much choice, which makes them less happy.  Advertising leads to many people being overwhelmed by the endless need to decide between competing demands on their attention – this is known as the tyranny of choice or choice overload. Recent re"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-sdfclhrppph-pro01a", "query": "The character of every act depends upon the circumstances in which it is done  \"The most stringent protection of free speech would not protect a man in falsely shouting fire in a theatre and causing a panic.\" [1] Shouting fire in a crowded cinema when there is no fire, and you know it, is wrong because doing so creates a clear and present danger of harm to others.  Likewise, in the US (and many other countries) there is no protection for ‘false commercial speech’ (i.e. misrepresentation) and the contents of adverts can be regulated in order to ensure that they are truthful and do not deceive consumers. [2] On that basis, restrictions can be placed on how tobacco products may be advertised, and people may be prevented from promoting illegal and fraudulent tax advice.  [1] U.S. Supreme Court, Schenck v. United States, 249 U.S. 47, 1919,  [2] U.S. Supreme Court, Lorillard Tobacco Co v Reilly, AG of Massachusetts, 533 U.S. 525, 200", "gold_docid": "test-law-sdfclhrppph-pro01b", "rank_T": 4, "rank_baseline": 18, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-law-sdfclhrppph-pro01a", "score": 0.7255080938339233, "is_gold": false, "snippet": "The character of every act depends upon the circumstances in which it is done  \"The most stringent protection of free speech would not protect a man in falsely shouting fire in a theatre and causing a panic.\" [1] Shouting fire in a crowded cinema when there is"}, {"rank": 2, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.5497740507125854, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 3, "docid": "training-health-adhgphwfrs-pro02b", "score": 0.5352924466133118, "is_gold": false, "snippet": "How can it be that only tobacco companies get singled out and told not to advertise their products, while many others (such as prescription drugs) are allowed to market their products? There are many products which are hugely dangerous, take alcohol for exampl"}, {"rank": 4, "docid": "test-law-sdfclhrppph-pro01b", "score": 0.5130555629730225, "is_gold": true, "snippet": "The argument leads to a slippery slope. It is one thing to regulate speech on matters that are objectively verifiable, quite another to restrict the permissible scope of opinion and expression. Even then, the state should be extremely cautious about declaring "}, {"rank": 5, "docid": "test-culture-ahrtsdlgra-con02b", "score": 0.4972502589225769, "is_gold": false, "snippet": "Freedom of speech is evidently not an absolute right: it is not something that we consider to be inviolable and able to ‘trump’ all other rights. Note, for instance, that many countries have restrictions on freedom of speech preventing hate speech and other tr"}, {"rank": 6, "docid": "validation-free-speech-debate-bphwpbsas-con04b", "score": 0.4904841482639313, "is_gold": false, "snippet": "The prevailing will of the majority can outweigh that of individuals with regard to free speech in some instances, namely when there is harm to people from the acts of individuals. Such is the case with things like hate speech, and certainly does so in the cas"}, {"rank": 7, "docid": "training-health-bhhghwapc-pro01b", "score": 0.4774535894393921, "is_gold": false, "snippet": "Advertising does not attempt to tell the truth, but to give a biased view of a product. Companies spend millions of dollars a year on advertising, and would not do so if there were no return on this investment. While purchasing a particular brand of cola on th"}, {"rank": 8, "docid": "test-science-ciidfaihwc-con01b", "score": 0.47543734312057495, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 9, "docid": "training-law-aullgsmhwchs-pro01b", "score": 0.4681292474269867, "is_gold": false, "snippet": "The government’s primary duty is to protect the constitutional rights of its citizens. Censoring speech is a clear attack on the right to free expression. Governments can use the criminal code to ensure people are protected. Acts that physically harm people or"}, {"rank": 10, "docid": "validation-politics-pgvhwlacc-con01b", "score": 0.46789267659187317, "is_gold": false, "snippet": "In the context of sponsoring a campaign figure, there should be no differentiation between corporations and individuals. The incentives to fund a candidate and the political outcomes that result from corporatist and individual contributions are the same, there"}], "topK_baseline": [{"rank": 1, "docid": "test-law-sdfclhrppph-pro01a", "score": 1.0, "is_gold": false, "snippet": "The character of every act depends upon the circumstances in which it is done  \"The most stringent protection of free speech would not protect a man in falsely shouting fire in a theatre and causing a panic.\" [1] Shouting fire in a crowded cinema when there is"}, {"rank": 2, "docid": "training-law-aullgsmhwchs-pro01b", "score": 0.8085516691207886, "is_gold": false, "snippet": "The government’s primary duty is to protect the constitutional rights of its citizens. Censoring speech is a clear attack on the right to free expression. Governments can use the criminal code to ensure people are protected. Acts that physically harm people or"}, {"rank": 3, "docid": "test-science-ciidfaihwc-con01b", "score": 0.8078341484069824, "is_gold": false, "snippet": "We already frown upon certain forms of speech [1] as we recognise that it is important to protect groups form prejudice and hatred. Allowing the expression of hatred does not automatically mean that ordinary people will denounce it as evil; rather, it normalis"}, {"rank": 4, "docid": "training-digital-freedoms-gthwpffha-con01b", "score": 0.798037052154541, "is_gold": false, "snippet": "Privacy is a right but it is not sacrosanct, and certainly should not be for people who serve the public. Freedom of speech is considered sacred in a free society, but anyone reasonable would agree that shouting “Fire!” in a crowded theatre is not given such p"}, {"rank": 5, "docid": "test-law-sdfclhrppph-pro04b", "score": 0.7973565459251404, "is_gold": false, "snippet": "Society is self-regulating. The link between speech acts and physical acts is a false one - people who commit hate crimes are likely to have read hate speech, people who commit sex crimes are likely to have watched pornography but not necessarily the other way"}, {"rank": 6, "docid": "training-free-speech-debate-esdbphwlfsr-con01b", "score": 0.7960814833641052, "is_gold": false, "snippet": "The value placed upon the right to free expression reflects its ability to enable the articulation of new, compelling and beneficial ideas, alongside damaging forms of speech. In liberal democratic societies, the potential inherent in free speech has always pr"}, {"rank": 7, "docid": "training-free-speech-debate-esdbphwlfsr-con01a", "score": 0.7952982783317566, "is_gold": false, "snippet": "Uses of free speech motivated by personal gain should still be protected.  The primary objection of the supporters of the Bipartisan Campaign Reform Act to the decision taken in the Citizens United case seems to be that the objective of some corporations is us"}, {"rank": 8, "docid": "training-free-speech-debate-nshbbhnpsb-pro03b", "score": 0.7913157939910889, "is_gold": false, "snippet": "The right to free speech is not a license to express any opinion regardless of the context. It’s equivalent of standing in a Museum and shouting, “Fire”. It is in these environments that caution is required.  Allowing free speech is one thing, allowing speech "}, {"rank": 9, "docid": "validation-politics-pgvhwlacc-con01b", "score": 0.7885960340499878, "is_gold": false, "snippet": "In the context of sponsoring a campaign figure, there should be no differentiation between corporations and individuals. The incentives to fund a candidate and the political outcomes that result from corporatist and individual contributions are the same, there"}, {"rank": 10, "docid": "validation-free-speech-debate-bphwpbsas-pro02a", "score": 0.7871177196502686, "is_gold": false, "snippet": "The First Amendment to the Constitution, which protects freedom of speech and expression, does not extend to particularly inflammatory types of speech and expression, which includes flag burning  Freedom of speech and expression is an important right, which is"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-aghbfcpspr-pro05a", "query": "Reparations demonstrate a true concern for the developing world.  Even alongside the colonial justifications for providing reparations, there are also many other strong reasons why former colonial powers should grant reparations. Former colonial powers tend to be economically developed, like America, Britain and France. The developed world should recognise the dire poverty and social challenges fed by the developing world today. Giving aid as an act of charity can sometimes be seen as derogatory [1] , and is even rejected by the potential recipients [2] [3] [4] . However, reparations allows a transfer of wealth between these countries in a way which is sensitive to the history between them, and which also demonstrates a desire to improve their relationship. It allows aid to be given to the developing world in a means which is dignified but not spurious.  [1] Accessed from  on 12/09/11  [2] Accessed from  on 12/09/11  [3] Accessed from  on 12/09/11  [4] Accessed from  on 12/09/11", "gold_docid": "test-international-aghbfcpspr-pro05b", "rank_T": 3, "rank_baseline": 17, "overlap@K": 0.8, "topK_T": [{"rank": 1, "docid": "test-international-aghbfcpspr-pro02b", "score": 0.713943600654602, "is_gold": false, "snippet": "This proposition line does not lead to a situation where developing countries forgive their colonisers and forget the suffering of the past; rather, it will lead to a situation where they identify those colonial forces as the source of their suffering, but als"}, {"rank": 2, "docid": "test-international-aghbfcpspr-pro05a", "score": 0.6917738914489746, "is_gold": false, "snippet": "Reparations demonstrate a true concern for the developing world.  Even alongside the colonial justifications for providing reparations, there are also many other strong reasons why former colonial powers should grant reparations. Former colonial powers tend to"}, {"rank": 3, "docid": "test-international-aghbfcpspr-pro05b", "score": 0.6026118993759155, "is_gold": true, "snippet": "Disguising the purely economic balance illustrated here as a demonstration of heartfelt regret undermines the principles outlined by previous proposition arguments. This is, in fact, a hollow gesture – one that is disguised as a reparation to overcome a countr"}, {"rank": 4, "docid": "training-health-ssiahrgmhwc-pro03b", "score": 0.5961373448371887, "is_gold": false, "snippet": "The international community has an obligation to help poorer countries, and cannot simply walk away from it over an issue such as this. Exploitation, through imperialism and other means, has been a major feature of Western relations with Africa. From colonial "}, {"rank": 5, "docid": "test-international-aghbfcpspr-con04b", "score": 0.5877851843833923, "is_gold": false, "snippet": "There is a fundamental difference here between colonisation and the modern day; whereas colonial powers were formerly damaging infrastructure [1] and natural resources [2] , in the modern day under reparations they would be helping to preserve such resources a"}, {"rank": 6, "docid": "test-international-aghbfcpspr-con03b", "score": 0.5801069140434265, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 7, "docid": "test-international-aghbfcpspr-con02b", "score": 0.5687403082847595, "is_gold": false, "snippet": "It is entirely possible that reparations could be paid in smaller instalments over a much longer term as Germany has done [1] , thereby providing a longer-term solution rather than one lump sum. Furthermore, it is likely that if former colonial powers offer re"}, {"rank": 8, "docid": "test-international-aghbfcpspr-con02a", "score": 0.5651793479919434, "is_gold": false, "snippet": "Such reparations would do little to actually improve the developing countries.  Reparations are an incredibly short-term economic measure. To have any substantial impact, long-term systems would need to be put in place to truly benefit such countries, and it w"}, {"rank": 9, "docid": "test-international-aghbfcpspr-con03a", "score": 0.5444223880767822, "is_gold": false, "snippet": "Reparations unfairly target the taxpayers of former colonial powers who had nothing to do with the deeds committed under colonisation.  It is unclear who exactly is being punished under this mechanism. Ordering reparations rather than, for example, a public ap"}, {"rank": 10, "docid": "test-international-aghbfcpspr-con01b", "score": 0.5368821620941162, "is_gold": false, "snippet": "Given that many former colonies remain poor (even after so many years), it is very unlikely that these people would have no need for such money. The difference in timescale is irrelevant; what is relevant is that such former colonies have a demonstrated need f"}], "topK_baseline": [{"rank": 1, "docid": "test-international-aghbfcpspr-pro05a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Reparations demonstrate a true concern for the developing world.  Even alongside the colonial justifications for providing reparations, there are also many other strong reasons why former colonial powers should grant reparations. Former colonial powers tend to"}, {"rank": 2, "docid": "test-international-aghbfcpspr-pro02b", "score": 0.8607825040817261, "is_gold": false, "snippet": "This proposition line does not lead to a situation where developing countries forgive their colonisers and forget the suffering of the past; rather, it will lead to a situation where they identify those colonial forces as the source of their suffering, but als"}, {"rank": 3, "docid": "test-international-aghbfcpspr-con04a", "score": 0.8375793099403381, "is_gold": false, "snippet": "The very payment of reparations exerts a neo-colonial power over former colonies.  The recognition that many former colonies are in desperate economic need only adds to the sense that former colonial powers desire to hold sway over them. Giving reparations ind"}, {"rank": 4, "docid": "test-international-aghbfcpspr-con04b", "score": 0.8246045112609863, "is_gold": false, "snippet": "There is a fundamental difference here between colonisation and the modern day; whereas colonial powers were formerly damaging infrastructure [1] and natural resources [2] , in the modern day under reparations they would be helping to preserve such resources a"}, {"rank": 5, "docid": "test-international-aghbfcpspr-con02a", "score": 0.8209328055381775, "is_gold": false, "snippet": "Such reparations would do little to actually improve the developing countries.  Reparations are an incredibly short-term economic measure. To have any substantial impact, long-term systems would need to be put in place to truly benefit such countries, and it w"}, {"rank": 6, "docid": "test-international-aghbfcpspr-pro04a", "score": 0.8112500309944153, "is_gold": false, "snippet": "Reparations would effectively right the economic imbalance caused by colonialism.  Given that much of the motive for colonisation was economic, many former colonies have suffered damage to their natural resources [1] or human resources, [2] which has left them"}, {"rank": 7, "docid": "training-health-ssiahrgmhwc-pro03b", "score": 0.8099539279937744, "is_gold": false, "snippet": "The international community has an obligation to help poorer countries, and cannot simply walk away from it over an issue such as this. Exploitation, through imperialism and other means, has been a major feature of Western relations with Africa. From colonial "}, {"rank": 8, "docid": "test-international-aghbfcpspr-con03b", "score": 0.7990836501121521, "is_gold": false, "snippet": "Taxpayers already fund the foreign aid which is distributed habitually [1] [2] ; they are not to blame for a famine in Somalia, for example, but they continue to pay for it [3] . There is frequently a disconnection between the people who pay for aid and the pe"}, {"rank": 9, "docid": "test-international-aghbfcpspr-con01b", "score": 0.7943108677864075, "is_gold": false, "snippet": "Given that many former colonies remain poor (even after so many years), it is very unlikely that these people would have no need for such money. The difference in timescale is irrelevant; what is relevant is that such former colonies have a demonstrated need f"}, {"rank": 10, "docid": "test-international-aghbfcpspr-con02b", "score": 0.7921187281608582, "is_gold": false, "snippet": "It is entirely possible that reparations could be paid in smaller instalments over a much longer term as Germany has done [1] , thereby providing a longer-term solution rather than one lump sum. Furthermore, it is likely that if former colonial powers offer re"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-international-epglghbni-con02a", "query": "The majority of the inhabitants of Northern Ireland do not support unification  The Good Friday agreement affirmed “That if, in the future, the people of the island of Ireland exercise their right of self-determination … to bring about a united Ireland, it will be a binding obligation on both Governments [UK and Ireland] to introduce and support in their respective Parliaments legislation to give effect to that wish”.* However as yet the Northern Irish do not wish to exercise this right. In a recent survey conducted by The Northern Ireland Life and Times it transpired that, “Overall, 73 per cent believe the long-term policy for the North should be maintaining the union, with 58 per cent supporting devolution and 15 per cent in favour of direct rule. Just 16 per cent want a united Ireland, with 3 per favoring an independent Northern Ireland.” This is not just amongst the Protestant population. The survey also showed that, “just one in three Catholics (33 per cent) wants a united Ireland, while 52 per cent want the North to stay in the UK, with 46 per cent of Catholics happy with the devolved arrangements and 6 per cent favoring a return to direct rule from Westminster.”**  *NIO, 1998,   **Moriarty, 2011,", "gold_docid": "test-international-epglghbni-con02b", "rank_T": 8, "rank_baseline": 21, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-international-epglghbni-con02a", "score": 0.6767703294754028, "is_gold": false, "snippet": "The majority of the inhabitants of Northern Ireland do not support unification  The Good Friday agreement affirmed “That if, in the future, the people of the island of Ireland exercise their right of self-determination … to bring about a united Ireland, it wil"}, {"rank": 2, "docid": "test-international-epglghbni-pro01b", "score": 0.6348536610603333, "is_gold": false, "snippet": "The Unionists in Northern Ireland who wish to remain part of the UK should have the freedom to do so. To disown Northern Ireland would be a second involuntary decision made by an outsider."}, {"rank": 3, "docid": "test-international-epglghbni-pro02b", "score": 0.584531307220459, "is_gold": false, "snippet": "An attempt at a plebiscite in 1921/22 under the specter of a war of independence and civil war would have been fraught with danger and even more open to intimidation than the House of Commons.  It would be undemocratic to relinquish Northern Ireland today, bec"}, {"rank": 4, "docid": "test-international-epglghbni-pro05b", "score": 0.5734286904335022, "is_gold": false, "snippet": "If you were to adopt a federal system, which would best please Unionists, the systems would not integrate very much anyway as Northern Irish ‘states’ would want their own state constitution and have separate judiciary to the rest of Ireland, as is the practice"}, {"rank": 5, "docid": "test-international-epglghbni-con03b", "score": 0.5562700629234314, "is_gold": false, "snippet": "There are many ways to resolve some of these issues. Firstly, regarding political resentment, a system of federalism is likely to ensure some level of political autonomy on both sides. Secondly, such a huge project is likely to attract funds from the UN, EU, t"}, {"rank": 6, "docid": "test-international-epglghbni-pro03b", "score": 0.5481986999511719, "is_gold": false, "snippet": "There is no evidence that the Catholic population today suffers a bias in the current political system, except for that which they make for themselves. As of 2010 the Catholic representation in the House of Commons is 5 Sinn Fein and 3 SDLP against 8 Democrati"}, {"rank": 7, "docid": "test-international-epglghbni-con01b", "score": 0.533562421798706, "is_gold": false, "snippet": "Economic fortunes rise and fall all the time. Many in Northern Ireland looked up enviously during the Republic’s boom. There were even clamors from Northern Irish politicians to lower the corporate tax in Northern Ireland to match the Republic’s success. So, e"}, {"rank": 8, "docid": "test-international-epglghbni-con02b", "score": 0.5188807845115662, "is_gold": true, "snippet": "It is highly probable that opinion will shift. Current statistics reflect the fact that this generation has lived through The Troubles. The next generation is likely to see a nation divided, which appears to so obviously belong together. There is no evidence t"}, {"rank": 9, "docid": "test-international-epglghbni-pro04b", "score": 0.5076172351837158, "is_gold": false, "snippet": "We are at peace now. The Good Friday Agreement has created stability, with the exception of occasional outbreaks but nothing like the horror of The Troubles. We do not need re-unification to have stability. In fact, the positive outcome that might happen is un"}, {"rank": 10, "docid": "validation-international-ahwrcim-pro03b", "score": 0.4890122413635254, "is_gold": false, "snippet": "The islanders do wish the right to self-determination but that does not have to mean they wish the return to Mauritius. Self-determination would mean a referendum in which the islands might chose to remain British, or possibly become independent. [1] It would "}], "topK_baseline": [{"rank": 1, "docid": "test-international-epglghbni-con02a", "score": 1.0, "is_gold": false, "snippet": "The majority of the inhabitants of Northern Ireland do not support unification  The Good Friday agreement affirmed “That if, in the future, the people of the island of Ireland exercise their right of self-determination … to bring about a united Ireland, it wil"}, {"rank": 2, "docid": "test-international-epglghbni-pro01b", "score": 0.8353066444396973, "is_gold": false, "snippet": "The Unionists in Northern Ireland who wish to remain part of the UK should have the freedom to do so. To disown Northern Ireland would be a second involuntary decision made by an outsider."}, {"rank": 3, "docid": "test-international-epglghbni-pro04b", "score": 0.8131962418556213, "is_gold": false, "snippet": "We are at peace now. The Good Friday Agreement has created stability, with the exception of occasional outbreaks but nothing like the horror of The Troubles. We do not need re-unification to have stability. In fact, the positive outcome that might happen is un"}, {"rank": 4, "docid": "test-international-epglghbni-pro05b", "score": 0.8106060028076172, "is_gold": false, "snippet": "If you were to adopt a federal system, which would best please Unionists, the systems would not integrate very much anyway as Northern Irish ‘states’ would want their own state constitution and have separate judiciary to the rest of Ireland, as is the practice"}, {"rank": 5, "docid": "test-international-epglghbni-pro04a", "score": 0.7996185421943665, "is_gold": false, "snippet": "Uniting Ireland would bring about an end to sectarian violence  A united Ireland doesn’t have to marginalize the Protestant population. If they are included more in the political process there can be debate, discussion and an airing of grievances which can the"}, {"rank": 6, "docid": "test-international-epglghbni-con01a", "score": 0.7995535135269165, "is_gold": false, "snippet": "Unification would be damaging for the economies of both parts of Ireland  The Republic of Ireland is currently in a crisis. It is the I in P.I.G.S, the European Union countries whose economies are bust and require a bailout package. It would not be to the bene"}, {"rank": 7, "docid": "test-international-epglghbni-con03a", "score": 0.7990626692771912, "is_gold": false, "snippet": "Unification would reignite civil disorder and violent factionalism among Irish communities  As shown above, the Northern Irish don’t want to unite with the Republic. The Irish in the Republic will also resent the new drain on their economy. Either the Republic"}, {"rank": 8, "docid": "test-international-epglghbni-pro03a", "score": 0.794291079044342, "is_gold": false, "snippet": "It would be easier to protect the rights of religious minorities within a united Ireland  Unrest in Northern Ireland was started by the appalling treatment of the Catholic minority there. When there was a Northern Ireland Parliament there was some gerrymanderi"}, {"rank": 9, "docid": "test-international-epglghbni-pro02b", "score": 0.7937102913856506, "is_gold": false, "snippet": "An attempt at a plebiscite in 1921/22 under the specter of a war of independence and civil war would have been fraught with danger and even more open to intimidation than the House of Commons.  It would be undemocratic to relinquish Northern Ireland today, bec"}, {"rank": 10, "docid": "test-international-epglghbni-pro02a", "score": 0.7916871309280396, "is_gold": false, "snippet": "The partition of Ireland was undemocratic  The people of Northern Ireland should have decided whether or not they wanted to be united with Northern Ireland, rather than it being battled out in the British Parliament and the country partitioned by the Governmen"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-rmelhrilhbiw-con03a", "query": "The Palestinians were full participants in the 1948 War against Israel  Before the discussion of the Palestinians as the innocent victims of Israeli oppression can be established, it should be noted that the Palestinian leadership were full participants in rejecting the 1948 partition plan and the war that followed. The Grand Mufti of Jerusalem rejected any form of compromise, and urged the removal of the region’s Jewish population, while massacres of Jewish settlers at Palestinian hands and the complete elimination of the Jewish presence in the areas of Palestine that the Israelis did not secure in 1948 speaks to a certain degree of popular enthusiasm. [1]  Following 1948, Israeli law provided for compensation or the return of land for any exiled Palestinians who returned to Israel proper and took an oath to the state.  This does not justify the actions of Israel in their entirety, but the tragedy of the Palestinian people is partially of their own making, and if one accepts the principles of the right of return, then the creation of Israeli settlements furthers this on the Israeli side.  Furthermore, it calls into question what, if any legal claim the Palestinians can have to any land on the basis of a UN partition plan they rejected, and on the basis of principles and practices they themselves have subverted.  [1] Dershowitz, Alan, ‘Has Israel’s Victimization of the Palestinians Been the Primary Cause of the Arab-Israeli Conflict?’, The Case for Israel, Chapter 10, 2003,", "gold_docid": "test-law-rmelhrilhbiw-con03b", "rank_T": 5, "rank_baseline": 18, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-law-rmelhrilhbiw-con03a", "score": 0.5944951772689819, "is_gold": false, "snippet": "The Palestinians were full participants in the 1948 War against Israel  Before the discussion of the Palestinians as the innocent victims of Israeli oppression can be established, it should be noted that the Palestinian leadership were full participants in rej"}, {"rank": 2, "docid": "training-international-mehrilsim-con02b", "score": 0.5740073919296265, "is_gold": false, "snippet": "The Zionist project which led to the state of Israel intended to displace Palestinians from the very beginning, long before the so-called Arab 'aggression' in 1948. Theodor Herzl, who presided the First Zionist Congress, had provided the ideological underpinni"}, {"rank": 3, "docid": "test-law-rmelhrilhbiw-con01b", "score": 0.5629229545593262, "is_gold": false, "snippet": "The Palestinians themselves did not enjoy self-rule after 1948 and the blame for the expulsions should not be placed on them but on the Jordanian authorities, and they are the ones who should be obligated to provide compensation if any is due. And the Palestin"}, {"rank": 4, "docid": "training-international-mehrilsim-pro01b", "score": 0.5342525243759155, "is_gold": false, "snippet": "The characterization of the 1948 Palestinian exodus as forced by Israel is incorrect. In the very same passage quoted opposite, Morris goes on to argue that only \"an extremely small, almost insignificant number of the refugees during this early period left bec"}, {"rank": 5, "docid": "test-law-rmelhrilhbiw-con03b", "score": 0.5087902545928955, "is_gold": true, "snippet": "It is absurd to argue that because someone is hypocritical that they lose their rights. The fact is that the Palestinians today are not guilty of the crimes of their ancestors anymore than the Israelis are.  Rather than being evaluated based on history, they s"}, {"rank": 6, "docid": "test-law-rmelhrilhbiw-con01a", "score": 0.5052167177200317, "is_gold": false, "snippet": "The Settlements are justified based on the expulsion of Jews from Arab lands after 1967  Settlement construction, and in fact the whole settlement of Jews in the West Bank has to be viewed in the wider context of the Middle East conflict as a whole.  Jews live"}, {"rank": 7, "docid": "training-international-mehrilsim-pro02b", "score": 0.48382309079170227, "is_gold": false, "snippet": "Whatever the strengths and weaknesses of the Palestinians' legal case, their foremost argument for a 'right of return' has always rested on a claim of victimhood; this claim is highly disputed (as outlined below). Without this moral culpability on the part of "}, {"rank": 8, "docid": "training-international-melhrilppd-con04b", "score": 0.4731336534023285, "is_gold": false, "snippet": "The occupation of the West Bank still continued, including the construction of settlements.  The general role of individuals in the peace negotiations is beside the point: individuals who commit atrocities should be responsible for them."}, {"rank": 9, "docid": "test-law-rmelhrilhbiw-con02b", "score": 0.46905946731567383, "is_gold": false, "snippet": "It is ironic that when the agricultural basis of the Palestinian economy is being strangled by settlement construction and the seizure of groves involved, that Palestinians should be grateful for the job opportunities provided in low-wage service positions in "}, {"rank": 10, "docid": "training-international-gmetpssbru-pro03b", "score": 0.4663638174533844, "is_gold": false, "snippet": "In law this point was settled with the creation of the state of Israel. The map of the Middle East, as with much of the rest of the world, was redrawn at the end of the second world war. The resulting nations, many of them newly created following the collapse "}], "topK_baseline": [{"rank": 1, "docid": "test-law-rmelhrilhbiw-con03a", "score": 1.0, "is_gold": false, "snippet": "The Palestinians were full participants in the 1948 War against Israel  Before the discussion of the Palestinians as the innocent victims of Israeli oppression can be established, it should be noted that the Palestinian leadership were full participants in rej"}, {"rank": 2, "docid": "training-international-gmetpssbru-pro03b", "score": 0.798866868019104, "is_gold": false, "snippet": "In law this point was settled with the creation of the state of Israel. The map of the Middle East, as with much of the rest of the world, was redrawn at the end of the second world war. The resulting nations, many of them newly created following the collapse "}, {"rank": 3, "docid": "test-law-rmelhrilhbiw-con01b", "score": 0.7976444959640503, "is_gold": false, "snippet": "The Palestinians themselves did not enjoy self-rule after 1948 and the blame for the expulsions should not be placed on them but on the Jordanian authorities, and they are the ones who should be obligated to provide compensation if any is due. And the Palestin"}, {"rank": 4, "docid": "training-international-mehrilsim-pro02b", "score": 0.7932397723197937, "is_gold": false, "snippet": "Whatever the strengths and weaknesses of the Palestinians' legal case, their foremost argument for a 'right of return' has always rested on a claim of victimhood; this claim is highly disputed (as outlined below). Without this moral culpability on the part of "}, {"rank": 5, "docid": "training-international-mehrilsim-pro01b", "score": 0.786625325679779, "is_gold": false, "snippet": "The characterization of the 1948 Palestinian exodus as forced by Israel is incorrect. In the very same passage quoted opposite, Morris goes on to argue that only \"an extremely small, almost insignificant number of the refugees during this early period left bec"}, {"rank": 6, "docid": "training-international-mehrilsim-con02a", "score": 0.7678326368331909, "is_gold": false, "snippet": "The Palestinian refugee crisis was created and is perpetuated by the Arab states and the Palestinians themselves  The current Palestinian refugee crisis is largely the creation of the Palestinian people themselves, who largely left voluntarily (or at least not"}, {"rank": 7, "docid": "training-international-gmetpssbru-pro03a", "score": 0.7666814923286438, "is_gold": false, "snippet": "The issue of Israel/Palestine has been a major one for the UN for sixty years, it is simply unfair that one of the parties represented and the other one is not  The territory claimed by both the state of Israel and the state of Palestine is contested. These ma"}, {"rank": 8, "docid": "training-international-mehrilsim-pro02a", "score": 0.7661134004592896, "is_gold": false, "snippet": "Palestinians have a right to return under international law  Article 13 of the Universal Declaration of Human Rights states that \"Everyone has the right to leave any country, including his own, and to return to his country.\" [1] This right clearly applies to t"}, {"rank": 9, "docid": "training-international-melhrilppd-con04b", "score": 0.7646750211715698, "is_gold": false, "snippet": "The occupation of the West Bank still continued, including the construction of settlements.  The general role of individuals in the peace negotiations is beside the point: individuals who commit atrocities should be responsible for them."}, {"rank": 10, "docid": "training-international-mehrilsim-con01a", "score": 0.7644617557525635, "is_gold": false, "snippet": "A Palestinian right of return would destroy the 'Jewish State' in Israel  If all or a large majority of Palestinian refugees and their descendants were to implement a 'right of return', it would make Arabs the majority within Israel and Jews an ethnic minority"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-society-tsmihwurpp-con03a", "query": "Profiling exacerbates terrorism as it reinforces the perception that Muslims and marginalised ethnic groups face prejudice.  The reality is that if a plane can be held up with a box-cutter, a broken glass bottle from duty free or flammable alcohol from the same source could be just as threatening.  However, increased use of air marshals- armed plainclothes police officers who travel secretly on certain flights- means that even these desperate tactics are likely to be ineffectual.  Institutionalising prejudice and assumption will add legitimacy and grativas to terrorist propaganda that seeks to radicalise curious or confused young people.  Not only is profiling ineffectual, it is likely to exacerbate the situation.", "gold_docid": "test-society-tsmihwurpp-con03b", "rank_T": 6, "rank_baseline": 19, "overlap@K": 0.6, "topK_T": [{"rank": 1, "docid": "test-society-tsmihwurpp-con03a", "score": 0.7843756675720215, "is_gold": false, "snippet": "Profiling exacerbates terrorism as it reinforces the perception that Muslims and marginalised ethnic groups face prejudice.  The reality is that if a plane can be held up with a box-cutter, a broken glass bottle from duty free or flammable alcohol from the sam"}, {"rank": 2, "docid": "validation-politics-tsihsspa-con02b", "score": 0.6370280385017395, "is_gold": false, "snippet": "As conservative columnist Deroy Murdock put it: “We are not arguing that the TSA should send anyone named Mohammad to be waterboarded somewhere between the first-class lounge and the Pizza Hut.” [1] There is simply no reason why security profiling necessarily "}, {"rank": 3, "docid": "test-society-tsmihwurpp-pro01a", "score": 0.6048156023025513, "is_gold": false, "snippet": "When you know terrorists are likely to be members of particular national and ethnic groups, it is simply more practical to focus searches on those groups.  The reality is that all of the major terrorist attacks against Western targets in recent years have been"}, {"rank": 4, "docid": "test-society-tsmihwurpp-pro02b", "score": 0.5941435098648071, "is_gold": false, "snippet": "It is incredibly unlikely that any randomly selected member of a particular group would be attempting to commit a crime. Racial, ethnic and identity groups are extremely large. Terrorist organisations, even al Qaeda, rarely contain more than a few hundred memb"}, {"rank": 5, "docid": "validation-politics-tsihsspa-con03b", "score": 0.5930095911026001, "is_gold": false, "snippet": "Terrorists have asserted justifications for their acts long before the idea of security profiling was even suggested. For example, Osama Bin Laden justified the 9/11 attacks on the grounds of the presence of US troops in Saudi Arabia, US support for Israel, an"}, {"rank": 6, "docid": "test-society-tsmihwurpp-con03b", "score": 0.5820811986923218, "is_gold": true, "snippet": "This opposition argument is potentially contradictory. It argues that the majority of Muslims are reasonable people and then, on the other hand, that the moment reasonable security measures are put into place there will be a massive increase in radicalised you"}, {"rank": 7, "docid": "test-society-tsmihwurpp-con01b", "score": 0.5811983942985535, "is_gold": false, "snippet": "The use of the term “racism” suggests that assumptions made by screeners are based on prejudice, not fact. Profiling, which takes far more than race into account, has a solid basis in fact. It is entirely sensible to attempt to prevent criminal acts by being p"}, {"rank": 8, "docid": "test-society-tsmihwurpp-pro01b", "score": 0.5734212398529053, "is_gold": false, "snippet": "The presumption of innocence is a principle worth defending and an important part of this is rejecting policing strategies that assume certain groups are more likely to be engage in criminal activity than others. In the last ten years, a few dozen people, at m"}, {"rank": 9, "docid": "training-free-speech-debate-ifdffehw-pro03b", "score": 0.5715228319168091, "is_gold": false, "snippet": "The proposition is assuming that we know what effect visiting extremist websites will have, we don’t. For some regularly visiting websites that promote violence may end up sickening them and encouraging them to re-evaluate their views rather than further radic"}, {"rank": 10, "docid": "validation-politics-tsihsspa-con01b", "score": 0.5644195675849915, "is_gold": false, "snippet": "More screening of travellers who display suspicious behaviour does not mean no or insufficient security surrounding travellers who do not. Security profiling would simply me a part of the security operation. What it does mean is individuals who buy one-way tic"}], "topK_baseline": [{"rank": 1, "docid": "test-society-tsmihwurpp-con03a", "score": 1.0, "is_gold": false, "snippet": "Profiling exacerbates terrorism as it reinforces the perception that Muslims and marginalised ethnic groups face prejudice.  The reality is that if a plane can be held up with a box-cutter, a broken glass bottle from duty free or flammable alcohol from the sam"}, {"rank": 2, "docid": "test-society-tsmihwurpp-con01b", "score": 0.8296715021133423, "is_gold": false, "snippet": "The use of the term “racism” suggests that assumptions made by screeners are based on prejudice, not fact. Profiling, which takes far more than race into account, has a solid basis in fact. It is entirely sensible to attempt to prevent criminal acts by being p"}, {"rank": 3, "docid": "validation-politics-tsihsspa-pro01a", "score": 0.8292242884635925, "is_gold": false, "snippet": "Profiling is effective and necessary:  It is an unavoidable fact that most terrorists today fit into certain demographics and categories, and so it is worth creating profiles of these categories and investigating more thoroughly anyone who fits into these prof"}, {"rank": 4, "docid": "test-society-tsmihwurpp-pro02a", "score": 0.8234444856643677, "is_gold": false, "snippet": "Profiling would have caught many of the perpetrators of terrorism in recent years.  Profiling takes account of many more characteristics than an individual’s ethnicity. Targeted checks would have caught, for example, the so called Christmas Day Bomber. Individ"}, {"rank": 5, "docid": "test-society-tsmihwurpp-pro02b", "score": 0.8212943077087402, "is_gold": false, "snippet": "It is incredibly unlikely that any randomly selected member of a particular group would be attempting to commit a crime. Racial, ethnic and identity groups are extremely large. Terrorist organisations, even al Qaeda, rarely contain more than a few hundred memb"}, {"rank": 6, "docid": "validation-politics-tsihsspa-con02b", "score": 0.8212487101554871, "is_gold": false, "snippet": "As conservative columnist Deroy Murdock put it: “We are not arguing that the TSA should send anyone named Mohammad to be waterboarded somewhere between the first-class lounge and the Pizza Hut.” [1] There is simply no reason why security profiling necessarily "}, {"rank": 7, "docid": "validation-politics-tsihsspa-pro02b", "score": 0.8204998970031738, "is_gold": false, "snippet": "Airport profiling is a violation of individual rights because it targets and harms certain groups more than others. Muslims and ethnic minorities will be especially harmed by security profiling as it will predominantly be members of these groups who are detain"}, {"rank": 8, "docid": "test-society-tsmihwurpp-pro01a", "score": 0.8147083520889282, "is_gold": false, "snippet": "When you know terrorists are likely to be members of particular national and ethnic groups, it is simply more practical to focus searches on those groups.  The reality is that all of the major terrorist attacks against Western targets in recent years have been"}, {"rank": 9, "docid": "validation-politics-tsihsspa-con01b", "score": 0.8091856241226196, "is_gold": false, "snippet": "More screening of travellers who display suspicious behaviour does not mean no or insufficient security surrounding travellers who do not. Security profiling would simply me a part of the security operation. What it does mean is individuals who buy one-way tic"}, {"rank": 10, "docid": "validation-politics-tsihsspa-con03a", "score": 0.808195173740387, "is_gold": false, "snippet": "Profiling will increase terrorism not combat it:  Profiling alienates groups needed in the fight against terrorism. Treating all Muslims as suspects, or being perceived as such, undermines efforts to gain intelligence on terrorists. Profiling the very communit"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-environment-ehwsnwu-pro02a", "query": "Underground Nuclear Storage is Safe  Underground nuclear waste storage means that nuclear waste is stored at least 300m underground. [I1]  The harm of a leak 300m underground is significantly limited, if the area has been chosen correctly then there should be no water sources nearby to contaminate. If this is the case, then a leak’s harm would be limited to the layers of sediment nearby which would be unaffected by radiation. By comparison a leak outside might lead to animals nearby suffering from contamination. Further nuclear waste might reach water sources should there be a leak above ground, if it is raining heavily when the leak happens for example.  Further, the other options available, such as above ground storage present a potentially greater danger, should something go wrong. This is because it is much easier for nuclear waste to leak radiation into the air. This is problematic because even a hint of radiation may well cause people to panic owing to the damaging and heavily publicised consequences of previous nuclear safety crises. As such, underground storage is safer both directly and indirectly. [1]  As well as this, underground storage also prevents nuclear waste or nuclear radiation from reaching other states and as such, results in greater safety across borders. [2]  Further, storing all nuclear waste underground means that countries can concentrate their research and training efforts on responding to subterranean containment failures. Focus and specialisation of this type is much more likely to avert a serious release of nuclear material from an underground facility than the broad and general approach that will be fostered by diverse and distinct above-ground storage solutions.  [1] “Europe eyes underground nuclear waste repositories.” Infowars Ireland. 20/02/2010   [2] “EU Debates Permanent Storage For Nuclear Waste.” 04/11/2010 AboutMyPlanet.   [I1] I am not sure how to replace this section. “Leakage” of radioactive material into the air is a minimal danger. The contributor may be referring to the ejection of irradiated dust and other particulates that has occurred when nuclear power stations have suffered explosive containment failures, but this is not comparable to the types of containment failures that might happen in facilities used to store spent nuclear fuel rods and medical waste.  One of the more substantial risks presented by underground storage is release of nuclear material into a water source.", "gold_docid": "test-environment-ehwsnwu-pro02b", "rank_T": 1, "rank_baseline": 14, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-environment-ehwsnwu-pro02b", "score": 0.6652450561523438, "is_gold": true, "snippet": "Journalist Jeremy Shere describes the problems with most methods of nuclear storage:  \"There have been a few other interesting ideas –such as burying nuclear waste beneath the ocean floor. Scientists have also thought about putting waste in really deep holes, "}, {"rank": 2, "docid": "validation-education-uehwsnwu-pro02b", "score": 0.6608262062072754, "is_gold": false, "snippet": "Journalist Jeremy Shere describes the problems with most methods of nuclear storage:  \"There have been a few other interesting ideas –such as burying nuclear waste beneath the ocean floor. Scientists have also thought about putting waste in really deep holes, "}, {"rank": 3, "docid": "test-environment-ehwsnwu-pro01b", "score": 0.6589533686637878, "is_gold": false, "snippet": "Underground nuclear storage is not the only way to store nuclear material. Economically speaking, it is more expensive, but likely much safer to store nuclear waste above ground in facilities that can be easily monitored and dealt with. Unlike in underground s"}, {"rank": 4, "docid": "validation-education-uehwsnwu-pro01b", "score": 0.6561279296875, "is_gold": false, "snippet": "Underground nuclear storage is not the only way to store nuclear material. Economically speaking, it is more expensive, but likely much safer to store nuclear waste above ground in facilities that can be easily monitored and dealt with. Unlike in underground s"}, {"rank": 5, "docid": "validation-education-uehwsnwu-con02b", "score": 0.645254373550415, "is_gold": false, "snippet": "Side proposition supports the reuse of nuclear waste; however, it also believes that the remaining nuclear waste left by the process should be stored underground.  This is because, the nuclear waste created from such a recycling process ends up being more conc"}, {"rank": 6, "docid": "test-environment-ehwsnwu-con02b", "score": 0.6434245705604553, "is_gold": false, "snippet": "Side proposition supports the reuse of nuclear waste; however, it also believes that the remaining nuclear waste left by the process should be stored underground.  This is because, the nuclear waste created from such a recycling process ends up being more conc"}, {"rank": 7, "docid": "test-environment-ehwsnwu-pro02a", "score": 0.6224222779273987, "is_gold": false, "snippet": "Underground Nuclear Storage is Safe  Underground nuclear waste storage means that nuclear waste is stored at least 300m underground. [I1]  The harm of a leak 300m underground is significantly limited, if the area has been chosen correctly then there should be "}, {"rank": 8, "docid": "validation-education-uehwsnwu-pro02a", "score": 0.6159920692443848, "is_gold": false, "snippet": "Underground nuclear storage is safer than any available alternative  Underground nuclear waste storage means that nuclear waste is stored at least 300m underground.  The harm of a leak 300m underground is significantly limited, if the area has been chosen corr"}, {"rank": 9, "docid": "test-environment-ehwsnwu-con01b", "score": 0.5727879405021667, "is_gold": false, "snippet": "The economic costs of underground storage are high. However, given that nuclear power is necessary to avoid what would likely be a very significant amount of economic harm, specifically from global warming. For example, it has been projected that not doing any"}, {"rank": 10, "docid": "validation-education-uehwsnwu-con01b", "score": 0.5699492692947388, "is_gold": false, "snippet": "The economic costs of underground storage are high. However, given that nuclear power is necessary to avoid what would likely be a very significant amount of economic harm, specifically from global warming. For example, it has been projected that not doing any"}], "topK_baseline": [{"rank": 1, "docid": "test-environment-ehwsnwu-pro02a", "score": 1.0, "is_gold": false, "snippet": "Underground Nuclear Storage is Safe  Underground nuclear waste storage means that nuclear waste is stored at least 300m underground. [I1]  The harm of a leak 300m underground is significantly limited, if the area has been chosen correctly then there should be "}, {"rank": 2, "docid": "validation-education-uehwsnwu-pro02a", "score": 0.9758111834526062, "is_gold": false, "snippet": "Underground nuclear storage is safer than any available alternative  Underground nuclear waste storage means that nuclear waste is stored at least 300m underground.  The harm of a leak 300m underground is significantly limited, if the area has been chosen corr"}, {"rank": 3, "docid": "validation-education-uehwsnwu-con02b", "score": 0.859855055809021, "is_gold": false, "snippet": "Side proposition supports the reuse of nuclear waste; however, it also believes that the remaining nuclear waste left by the process should be stored underground.  This is because, the nuclear waste created from such a recycling process ends up being more conc"}, {"rank": 4, "docid": "test-environment-ehwsnwu-con02b", "score": 0.8505966663360596, "is_gold": false, "snippet": "Side proposition supports the reuse of nuclear waste; however, it also believes that the remaining nuclear waste left by the process should be stored underground.  This is because, the nuclear waste created from such a recycling process ends up being more conc"}, {"rank": 5, "docid": "test-environment-ehwsnwu-pro01b", "score": 0.8398016095161438, "is_gold": false, "snippet": "Underground nuclear storage is not the only way to store nuclear material. Economically speaking, it is more expensive, but likely much safer to store nuclear waste above ground in facilities that can be easily monitored and dealt with. Unlike in underground s"}, {"rank": 6, "docid": "validation-education-uehwsnwu-pro01b", "score": 0.8382177352905273, "is_gold": false, "snippet": "Underground nuclear storage is not the only way to store nuclear material. Economically speaking, it is more expensive, but likely much safer to store nuclear waste above ground in facilities that can be easily monitored and dealt with. Unlike in underground s"}, {"rank": 7, "docid": "validation-education-uehwsnwu-pro01a", "score": 0.8141233921051025, "is_gold": false, "snippet": "Storing nuclear waste underground is necessary - there are no better option available  Even states without nuclear waste programs tend to generate radioactive waste. For example, research and medicine both use nuclear material and nuclear technology. Technolog"}, {"rank": 8, "docid": "validation-education-uehwsnwu-con01a", "score": 0.8131281733512878, "is_gold": false, "snippet": "Underground nuclear storage is excessively expensive  Underground nuclear storage is expensive. This is because the deep geological repositories needed to deal with such waste are difficult to construct. This is because said repositories need to be 300m underg"}, {"rank": 9, "docid": "test-environment-ehwsnwu-con01a", "score": 0.8085236549377441, "is_gold": false, "snippet": "Underground Nuclear Storage is Expensive.  Underground nuclear storage is expensive. This is because the deep geological repositories needed to deal with such waste are difficult to construct. This is because said repositories need to be 300m underground and a"}, {"rank": 10, "docid": "test-environment-ehwsnwu-con01b", "score": 0.7999647855758667, "is_gold": false, "snippet": "The economic costs of underground storage are high. However, given that nuclear power is necessary to avoid what would likely be a very significant amount of economic harm, specifically from global warming. For example, it has been projected that not doing any"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-ralhrilglv-con01a", "query": "Criminal defendants don’t get to pick and choose trial dates  Irrespective of who they are, Kenyatta and Ruto are nothing special – they’re just another two criminal defendants.  A person who is on trial murder or any other offence, whoever they are, can’t pick and choose their trial date for their own convenience or for their own business interests – why should these two particular defendants get a special privilege? Silvio Berlusconi was prosecuted by the Italian courts; the slow speed was due to the glacial pace of the Italian legal system rather than him particularly agitating for a special hold-up. The court cases were not done at his convenience.", "gold_docid": "test-law-ralhrilglv-con01b", "rank_T": 8, "rank_baseline": 21, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-law-ralhrilglv-con01a", "score": 0.689004123210907, "is_gold": false, "snippet": "Criminal defendants don’t get to pick and choose trial dates  Irrespective of who they are, Kenyatta and Ruto are nothing special – they’re just another two criminal defendants.  A person who is on trial murder or any other offence, whoever they are, can’t pic"}, {"rank": 2, "docid": "test-philosophy-eppphwlrtjs-pro04b", "score": 0.45530107617378235, "is_gold": false, "snippet": "Trial by jury is too important to sacrifice it for the sake of efficiency. As explained in the Opposition case, trial by jury is one of the cornerstones of just democratic courts. There are other ways to free up resources: perhaps if we put fewer people in pri"}, {"rank": 3, "docid": "test-law-ralhrilglv-con02b", "score": 0.4535263776779175, "is_gold": false, "snippet": "Kenya doesn’t need a trial. The Kenyan parliament voted against such a thing – the Kenyan people decided in 2013 that they want to give Kenyatta and Ruto a democratic mandate.  While there is a terror threat – something that Kenyatta and Ruto can deal with in "}, {"rank": 4, "docid": "training-law-hrilhshsi-con01b", "score": 0.4478534162044525, "is_gold": false, "snippet": "Even though it does effectively create impunity, this is not a unique phenomenon. Decisions on who to prosecute will always happen, and some form of bias against prosecuting powerful people is to some extent inevitable. So in practice not everyone is equal bef"}, {"rank": 5, "docid": "test-law-ralhrilglv-con04b", "score": 0.42756760120391846, "is_gold": false, "snippet": "Even though all parties agree to this, it is not appropriate for the ICC to be trying a sitting head of state anyway. The ICC is accepting this by holding the trial by videolink – no other court would do such a thing.  While it sounds tempting to allow Kenyatt"}, {"rank": 6, "docid": "test-law-ralhrilglv-pro02b", "score": 0.42556893825531006, "is_gold": false, "snippet": "It is accepted as a position of international criminal law that head of state immunity does not apply before international tribunals [1] . Any such immunity that Kenya had was waived by them joining the ICC, which they did voluntarily.  Even so, just because s"}, {"rank": 7, "docid": "training-international-alilhbassw-pro01b", "score": 0.42523980140686035, "is_gold": false, "snippet": "Almost all the cases involve self-reference – the only ones that did not are UN Security Council references, done in the same way as the International Criminal Tribunal for the former Yugoslavia and the International Criminal Tribunal for Rwanda were set up. T"}, {"rank": 8, "docid": "test-law-ralhrilglv-con01b", "score": 0.42503324151039124, "is_gold": true, "snippet": "Not every defendant is a head of state. While justice should aim to treat all defendants alike, there are some cases where things have to be changed in order to allow states to function."}, {"rank": 9, "docid": "test-health-dhgsshbesbc-pro02b", "score": 0.42381349205970764, "is_gold": false, "snippet": "It’s not as if the employee can’t tell their employer at present – it’s that he or she could, but doesn’t want to. They get to decide what’s in their best interests (including what’s likely at trial) – and sadly, that will often be keeping quiet about his cond"}, {"rank": 10, "docid": "training-international-melhrilppd-con02b", "score": 0.4189554452896118, "is_gold": false, "snippet": "Just because something is difficult does not mean it should not be attempted.  Israel itself was no stranger to war crimes trials between Nuremberg and the ICTY: Adolf Eichmann, the logistical architect of the Holocaust, was tried and put to death by an Israel"}], "topK_baseline": [{"rank": 1, "docid": "test-law-ralhrilglv-con01a", "score": 1.0000001192092896, "is_gold": false, "snippet": "Criminal defendants don’t get to pick and choose trial dates  Irrespective of who they are, Kenyatta and Ruto are nothing special – they’re just another two criminal defendants.  A person who is on trial murder or any other offence, whoever they are, can’t pic"}, {"rank": 2, "docid": "test-law-ralhrilglv-con02b", "score": 0.7893269062042236, "is_gold": false, "snippet": "Kenya doesn’t need a trial. The Kenyan parliament voted against such a thing – the Kenyan people decided in 2013 that they want to give Kenyatta and Ruto a democratic mandate.  While there is a terror threat – something that Kenyatta and Ruto can deal with in "}, {"rank": 3, "docid": "test-law-ralhrilglv-con04a", "score": 0.7623262405395508, "is_gold": false, "snippet": "Just hold the trial by videolink  It has already been agreed that defendants can appear at the court by videolink [1] for parts of the trial. This is not problematic, unless the defendants want to start representing themselves.  Bearing in mind that Ruto and K"}, {"rank": 4, "docid": "test-law-ralhrilglv-con04b", "score": 0.7607197761535645, "is_gold": false, "snippet": "Even though all parties agree to this, it is not appropriate for the ICC to be trying a sitting head of state anyway. The ICC is accepting this by holding the trial by videolink – no other court would do such a thing.  While it sounds tempting to allow Kenyatt"}, {"rank": 5, "docid": "test-law-ralhrilglv-pro01b", "score": 0.756310760974884, "is_gold": false, "snippet": "Kenya is an advanced state with a functioning system of the rule of law – except for those in power. With modern video technology, Ruto and Kenyatta could oversee the governance of the country from The Hague, or, alternatively, participate in the trial through"}, {"rank": 6, "docid": "training-law-hrilhshsi-con01b", "score": 0.7439570426940918, "is_gold": false, "snippet": "Even though it does effectively create impunity, this is not a unique phenomenon. Decisions on who to prosecute will always happen, and some form of bias against prosecuting powerful people is to some extent inevitable. So in practice not everyone is equal bef"}, {"rank": 7, "docid": "training-international-alilhbassw-pro01b", "score": 0.7431323528289795, "is_gold": false, "snippet": "Almost all the cases involve self-reference – the only ones that did not are UN Security Council references, done in the same way as the International Criminal Tribunal for the former Yugoslavia and the International Criminal Tribunal for Rwanda were set up. T"}, {"rank": 8, "docid": "test-law-ralhrilglv-pro02b", "score": 0.7396021485328674, "is_gold": false, "snippet": "It is accepted as a position of international criminal law that head of state immunity does not apply before international tribunals [1] . Any such immunity that Kenya had was waived by them joining the ICC, which they did voluntarily.  Even so, just because s"}, {"rank": 9, "docid": "test-philosophy-eppphwlrtjs-pro04b", "score": 0.7385779619216919, "is_gold": false, "snippet": "Trial by jury is too important to sacrifice it for the sake of efficiency. As explained in the Opposition case, trial by jury is one of the cornerstones of just democratic courts. There are other ways to free up resources: perhaps if we put fewer people in pri"}, {"rank": 10, "docid": "test-politics-eppghwgpi-con03a", "score": 0.7356237769126892, "is_gold": false, "snippet": "Immunity for politicians is an unjust double standard  Every victim deserves to have the perpetrator of their suffering answer for their misdeeds. It is unjust that certain offenders would avoid retribution, and certain victims would be denied their day in cou"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-law-sdiflhrdffe-pro01a", "query": "These people are under serious threat for their pursuit of justice  The internet has become the paramount means of voicing dissent within repressive regimes. As the technology regimes have to keep control of their people increases, with access to high-tech surveillance technology adding to their already formidable arsenals of physical oppression, the internet has become the only platform to express meaningful dissent. The Jasmine Revolution in Tunisia, for example, wherein people mobilized to overthrow their dictator has even been dubbed the Twitter Revolution. [1] Bloggers have become a major voice of dissent in other repressive regimes, including Cuba and China. Yet the blog platform is far from safe. Governments have sought to crack down on bloggers’ ability to dissent, using draconian methods like imprisonment to cow them into silence. In China the arrests of bloggers like Zhai Xiaobing, who was arrested and detained for simply posting a joke about Communist Party, have served to frighten many into silence. [2] So long as information is denied to the public, governments are able to maintain their repression. Only external help from democratic, or at least more liberal, states can provide the safe haven for people who have rubbed their governments the wrong way in their pursuit of reform and justice.  [1] Zuckerman, E. “The First Twitter Revolution?”. Foreign Policy. 14 January 2011.   [2] Wong, G. “Zhai Xiaobing, Chinese Blogger, Arrested for Twitter Joke About China’s Government”. Huffington Post. 21 November 2012.", "gold_docid": "test-law-sdiflhrdffe-pro01b", "rank_T": 2, "rank_baseline": 14, "overlap@K": 0.4, "topK_T": [{"rank": 1, "docid": "test-law-sdiflhrdffe-pro01a", "score": 0.5910506248474121, "is_gold": false, "snippet": "These people are under serious threat for their pursuit of justice  The internet has become the paramount means of voicing dissent within repressive regimes. As the technology regimes have to keep control of their people increases, with access to high-tech sur"}, {"rank": 2, "docid": "test-law-sdiflhrdffe-pro01b", "score": 0.5827666521072388, "is_gold": true, "snippet": "Offering amnesty will not serve the cause of justice, it is responding to the symptom not the cause. It is unfortunate that individual bloggers suffer at the hands of governments, but seeking to give them amnesty will only serve to anger the regimes, leading t"}, {"rank": 3, "docid": "training-digital-freedoms-fehbwdsot-pro01b", "score": 0.5538837909698486, "is_gold": false, "snippet": "Internet censorship is a problem, but it is hardly the biggest one facing people in these countries. Internet access is often limited to only the more affluent segments of most poor countries, and it is thus not the best mode of building grass roots movement f"}, {"rank": 4, "docid": "training-digital-freedoms-aihbied-con04b", "score": 0.5345829725265503, "is_gold": false, "snippet": "Governments cannot always get away with the targeting of internet dissidents. Bloggers are often famous and followed intently by many people. If a popular blogger all of a sudden disappears it is more likely to generate increased support for the blogger and th"}, {"rank": 5, "docid": "training-digital-freedoms-fehwiwcb-pro01b", "score": 0.5291211605072021, "is_gold": false, "snippet": "First it is wrong to simply assume that this will guarantee protection for people involved in uprisings. Previous attempts at providing software to help dissenters have had security vulnerabilities that could have allowed the regime to expose its users identit"}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-con02b", "score": 0.5209949016571045, "is_gold": false, "snippet": "There is only so much that governments can do to oppress their people. Even if this policy did embolden repressive states to ramp up their other means of control, the genie of the internet would be out of the bottle. Without it, dissident groups would find it "}, {"rank": 7, "docid": "test-digital-freedoms-aihwbasmn-con04b", "score": 0.5184309482574463, "is_gold": false, "snippet": "The state curtails all kinds of speech when it is genuinely in the public interest. Blocking Twitter and other social networks during times of riot is a very particular case of intervention, one with specific manifest benefits for society. The internet is inde"}, {"rank": 8, "docid": "training-digital-freedoms-gtdfais-con02b", "score": 0.48809099197387695, "is_gold": false, "snippet": "Democratic change can come about in a variety of ways. Violent public protests are only one such way, and probably the least desirable one. And now, with access to social media nearly universally available, such protests can be organized faster, on a larger, m"}, {"rank": 9, "docid": "test-society-cpisydfphwj-pro03b", "score": 0.48768141865730286, "is_gold": false, "snippet": "There are immense problems with using Facebook to facilitate protests in oppressive regimes. Firstly, due to the anonymity of users, it would be extremely easy for government forces to disguise themselves as being protesters and find out future protest locatio"}, {"rank": 10, "docid": "test-science-cpisydfphwj-pro03b", "score": 0.48768141865730286, "is_gold": false, "snippet": "There are immense problems with using Facebook to facilitate protests in oppressive regimes. Firstly, due to the anonymity of users, it would be extremely easy for government forces to disguise themselves as being protesters and find out future protest locatio"}], "topK_baseline": [{"rank": 1, "docid": "test-law-sdiflhrdffe-pro01a", "score": 0.9999998807907104, "is_gold": false, "snippet": "These people are under serious threat for their pursuit of justice  The internet has become the paramount means of voicing dissent within repressive regimes. As the technology regimes have to keep control of their people increases, with access to high-tech sur"}, {"rank": 2, "docid": "training-digital-freedoms-fehbwdsot-pro01a", "score": 0.8393682241439819, "is_gold": false, "snippet": "Repressive governments rely on internet censorship to stifle dissent and entrench their power  The internet has become the ultimate platform for dissent within repressive regimes. It breaks the government monopoly on information and communication. As the techn"}, {"rank": 3, "docid": "training-digital-freedoms-fehwiwcb-pro01a", "score": 0.8185844421386719, "is_gold": false, "snippet": "Anonymity software helps to guarantee protection for people involved in uprisings  The past few years have been marked by an explosion of uprisings around the world, particularly in the Middle East, North Africa, and Arab world generally. These uprisings have "}, {"rank": 4, "docid": "training-digital-freedoms-fehbwdsot-pro01b", "score": 0.803188681602478, "is_gold": false, "snippet": "Internet censorship is a problem, but it is hardly the biggest one facing people in these countries. Internet access is often limited to only the more affluent segments of most poor countries, and it is thus not the best mode of building grass roots movement f"}, {"rank": 5, "docid": "training-digital-freedoms-aihbied-con04b", "score": 0.8002620935440063, "is_gold": false, "snippet": "Governments cannot always get away with the targeting of internet dissidents. Bloggers are often famous and followed intently by many people. If a popular blogger all of a sudden disappears it is more likely to generate increased support for the blogger and th"}, {"rank": 6, "docid": "training-digital-freedoms-fehbwdsot-con02b", "score": 0.795246958732605, "is_gold": false, "snippet": "There is only so much that governments can do to oppress their people. Even if this policy did embolden repressive states to ramp up their other means of control, the genie of the internet would be out of the bottle. Without it, dissident groups would find it "}, {"rank": 7, "docid": "training-free-speech-debate-ifcidffe-pro01a", "score": 0.7948071956634521, "is_gold": false, "snippet": "Advanced surveillance technology prevents dissidents from being able to organize and sue for freedom  High-tech surveillance technology has given repressive governments and police states a new lease on life. Now more than ever they can intrude into every aspec"}, {"rank": 8, "docid": "training-digital-freedoms-aihbied-con01a", "score": 0.7865884900093079, "is_gold": false, "snippet": "The internet can be successfully censored so that it only promotes pro-regime propaganda.  The internet is said to promote democracy based on the claim that it leads to the free flow of information. Unfortunately, this is false in many parts of the world. 40 c"}, {"rank": 9, "docid": "training-digital-freedoms-fehwiwcb-con01a", "score": 0.784253716468811, "is_gold": false, "snippet": "Justice demands that those who seek actual political redress be sorted from opportunistic marauders  The technology of anonymity can have the effect of providing needed security to dissidents seeking to make their country a better place, but it is just as like"}, {"rank": 10, "docid": "training-digital-freedoms-fehwiwcb-con01b", "score": 0.7840268015861511, "is_gold": false, "snippet": "Regimes will paint everyone as looters and disturbers of order irrespective of anonymity. This software changes that status quo by offering the political dissidents, the real people regimes will be trying to root out during and in the aftermath of uprisings, a"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-free-speech-debate-yfsdfkhbwu-con02a", "query": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for the convenience of universities. Indeed universities quite happily accept the political and economic stability provided by states at exactly the same time as criticising the methods they need to use to maintain it.  However, ultimately universities are service providers from the point of view of the state, training and skilling the workforce. The university provides its expertise in exchange for funding and student fees. Where, exactly, the opinions of the faculty enter into such an equation is not clear and appears to have been assumed by proposition. Of course individual academics and students have the right to their own political views but the idea that a university as an institution has rights distinct from, say, a supermarket chain is impossible to justify. If a supermarket announced that it should be free to ignore local laws and adopt those of its base state instead, that would clearly be rejected. Just as when a food chain invests in a country for, say, beef, the arrangement is predicated on the understanding that both parties benefit and each has a little room for negotiation. [i] The same should apply here. If prop were to argue that Asian nations should relax there approach to cannabis so that it students could enjoy a more genuine ‘Western student experience’ the statement would be the subject of ridicule, so should this be.  [i] Smith, David, ‘Tesco should give us some of these billions’, guardian.co.uk, 15 May 2009,", "gold_docid": "test-free-speech-debate-yfsdfkhbwu-con02b", "rank_T": 3, "rank_baseline": 15, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-yfsdfkhbwu-con02a", "score": 0.7026703953742981, "is_gold": false, "snippet": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for th"}, {"rank": 2, "docid": "test-education-ufsdfkhbwu-con02b", "score": 0.5776368975639343, "is_gold": false, "snippet": "Singapore in this particular instance is securing far more than a ‘service provider’ from a university whose foundation precedes that of the state by over a century. Yale is an internationally identifiable brand, as would any other major university be, and Sin"}, {"rank": 3, "docid": "test-free-speech-debate-yfsdfkhbwu-con02b", "score": 0.5776368975639343, "is_gold": true, "snippet": "Singapore in this particular instance is securing far more than a ‘service provider’ from a university whose foundation precedes that of the state by over a century. Yale is an internationally identifiable brand, as would any other major university be, and Sin"}, {"rank": 4, "docid": "test-education-ufsdfkhbwu-pro02b", "score": 0.5734893083572388, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 5, "docid": "test-free-speech-debate-yfsdfkhbwu-pro02b", "score": 0.5734893083572388, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 6, "docid": "test-education-ughbuesbf-con05b", "score": 0.5575013756752014, "is_gold": false, "snippet": "Publicly funded universities in practice do not become parrots of the state’s agenda; far from it, in fact. Often it is public institutions that are the most outspoken against government activities. The University of California, Berkeley, for example, is one o"}, {"rank": 7, "docid": "training-education-uhwecpuu-con01b", "score": 0.5078774690628052, "is_gold": false, "snippet": "Allowing market forces to control educational opportunity is as legitimate at university level as it is at school level. Parents wanting the best for their children should be allowed to spend the resources that they have accumulated in any way that they like, "}, {"rank": 8, "docid": "test-education-ughbuesbf-con04b", "score": 0.4952910542488098, "is_gold": false, "snippet": "Many state services are furnished that benefit a few and are not used by others. That is often just the way such services operate. So long as everyone has access to the service, then it is just to provide it out of tax revenues. Every individual, when higher e"}, {"rank": 9, "docid": "test-politics-glghssi-con01b", "score": 0.48338207602500916, "is_gold": false, "snippet": "Scotland already has a distinct global profile including world-class national brands such as whiskey and salmon. Arguing that Scotland would have ‘less influence’ as an independent state is frankly absurd as, at the moment, it has none. Westminster leads in in"}, {"rank": 10, "docid": "test-education-pteuhwfphe-con03b", "score": 0.47825050354003906, "is_gold": false, "snippet": "A graduate tax put into an independent trust fund could in fact conversely help universities gain more academic freedom than they have now. They would be more free from market constraints which may restrict them, for example universities could be able to offer"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-yfsdfkhbwu-con02a", "score": 1.0, "is_gold": false, "snippet": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for th"}, {"rank": 2, "docid": "test-education-ughbuesbf-con04b", "score": 0.7970026731491089, "is_gold": false, "snippet": "Many state services are furnished that benefit a few and are not used by others. That is often just the way such services operate. So long as everyone has access to the service, then it is just to provide it out of tax revenues. Every individual, when higher e"}, {"rank": 3, "docid": "test-education-ufsdfkhbwu-pro02b", "score": 0.7914632558822632, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 4, "docid": "test-free-speech-debate-yfsdfkhbwu-pro02b", "score": 0.7914632558822632, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 5, "docid": "training-culture-aeuhbdcaal-con03b", "score": 0.7836205959320068, "is_gold": false, "snippet": "Opp’s case sounds excellent, and reasonable and sensible. And complete nonsense. Those countries that have changed their fee arrangements for students in recent years, such as the UK, have seen that students are very concerned with whether their degree is like"}, {"rank": 6, "docid": "test-free-speech-debate-yfsdfkhbwu-con03a", "score": 0.7808429002761841, "is_gold": false, "snippet": "Universities should exchange ideas not impose them  Of all possible institutions, for a university to suggest that it is not open to defending its ideas rather than insisting that they be artificially imported seems counter-intuitive. As Asian and European int"}, {"rank": 7, "docid": "test-education-ughbuesbf-pro01b", "score": 0.7786573171615601, "is_gold": false, "snippet": "There is no right to the university experience. University life is not used as the previous argument would suggest. University life is often about alcohol first, education second. Self­knowledge and genuine wisdom come from study and reflection. This can be do"}, {"rank": 8, "docid": "training-education-uhwecpuu-con01b", "score": 0.7757779359817505, "is_gold": false, "snippet": "Allowing market forces to control educational opportunity is as legitimate at university level as it is at school level. Parents wanting the best for their children should be allowed to spend the resources that they have accumulated in any way that they like, "}, {"rank": 9, "docid": "training-digital-freedoms-pidfakhwcs-pro02b", "score": 0.7741172313690186, "is_gold": false, "snippet": "These arrangements are so onerous that they will serve as a very real disincentive to universities taking public funding. Universities are rational in their decision-making, and they will be less likely to approve or participate in research projects that end u"}, {"rank": 10, "docid": "test-education-ufsdfkhbwu-con01b", "score": 0.7730743288993835, "is_gold": false, "snippet": "There is gradualism and then there is inertia. Refusing to cooperate with governments where individuals can be banned from addressing a group of students would seem to be setting the bar relatively low. In this particular instance, the bar doesn’t appear to ha"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-philosophy-apessghwba-con01a", "query": "Animals' rights are of less moral worth than human rights  Humans are complex beings with large well developed brains, that form sizeable social groups, have significant ability to communicate with one another, possess interconnected desires, preferences and interests about the world, have an awareness of their own existence and mortality, and as such are beings worthy of moral consideration. Animals too express some of these characteristics to some degree and thus animals too are worthy of moral consideration. However, animal lives and human lives are of unequal value. This is due to the fact that no animal possesses all of these characteristics to the same degree as the average human, or even comes particularly close. Thus any rights ascribed to animals should be truncated relative to the rights we ascribe to humans. [1] Therefore animals should not rightly possess the same rights to not be experimented upon as humans might. To the extent to which causing some harm to animals brings great benefit to humans, we are morally justified in creating some moral harm, to achieve a far greater moral good.  [1] Frey, R. G., “Moral Standing: The Value of Life and Speciesism”, in La Follette (ed.), Ethics in Practice, (Malden, Mass; Oxford : Blackwell Pub, 2007)", "gold_docid": "test-philosophy-apessghwba-con01b", "rank_T": 9, "rank_baseline": 21, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "training-environment-aelmmhbahr-con02b", "score": 0.6286181211471558, "is_gold": false, "snippet": "There is a different between being morally responsible and being morally considerable. Human beings are both. Moral responsibility implies a duty and therefore a capability to act in an ethical manner. Animals can not of course be morally responsible as they d"}, {"rank": 2, "docid": "test-environment-assgbatj-con01a", "score": 0.6137163639068604, "is_gold": false, "snippet": "Animals don’t have human rights  Humans have large brains, form social groups, communicate and are generally worthy of moral consideration. We also are aware of ourselves and of the nature of death. Some animals have some of these characteristics but not all s"}, {"rank": 3, "docid": "training-environment-aelmmhbahr-con02a", "score": 0.6122271418571472, "is_gold": false, "snippet": "Animals are not moral agents  It makes no sense to give animals rights because they cannot makes decisions about what is right and wrong and will not try to treat us in an ethical manner in return. Why make them a moral agent by giving them rights?"}, {"rank": 4, "docid": "test-philosophy-apessghwba-pro02b", "score": 0.611117422580719, "is_gold": false, "snippet": "Firstly, due to our larger and more sophisticated brains, one would expect the average human to have a great many more interests than any animal, for those interests to be more complex and interconnected, and for there to be a greater capacity for reflection a"}, {"rank": 5, "docid": "training-environment-aelmmhbahr-pro03b", "score": 0.6037693619728088, "is_gold": false, "snippet": "Equality requires that two beings are actually equal on some fundamental level. Human beings have certain essential similarities that make them equal. These do not stretch to animals. Human beings are able to distinguish right from wrong while animals have no "}, {"rank": 6, "docid": "test-philosophy-apessghwba-con01a", "score": 0.592642068862915, "is_gold": false, "snippet": "Animals' rights are of less moral worth than human rights  Humans are complex beings with large well developed brains, that form sizeable social groups, have significant ability to communicate with one another, possess interconnected desires, preferences and i"}, {"rank": 7, "docid": "training-environment-achbessbp-pro03b", "score": 0.5838677883148193, "is_gold": false, "snippet": "Superior human intellect and sentience only means that we should make sure we consider the moral ramifications of our actions, not that we should take any particular action as a result. It is entirely in keeping with this for us to conclude that human life and"}, {"rank": 8, "docid": "training-environment-achbessbp-con04b", "score": 0.5671306848526001, "is_gold": false, "snippet": "This argument fails to note that states restrict human behaviour towards animals with the aim of protecting animals in many situations, not just that of 'endangered species'. For example the aforementioned fox hunting ban, which outlawed hunting foxes with dog"}, {"rank": 9, "docid": "test-philosophy-apessghwba-con01b", "score": 0.5652356743812561, "is_gold": true, "snippet": "To argue that the ends justify the means does not justify research upon animals. Firstly we do not know the extent to which animals are capable of holding interests or experiencing suffering, as they are unable to communicate with us. Our shared similarities g"}, {"rank": 10, "docid": "training-environment-aelmmhbahr-con01b", "score": 0.5399571657180786, "is_gold": false, "snippet": "We are morally responsible creatures and we can survive perfectly well without being cruel to animals. Animals are different because they need to hunt to survive and are not morally responsible. The interests they satisfy by being cruel to other animals (namel"}], "topK_baseline": [{"rank": 1, "docid": "test-philosophy-apessghwba-con01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "Animals' rights are of less moral worth than human rights  Humans are complex beings with large well developed brains, that form sizeable social groups, have significant ability to communicate with one another, possess interconnected desires, preferences and i"}, {"rank": 2, "docid": "test-environment-assgbatj-con01a", "score": 0.9011455178260803, "is_gold": false, "snippet": "Animals don’t have human rights  Humans have large brains, form social groups, communicate and are generally worthy of moral consideration. We also are aware of ourselves and of the nature of death. Some animals have some of these characteristics but not all s"}, {"rank": 3, "docid": "training-environment-aelmmhbahr-pro03b", "score": 0.8694874048233032, "is_gold": false, "snippet": "Equality requires that two beings are actually equal on some fundamental level. Human beings have certain essential similarities that make them equal. These do not stretch to animals. Human beings are able to distinguish right from wrong while animals have no "}, {"rank": 4, "docid": "test-philosophy-apessghwba-pro02b", "score": 0.8627289533615112, "is_gold": false, "snippet": "Firstly, due to our larger and more sophisticated brains, one would expect the average human to have a great many more interests than any animal, for those interests to be more complex and interconnected, and for there to be a greater capacity for reflection a"}, {"rank": 5, "docid": "training-environment-aelmmhbahr-pro01a", "score": 0.8443788886070251, "is_gold": false, "snippet": "Animals are intrinsically worthy of rights because they are sentient  Sentience is the property of being conscious. Sentience brings with it the ability to experience. There is a massive difference in the way that we treat sentient and non-sentient beings inst"}, {"rank": 6, "docid": "training-environment-aelmmhbahr-pro03a", "score": 0.8370312452316284, "is_gold": false, "snippet": "Animals are equal to human beings.  It is true that animals and human beings are different. It is also true that men are different from women and children from adults. Equality does not require beings to be identical. It is true that whilst many people argue w"}, {"rank": 7, "docid": "training-environment-aelmmhbahr-pro04a", "score": 0.8264309763908386, "is_gold": false, "snippet": "Even if it matters whether or not humans and animals are similar, humans and animals are in fact similar enough that both should be granted rights.  We have already noted that beings do not need to be similar in order to be equally morally considerable. Assumi"}, {"rank": 8, "docid": "training-environment-ahwbsawhnbsf-con01a", "score": 0.8256829977035522, "is_gold": false, "snippet": "The rights of humans are more important than the rights of animals  Animal rights are not generally accepted as universal rights in the same way as human rights are. If we want to have a shared society, it is necessary to grant each other certain rights, such "}, {"rank": 9, "docid": "training-environment-achbessbp-con04a", "score": 0.8247814774513245, "is_gold": false, "snippet": "Human rights trump those of lower animals  Why human rights always trump animal rights: It has already been established that laws protecting endangered species cause harm to humans by denying them the opportunity to engage in behaviour they would otherwise des"}, {"rank": 10, "docid": "training-environment-achbessbp-pro03b", "score": 0.8204106688499451, "is_gold": false, "snippet": "Superior human intellect and sentience only means that we should make sure we consider the moral ramifications of our actions, not that we should take any particular action as a result. It is entirely in keeping with this for us to conclude that human life and"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-education-ufsdfkhbwu-con02a", "query": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for the convenience of universities. Indeed universities quite happily accept the political and economic stability provided by states at exactly the same time as criticising the methods they need to use to maintain it.  However, ultimately universities are service providers from the point of view of the state, training and skilling the workforce. The university provides its expertise in exchange for funding and student fees. Where, exactly, the opinions of the faculty enter into such an equation is not clear and appears to have been assumed by proposition. Of course individual academics and students have the right to their own political views but the idea that a university as an institution has rights distinct from, say, a supermarket chain is impossible to justify. If a supermarket announced that it should be free to ignore local laws and adopt those of its base state instead, that would clearly be rejected. Just as when a food chain invests in a country for, say, beef, the arrangement is predicated on the understanding that both parties benefit and each has a little room for negotiation. [i] The same should apply here. If prop were to argue that Asian nations should relax there approach to cannabis so that it students could enjoy a more genuine ‘Western student experience’ the statement would be the subject of ridicule, so should this be.  [i] Smith, David, ‘Tesco should give us some of these billions’, guardian.co.uk, 15 May 2009,", "gold_docid": "test-education-ufsdfkhbwu-con02b", "rank_T": 2, "rank_baseline": 14, "overlap@K": 0.5, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-yfsdfkhbwu-con02a", "score": 0.7026703953742981, "is_gold": false, "snippet": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for th"}, {"rank": 2, "docid": "test-education-ufsdfkhbwu-con02b", "score": 0.5776368975639343, "is_gold": true, "snippet": "Singapore in this particular instance is securing far more than a ‘service provider’ from a university whose foundation precedes that of the state by over a century. Yale is an internationally identifiable brand, as would any other major university be, and Sin"}, {"rank": 3, "docid": "test-free-speech-debate-yfsdfkhbwu-con02b", "score": 0.5776368975639343, "is_gold": false, "snippet": "Singapore in this particular instance is securing far more than a ‘service provider’ from a university whose foundation precedes that of the state by over a century. Yale is an internationally identifiable brand, as would any other major university be, and Sin"}, {"rank": 4, "docid": "test-education-ufsdfkhbwu-pro02b", "score": 0.5734893083572388, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 5, "docid": "test-free-speech-debate-yfsdfkhbwu-pro02b", "score": 0.5734893083572388, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 6, "docid": "test-education-ughbuesbf-con05b", "score": 0.5575013756752014, "is_gold": false, "snippet": "Publicly funded universities in practice do not become parrots of the state’s agenda; far from it, in fact. Often it is public institutions that are the most outspoken against government activities. The University of California, Berkeley, for example, is one o"}, {"rank": 7, "docid": "training-education-uhwecpuu-con01b", "score": 0.5078774690628052, "is_gold": false, "snippet": "Allowing market forces to control educational opportunity is as legitimate at university level as it is at school level. Parents wanting the best for their children should be allowed to spend the resources that they have accumulated in any way that they like, "}, {"rank": 8, "docid": "test-education-ughbuesbf-con04b", "score": 0.4952910542488098, "is_gold": false, "snippet": "Many state services are furnished that benefit a few and are not used by others. That is often just the way such services operate. So long as everyone has access to the service, then it is just to provide it out of tax revenues. Every individual, when higher e"}, {"rank": 9, "docid": "test-politics-glghssi-con01b", "score": 0.48338207602500916, "is_gold": false, "snippet": "Scotland already has a distinct global profile including world-class national brands such as whiskey and salmon. Arguing that Scotland would have ‘less influence’ as an independent state is frankly absurd as, at the moment, it has none. Westminster leads in in"}, {"rank": 10, "docid": "test-education-pteuhwfphe-con03b", "score": 0.47825050354003906, "is_gold": false, "snippet": "A graduate tax put into an independent trust fund could in fact conversely help universities gain more academic freedom than they have now. They would be more free from market constraints which may restrict them, for example universities could be able to offer"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-yfsdfkhbwu-con02a", "score": 1.0, "is_gold": false, "snippet": "‘Separation of town and gown’  There are two parties involved in this interaction, the state and the university. To pretend that is an entirely one way process is to ignore reality. Contrary to the belief of many Senior Common Rooms, states do not exist for th"}, {"rank": 2, "docid": "test-education-ughbuesbf-con04b", "score": 0.7970026731491089, "is_gold": false, "snippet": "Many state services are furnished that benefit a few and are not used by others. That is often just the way such services operate. So long as everyone has access to the service, then it is just to provide it out of tax revenues. Every individual, when higher e"}, {"rank": 3, "docid": "test-education-ufsdfkhbwu-pro02b", "score": 0.7914632558822632, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 4, "docid": "test-free-speech-debate-yfsdfkhbwu-pro02b", "score": 0.7914632558822632, "is_gold": false, "snippet": "A bargaining chip, by definition needs to be part of a bargain. Using it to demand a change in the structure of the state as a whole is hardly reaching a bargain – it’s dictating a fiat. An invitation from a country to a university is a big step in expressing "}, {"rank": 5, "docid": "training-culture-aeuhbdcaal-con03b", "score": 0.7836205959320068, "is_gold": false, "snippet": "Opp’s case sounds excellent, and reasonable and sensible. And complete nonsense. Those countries that have changed their fee arrangements for students in recent years, such as the UK, have seen that students are very concerned with whether their degree is like"}, {"rank": 6, "docid": "test-free-speech-debate-yfsdfkhbwu-con03a", "score": 0.7808429002761841, "is_gold": false, "snippet": "Universities should exchange ideas not impose them  Of all possible institutions, for a university to suggest that it is not open to defending its ideas rather than insisting that they be artificially imported seems counter-intuitive. As Asian and European int"}, {"rank": 7, "docid": "test-education-ughbuesbf-pro01b", "score": 0.7786573171615601, "is_gold": false, "snippet": "There is no right to the university experience. University life is not used as the previous argument would suggest. University life is often about alcohol first, education second. Self­knowledge and genuine wisdom come from study and reflection. This can be do"}, {"rank": 8, "docid": "training-education-uhwecpuu-con01b", "score": 0.7757779359817505, "is_gold": false, "snippet": "Allowing market forces to control educational opportunity is as legitimate at university level as it is at school level. Parents wanting the best for their children should be allowed to spend the resources that they have accumulated in any way that they like, "}, {"rank": 9, "docid": "training-digital-freedoms-pidfakhwcs-pro02b", "score": 0.7741172313690186, "is_gold": false, "snippet": "These arrangements are so onerous that they will serve as a very real disincentive to universities taking public funding. Universities are rational in their decision-making, and they will be less likely to approve or participate in research projects that end u"}, {"rank": 10, "docid": "test-education-ufsdfkhbwu-con01b", "score": 0.7730743288993835, "is_gold": false, "snippet": "There is gradualism and then there is inertia. Refusing to cooperate with governments where individuals can be banned from addressing a group of students would seem to be setting the bar relatively low. In this particular instance, the bar doesn’t appear to ha"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-free-speech-debate-fsaphgiap-pro01a", "query": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who elected them, those who they are accountable to. A couple of days before John Atta Mills died Nii Lantey Vanderpuye a candidate for Mills’ party stated “He [Mills] is stronger and healthier than any presidential candidate”, information that in retrospect was clearly untrue. 1  1 Takyi-Boadu, Charles, ‘Confusion Hits Mills’, Modern Ghana, 21 July 2012,", "gold_docid": "test-free-speech-debate-fsaphgiap-pro01b", "rank_T": 7, "rank_baseline": 19, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-pro01a", "score": 0.7041032910346985, "is_gold": false, "snippet": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who e"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.5960565209388733, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.5960565209388733, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-pro02b", "score": 0.5821645855903625, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-pro02b", "score": 0.5821645855903625, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 6, "docid": "test-politics-cdfsaphgiap-pro01b", "score": 0.5546620488166809, "is_gold": false, "snippet": "If a candidate has a condition during an election campaign then there is a clear right to know when the electorate is making the decision. But does such a right to know apply at other times when it will make no difference to the people? There can only be a rig"}, {"rank": 7, "docid": "test-free-speech-debate-fsaphgiap-pro01b", "score": 0.5546620488166809, "is_gold": true, "snippet": "If a candidate has a condition during an election campaign then there is a clear right to know when the electorate is making the decision. But does such a right to know apply at other times when it will make no difference to the people? There can only be a rig"}, {"rank": 8, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.5390641093254089, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-pro03b", "score": 0.5390641093254089, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 10, "docid": "validation-digital-freedoms-phbphnrp-con02b", "score": 0.5246592164039612, "is_gold": false, "snippet": "While it is no doubt unfortunate that the innocent family members of politicians might feel unpleasant scrutiny, it remains essential to the promulgation of political accountability. Furthermore, it is valuable that citizens understand who their leaders are, a"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-pro01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who e"}, {"rank": 2, "docid": "test-free-speech-debate-fsaphgiap-pro02a", "score": 0.8604656457901001, "is_gold": false, "snippet": "The people are interested in the health of their leader  The health of the leader of the state is an issue that the people and the media inevitably want to know about. There will always be a lot of interest in it. Occasionally this can be played by the adminis"}, {"rank": 3, "docid": "test-politics-cdfsaphgiap-pro02b", "score": 0.8187525868415833, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 4, "docid": "test-free-speech-debate-fsaphgiap-pro02b", "score": 0.8187525868415833, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 5, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.8110055327415466, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 6, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.8110055327415466, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 7, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.8100517392158508, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 8, "docid": "test-free-speech-debate-fsaphgiap-pro03b", "score": 0.8100517392158508, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-pro03a", "score": 0.8043946027755737, "is_gold": false, "snippet": "Transparency allows citizens to choose for a healthy leader as to ensure proper functioning  The health and fitness of a leader is a vital issue when choosing a leader; the electorate deserves to know if they are likely to serve out their term. When health con"}, {"rank": 10, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.7963550090789795, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
{"qid": "test-politics-cdfsaphgiap-pro01a", "query": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who elected them, those who they are accountable to. A couple of days before John Atta Mills died Nii Lantey Vanderpuye a candidate for Mills’ party stated “He [Mills] is stronger and healthier than any presidential candidate”, information that in retrospect was clearly untrue. 1  1 Takyi-Boadu, Charles, ‘Confusion Hits Mills’, Modern Ghana, 21 July 2012,", "gold_docid": "test-politics-cdfsaphgiap-pro01b", "rank_T": 6, "rank_baseline": 18, "overlap@K": 0.7, "topK_T": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-pro01a", "score": 0.7041032910346985, "is_gold": false, "snippet": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who e"}, {"rank": 2, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.5960565209388733, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 3, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.5960565209388733, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 4, "docid": "test-politics-cdfsaphgiap-pro02b", "score": 0.5821645855903625, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 5, "docid": "test-free-speech-debate-fsaphgiap-pro02b", "score": 0.5821645855903625, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 6, "docid": "test-politics-cdfsaphgiap-pro01b", "score": 0.5546620488166809, "is_gold": true, "snippet": "If a candidate has a condition during an election campaign then there is a clear right to know when the electorate is making the decision. But does such a right to know apply at other times when it will make no difference to the people? There can only be a rig"}, {"rank": 7, "docid": "test-free-speech-debate-fsaphgiap-pro01b", "score": 0.5546620488166809, "is_gold": false, "snippet": "If a candidate has a condition during an election campaign then there is a clear right to know when the electorate is making the decision. But does such a right to know apply at other times when it will make no difference to the people? There can only be a rig"}, {"rank": 8, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.5390641093254089, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-pro03b", "score": 0.5390641093254089, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 10, "docid": "validation-digital-freedoms-phbphnrp-con02b", "score": 0.5246592164039612, "is_gold": false, "snippet": "While it is no doubt unfortunate that the innocent family members of politicians might feel unpleasant scrutiny, it remains essential to the promulgation of political accountability. Furthermore, it is valuable that citizens understand who their leaders are, a"}], "topK_baseline": [{"rank": 1, "docid": "test-free-speech-debate-fsaphgiap-pro01a", "score": 0.9999999403953552, "is_gold": false, "snippet": "The head of state/government must be accountable to the people  Secrecy in relation to the leader’s health shows a distrust or distain of the electorate. Not being open about health issues almost invariably means that the administration is lying to those who e"}, {"rank": 2, "docid": "test-free-speech-debate-fsaphgiap-pro02a", "score": 0.8604656457901001, "is_gold": false, "snippet": "The people are interested in the health of their leader  The health of the leader of the state is an issue that the people and the media inevitably want to know about. There will always be a lot of interest in it. Occasionally this can be played by the adminis"}, {"rank": 3, "docid": "test-politics-cdfsaphgiap-pro02b", "score": 0.8187525868415833, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 4, "docid": "test-free-speech-debate-fsaphgiap-pro02b", "score": 0.8187525868415833, "is_gold": false, "snippet": "The media always want a good story; they are interested in the health of celebrities when there is no clear reason why they should have any right to this private information. The health of the leader is not something that the press or public needs to know abou"}, {"rank": 5, "docid": "test-politics-cdfsaphgiap-con01b", "score": 0.8110055327415466, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 6, "docid": "test-free-speech-debate-fsaphgiap-con01b", "score": 0.8110055327415466, "is_gold": false, "snippet": "When leaders choose to serve the country they should be ready to sacrifice their privacy for the country. There is clearly a different standard for those who are in government and should be publicly accountable to those who are not. Even more minor illnesses c"}, {"rank": 7, "docid": "test-politics-cdfsaphgiap-pro03b", "score": 0.8100517392158508, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 8, "docid": "test-free-speech-debate-fsaphgiap-pro03b", "score": 0.8100517392158508, "is_gold": false, "snippet": "Administrative capabilities should not be compared to health. Unhealthy leaders may perform better than the healthy ones, people could be misled to choose inappropriate leaders while taking health as a black spot while the leader could actually have a better p"}, {"rank": 9, "docid": "test-free-speech-debate-fsaphgiap-pro03a", "score": 0.8043946027755737, "is_gold": false, "snippet": "Transparency allows citizens to choose for a healthy leader as to ensure proper functioning  The health and fitness of a leader is a vital issue when choosing a leader; the electorate deserves to know if they are likely to serve out their term. When health con"}, {"rank": 10, "docid": "test-politics-cdfsaphgiap-con02b", "score": 0.7963550090789795, "is_gold": false, "snippet": "Transparency is still better than secrecy. There are several reasons why the opportunity of instability is as present when keeping the leader's health a secret. The first is that it is likely that at least some of the leader's rivals are in government so are l"}], "notes": {"T_scoring": "<T(E_ft(q)), E_ft(d)>", "baseline_scoring": "<E_base(q), E_base(d)>", "baseline_model": "BAAI/bge-base-en-v1.5", "finetuned_ckpt": "results/arguana/bge/linear/lr5e-5_ep3_fbFalse_hnw0.0_temp0.02/20260119-185727/model"}}
